[
    {
        "title": "Room available near MHCC $400 plus utilities",
        "href": "/mlt/roo/4816857327.html",
        "time": "2015-01-03 21:47",
        "price": "$400",
        "neighborhood": " (4019 ne 10th terrace)",
        "postBody": "\n        120 sqft. room available just around the corner from MHCC. Currently three people living in the house in their early 20&apos;s. All clean, respectful, and responsible. We are looking for someone who is  quiet, clean and respectful preferably around our age but we are open to all. You need to be employed so that bills can be payed on time. You will be sharing a bathroom with one other person and have free range of all the common areas. There are laundry units in the house. Parking on the street. Rent is $400 plus utilities (usually around $480ish total). The room is not furnished but we have a mattress left here by a former roommate that is potentially up for sale if  needed. Call or text <br>\n <a href=\"/fb/pdx/roo/4816857327\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n, I work 7 to 3 everyday and can take calls and respond during the day. If I don&apos;t answer its cause my hands are full but will get back to you promptly!\n    ",
        "image": "http://images.craigslist.org/00h0h_ejEYNMTn9Q8_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4816857327.html"
    },
    {
        "title": "Cozy bdrms in vintage english cottage. Free utilities. Avalible Now",
        "href": "/mlt/roo/4827185458.html",
        "time": "2015-01-03 21:23",
        "price": "$425",
        "neighborhood": " (North Interstate/ Lombard)",
        "postBody": "\n        . I am offering 2 top floor bdrms in my quiet drama free home conveniently located one block off the MAX yellow line, one block to Interstate Fred Meyers, I-5 is two blocks away.<br>\nThe smaller bdrm is 425 and is about 11X11 and the larger room is 475 and is about 15X15.<br>\nThere is a half bath upstairs and a full bath with shower on the main floor.<br>\n<br>\nI have one boxer, which is the baby of the house.So, I don&apos;t need any more pets in the house.<br>\n<br>\nI prefer somebody who has a positive attitude and has things going on in their life. <br>\n<br>\nMust be working full time with a solid work history.<br>\n<br>\n<br>\n<br>\nLooking for somebody who is responsible and easy to get along with. Also somebody who won&apos;t drive the utilities through the roof to share this great house.<br>\n<br>\n<br>\n<br>\n<br>\nAbsolutely no drugs or alcoholics. Not 420 friendly.No couples.<br>\n<br>\nTotal move in cost: First/last.<br>\nLocation: North PDX\n    ",
        "image": "http://images.craigslist.org/01212_atDSM5Qsb3x_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4827185458.html"
    },
    {
        "title": "Room for rent",
        "href": "/mlt/roo/4831473184.html",
        "time": "2015-01-03 21:21",
        "price": null,
        "neighborhood": " (211th and Baseline St.)",
        "postBody": "\n        Room for rent . I have 2 rooms available .$350 a month seeking female boarders only to share a 6 bedroom home to 4 other female roommates, must be clean no drugs or alcohol and no sleep over allowed. in a quiet neighborhood. roommates are easy to lived with no drama\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831473184.html"
    },
    {
        "title": "= Great roommate wanted with furnished private bathroom =",
        "href": "/mlt/roo/4826887560.html",
        "time": "2015-01-03 21:20",
        "price": "$575",
        "neighborhood": " (Portland)",
        "postBody": "\n        Great roommate wanted with furnished private bathroom <br>\nGreat roommate wanted with furnished private bathroom <br>\n<br>\nI have a 2 bedroom, 2 bath upstairs apartments to share. Bedroom is large with your own private full bathroom with tub and shower.<br>\nI am a FABULOUS roommate, sensitive to the needs of others, and I am looking for a roommate who is equally conscious and courteous.<br>\nComplex is small (about 40 units) and very quiet, .<br>\nIt is in a residential neighborhood at 92nd between Burnside.<br>\nSorry, no pets of any kind.<br>\nI am a self-employed female. <br>\nUtilities generally don&apos;t run very high either. <br>\nThere is a washer and a dryer in the garage.<br>\nRent ($575 including utilities) is month-to-month and available now. \n <a href=\"/fb/pdx/roo/4826887560\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "image": "http://images.craigslist.org/00d0d_iPjpDA33zJb_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826887560.html"
    },
    {
        "title": "Female room to share with another female",
        "href": "/mlt/roo/4831478699.html",
        "time": "2015-01-03 21:18",
        "price": "$350",
        "neighborhood": " (Barbur boulverd)",
        "postBody": "\n        Clean and sober place: I am a female student I do not drink alcohol  and do not do drugs . I am  looking for a female with the same  frame of mind wanting to share my place , there is wireless in this place, utilities included,washer and dryer in the apartment building. Very close to Pcc 3 mile, ohsu  4 mile , Lewis and Clark college 1/4 mile , psu 2 mile  and sumner college 1 mile.   10 min to downtown portland . Across street from Fred myer Burlingame and terwilliger shopping complex on barbur blvd. Run errands at stores , shops,salons,ace hardware , bank,Starbucks and post office. Bus 1,12 , 38 ,39 ,65,65x,94 go outside the place . Price is 350 per month including utilities for shared room .if you reply by email don&apos;t forget to leave your phone number else it will go to junk mail , thank you.\n    ",
        "image": "http://images.craigslist.org/00j0j_jhqO4rgObRu_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831478699.html"
    },
    {
        "title": "Apartment for share- only female",
        "href": "/mlt/roo/4831468319.html",
        "time": "2015-01-03 21:03",
        "price": "$1129",
        "neighborhood": " (Lake oswego)",
        "postBody": "\n        I would like to share apartment which is located at Bonita RD, Lake Oswego - 97035. It is one bed room apartment along with one living room, kitchen and one wash room. It is semi furnished with BED and sofa. Looking for only female room mate. kindly contact me for further details.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831468319.html"
    },
    {
        "title": "Room in NE Portland Home",
        "href": "/mlt/roo/4824873172.html",
        "time": "2015-01-03 21:01",
        "price": "$460",
        "neighborhood": " (MLK &amp; Ainsworth)",
        "postBody": "\n        One room available in a beautiful, spacious inner NE Portland home, ideally located within close walking distance to both Alberta and Williams (great bars and restaurants!), close to two (TWO!!) New Seasons, and just a jaunt to Mississippi (more bars and restaurants!). Close to multiple bus lines (6, 72, 4, 44), and Safeway is literally across the street. The house features hardwood floors, built-in cabinets, and lots of natural light. <br>\n<br>\nAmenities:<br>\n*Washer/dryer on site<br>\n*Outdoor Grill<br>\n*Big-screen TV (HBO/cable)<br>\n*Two Full Bathrooms<br>\n*1 Large storage area<br>\n*Fireplace<br>\n<br>\nThe room: Fully finished basement room with big closet. You would share a bathroom with one cleanly individual. Basement also contains plenty of storage space and a half kitchen. <br>\n<br>\nUs:<br>\n <br>\nClaire: 24, wannabe anthropologist who loves popcorn, hoppy beers, Virginia Woolf, Joni Mitchell, This American Life, and British period pieces. <br>\n<br>\nLiam: 24, gay, recent college grad, Harry Potter and philosophy enthusiast, Bay Area sports fan (transplant from there), can make a mean grilled cheese sandwich.<br>\n<br>\nJennie: 25, Portland native (mostly), I&apos;m into running, yoga, and am kept pretty busy with working at a community health clinic and going to school a couple nights a week. <br>\n<br>\nEvan: 28, delightful, bearded gentleman with a flair for thoughtful political repartee by the fireside. (Jenny wrote that) I also like videogames and beer. <br>\n<br>\nYou: <br>\nWe all enjoy our independent lives, but value communal living. We are looking for someone who enjoys house hangouts on a fairly regular basis and wouldn&apos;t mind participating in an impromptu dance party in the dining room every once in awhile. We try to keep communal spaces neat and tidy, so we&apos;re looking for someone who will do the same. Sorry, no couples or pets. <br>\n<br>\nThe Nitty Gritty:<br>\nWe&apos;re looking for someone to move in on February 1st. We&apos;ll need to submit an application for you to our landlord, so ideally we&apos;ll have the process wrapped up by mid-January. Your monthly rent will be $460, and we split utilities five ways. Typically, they end up costing about $60/month. We&apos;ll need first and last month&apos;s rent, a $300 refundable deposit, and a $40 application fee, so your total move-in costs would be $1,260. <br>\n<br>\nIf you think you might be a good fit, please respond to this post via email and tell us a little about yourself. We can&apos;t wait to meet you!<br>\n\n    ",
        "image": "http://images.craigslist.org/00K0K_e8XVrDTRwr9_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824873172.html"
    },
    {
        "title": "One room available in charming NE home",
        "href": "/mlt/roo/4831453991.html",
        "time": "2015-01-03 20:47",
        "price": "$565",
        "neighborhood": " (ne portland)",
        "postBody": "\n        We are still looking to rent out our larger room that&apos;s still available for $565. All utilities plus internet is included in the rent. It is on the second floor, sits next to the half-sized bathroom, and has ample storage.<br>\nA little bit about us: We are both laid-back, friendly, enjoy making good food, and we love playing board games. We&apos;re also 420 friendly, LGBT friendly, and pet friendly, except for cats due to allergies. If you do have a dog, there&apos;s a pet deposit of $50 and they cannot be animal aggressive.<br>\nWe&apos;re asking for a $500 deposit and first months rent. <br>\nIf this sounds like a great fit for you, feel free to text me anytime. I may not be able to get back to you immediately, but I&apos;ll get back to you the same day.\n    ",
        "image": "http://images.craigslist.org/00g0g_lNux3WDVmkJ_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831453991.html"
    },
    {
        "title": "Great furnished room with private bath",
        "href": "/mlt/roo/4831448443.html",
        "time": "2015-01-03 20:42",
        "price": "$650",
        "neighborhood": " (NE Portland)",
        "postBody": "\n        I have a nice new private bedroom available starting now. It is furnished with a sitting area, dresser and queen bed with a headboard. All utilities are included. It is newly built in 2012 and only 4 blocks from Alberta street and 2 blocks from Alberta park. There is a full kitchen you would share with myself and a couple that are in the room next to yours. Respectful and quiet home in a nice neighborhood.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831448443.html"
    },
    {
        "title": "Incredible top floor of N. Mississippi St. house",
        "href": "/mlt/roo/4827218817.html",
        "time": "2015-01-03 20:37",
        "price": "$890",
        "neighborhood": " (1 block from Miss. St.)",
        "postBody": "\n        The top floor of our house is for rent. It&apos;s a beautiful place, definitely one of the best rentals in the historic Mississippi Street neighborhood, and at an excellent price. It&apos;s about 1100 square feet, with its own full bathroom (with slate floor and huge slate shower). It has beautiful wood floors, vaulted ceilings, many windows with good light and views of the neighborhood, the West Hills and Mt Hood. It has a small wet-bar area, a walk-in closet, two more large storage closets and French doors that open onto a small porch overlooking the neighborhood. And it&apos;s a good one. We&apos;re one block from all the shops, bars, restaurants, etc. on Mississippi Street, with a park two blocks away.<br>\n<br>\nThe space for rent is the top floor of a large 3 story renovated house/duplex. The first floor of the house is an entirely separate apartment from us. They&apos;re good neighbors. On the second floor are two occupied bedrooms, a full bathroom, laundry room, living room and beautifully remodeled full kitchen. You&apos;ll have the entire third floor to yourself. The two floors are connected via stairs, but there is NO door between the two floors. So it&apos;s a house-share with two other people, but really there is so much room up there that it&apos;s like its own apartment.<br>\n<br>\nThe folks on the second floor: two dudes (me, I&apos;m B, and my friend J). We&apos;re in our early 40&apos;s, we&apos;re both into bikes and a variety of outdoor pursuits. We have our own lives but sometimes meet up for beers. We&apos;re pretty quiet at the house, but sound does travel between the 2nd and 3rd floors, so we&apos;re looking for someone who is also fairly quiet. Let&apos;s see...what else? We keep regular hours. We try to keep a somewhat clean house (but we are guys, so it&apos;s never super clean.) Of course the kitchen, laundry room and living room are open for you to use as much as you like. Or if you want to mostly keep to the third floor (which is not shared, it&apos;s all yours), that&apos;s fine too.<br>\n<br>\nOK, the final details: Rent is 890/month, plus 1/3 utilities (about 75-150 each person, depending on the season). We have gas heat/AC and Wi-Fi internet. We don&apos;t have cable TV, but you can get your own. No smoking anything in the house. We&apos;re looking for ONE person (a guy will probably be the best fit for this place) who preferably has some similar traits to us, is drug-free and drama-free, clean and easy to get along with, and who definitely has the ability to pay rent each month on time. You&apos;ll need to sign on to the current lease with the rental management company. They just want to run a credit check and make sure you can pay the rent. No pets are allowed. The rental is available January 1st or later (pro-rated). It&apos;s a great place; we&apos;ve been here for many years. The previous roommate was here for 3 years, but he just bought a house.<br>\nIf you&apos;re interested, email me a few details about yourself and any questions you may have. We&apos;re hoping to fill it as soon as possible. It always gets taken fast, so if you think you want it, don&apos;t wait.<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/01515_8atR1dPgNFs_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4827218817.html"
    },
    {
        "title": "Free Room &amp; Board for Nanny Services",
        "href": "/mlt/roo/4831444289.html",
        "time": "2015-01-03 20:29",
        "price": null,
        "neighborhood": " (gresham)",
        "postBody": "\n        I&apos;m a 30 year old, single, working lady. I have a great, stable job and a baby on the way, due in April. I have a two bedroom duplex, with Dish, high speed Internet and meals to share.  I work at the office 3 days per week (trying to negotiate down to two) and telework from home the remaining work days. I can&apos;t afford daycare.  I am looking for a woman with childcare experience dealing with newborns and infants and willing to care for my child from 8am to 6pm 2 to 3 days per week and help me out during days I work from home. I&apos;m not able to pay a salary, but I&apos;m willing to cover rent, food, utilities,  and reasonable/negotiable living expenses. You are also welcome to have another part time job outside hours I need nanny help.  <br>\n<br>\nYou&apos;d have your own bedroom, but share the bathroom.  The bedroom has a futon, but I&apos;d be willing accommodate your bedroom furniture or help furnish with new furniture off Craigslist.<br>\n<br>\nDuplex has a deck with a nice view, yard (not fully fenced, you can garden, carport and extra parking spots, it&apos;s walking distance from lots of stores, library, post office and Gresham city hall Max station, right on bus lines 9 and 87. <br>\n<br>\nThis is obviously down the road a few months, but I wanted to start the search and put out feelers.  <br>\n<br>\nI will do a background check and require a drug free environment (sans 420 when I&apos;m around). <br>\n\n    ",
        "image": "http://images.craigslist.org/00S0S_b91mf6hzq8W_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831444289.html"
    },
    {
        "title": "Female room to share with another female",
        "href": "/mlt/roo/4831434486.html",
        "time": "2015-01-03 20:16",
        "price": "$350",
        "neighborhood": " (Barbur boulverd)",
        "postBody": "\n        Clean and sober place: I am a female student I do not drink alcohol  and do not do drugs . I am  looking for a female with the same  frame of mind wanting to share my place , there is wireless in this place, utilities included,washer and dryer in the apartment building. Very close to Pcc 3 mile, ohsu  4 mile , Lewis and Clark college 1/4 mile , psu 2 mile  and sumner college 1 mile.   10 min to downtown portland . Across street from Fred myer Burlingame and terwilliger shopping complex on barbur blvd. Run errands at stores , shops,salons,ace hardware , bank,Starbucks and post office. Bus 1,12 , 38 ,39 ,65,65x,94 go outside the place . Price is 350 per month including utilities for shared room .if you reply by email don&apos;t forget to leave your phone number else it will go to junk mail , thank you.\n    ",
        "image": "http://images.craigslist.org/00j0j_jhqO4rgObRu_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831434486.html"
    },
    {
        "title": "Quiet, charming, Very Large room!",
        "href": "/mlt/roo/4831383655.html",
        "time": "2015-01-03 20:13",
        "price": "$600",
        "neighborhood": " (se portland)",
        "postBody": "\n        $600 Large, quiet home / Reed College area (se portland)<br>\n<br>\navailable now<br>\n<br>\nokay if you play guitar <br>\n<br>\nprivate room, shared bathroom<br>\n<br>\nclean &amp; very quiet<br>\n<br>\nno pets (allergic)<br>\n<br>\non bus line &amp; near max, 2 other roommates<br>\n<br>\nLarge bedroom, high ceilings, built in bookcases. Furnished or unfurnished.<br>\n<br>\ncharm, 1920&apos;s house\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831383655.html"
    },
    {
        "title": "Rooms for Rent a must see",
        "href": "/mlt/roo/4831414657.html",
        "time": "2015-01-03 20:01",
        "price": "$450",
        "neighborhood": " (gresham)",
        "postBody": "\n        Rooms for rent close to Mount Hood Community College<br>\n       <br>\n<br>\n<br>\nWIFI AVALIBLE<br>\nFREE CABLE<br>\nGYM<br>\nFIREPLACE<br>\nPRIVATE PARKING<br>\nWASHER  AND DRYER<br>\n<br>\n<br>\n<br>\nA must see, eight bedroom house!!!!  There are three rooms available: 0ne master bedroom with walk in closet upstairs with your own entrance. Two downstairs with shared bathroom.  Two minute drive and 10 minute walk to MHCC; close to MAX Line; bus lines are 20-81.  Close to markets and shopping center.<br>\n<br>\n<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/01616_9VBbVHxO2jE_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831414657.html"
    },
    {
        "title": "Great Roommate Wanted - Private Bathroom $575 Inc Utilities",
        "href": "/mlt/roo/4821372544.html",
        "time": "2015-01-03 19:58",
        "price": "$575",
        "neighborhood": " (Mall 205/Gateway Area - 92nd and Burnside/Glisan)",
        "postBody": "\n        Hello!<br>\n<br>\nThank you for looking at my ad for a roommate!<br>\n<br>\n(FOR QUICKEST REPLY, PLEASE SEND ME YOUR EMAIL ADDRESS and I will send you an email about me and the apartment and what I am looking for in a roommate. This communication is going thru craigslist and my info/email won&apos;t go thru craigslist, so I need your email address please.)<br>\n<br>\nThoughtful, considerate roommate wanted. Clean, quiet, all the usual, right? LOL I am a FABULOUS roommate, sensitive to the needs of others, and I am looking for a roommate who is equally conscious and courteous.<br>\n<br>\nI have a 2 bedroom, 2 bath upstairs apartment to share. Bedroom is large with your own private full bathroom with tub and shower. Complex is small (about 30 units) and very quiet, in a residential neighborhood at 92nd between Burnside and Glisan.<br>\n<br>\nIn the pictures, I am showing you my bedroom and bathroom but yours looks the same.<br>\n<br>\nSorry, no pets of any kind.<br>\n<br>\nI am a self-employed female. Rent ($575 including utilities) is month-to-month and available now.<br>\n<br>\nEmail me for more information.<br>\n<br>\nREMEMBER: FOR QUICKEST REPLY, PLEASE SEND ME YOUR EMAIL ADDRESS AND I WILL SEND YOU AN EMAIL ABOUT ME AND THE APARTMENT AND WHAT I AM LOOKING FOR IN A ROOMMATE. THIS COMMUNICATION IS GOING THRU CRAIGSLIST AND MY INFO/EMAIL WON&apos;T GO THRU CRAIGSLIST, SO I NEED YOUR EMAIL ADDRESS PLEASE.<br>\n<br>\nThank you!<br>\n<br>\nVictoria<br>\n\n    ",
        "image": "http://images.craigslist.org/00r0r_4KvnQzYCHj7_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4821372544.html"
    },
    {
        "title": "Beautiful Views",
        "href": "/mlt/roo/4793972152.html",
        "time": "2015-01-03 19:48",
        "price": "$750",
        "neighborhood": " (nw portland)",
        "postBody": "\n        The pictures above are pre move in. We are fully furnished :) the measurements for the room are posted below. The pictures don&apos;t do it justice.<br>\n<br>\nLocation: A very nice 2,350sq ft. condo, right off of the Saint John&apos;s Bridge on NW Germantown Rd.  Cathedral Park, Safeway, Movie Theater and plenty of restaurants are right over the bridge.  Located right next to Forest Park hiking and bike trails, with a great view of the Portland Bridge&apos;s, mountain(s) and river friom all rooms, great neighbors and community, 5-7 minutes to Downtown Portland, 10 minutes to Janzen Beach &amp; 15 to Vancouver WA. Perfect location!<br>\n<br>\nThe room: 2nd master suite, 13&apos; by 12&apos;, with a queen sized pillow top bed and recliner, if needed (or unfurnished if preferred), has a medium walk in closet, 6&apos; by 7&apos;, and private bathroom. Cable ready, all available exfintiy premium channels including internet.<br>\n<br>\nRent:W/S/G, gas, electric, cable and Wi-Fi included for $750 monthly. To move in first and last month&apos;s rent.<br>\n<br>\nParking: There is limited parking in the community, but there is overflow parking about 50 yards up down or up Germantown Rd. There is also a bus stop for #16, that will take you directly downtown, right down the hill for your convince. <br>\n <br>\nThe Condo: Brand new with a very spacious, and open living area, large separate laundry room, partial fitness room, we are fully furnished and have a full kitchen with all that you would need to cook. We are 420 friendly but not 420 crazy. . .. This is NOTa party house<br>\n<br>\nThere are 2 labs and a cat that live here, we are a bit full on pets, so, small, nice, dogs are negotiable.<br>\n<br>\n -House guests are ok. Overnight guest&apos;s need to be at a minimum not looking for a 2nd roommate<br>\n<br>\n-A background check, references (including past rental history), and job check will be performed. There will be a $30 background check fee.<br>\n<br>\n-Must be willing to sign a 3 month lease that can change to month to month if preferred after that 3 month period.<br>\n<br>\n-Must be a neat person. <br>\n<br>\n-Someone who is mature and respectful of others things and space.<br>\n<br>\nWe do not have a set move in date.  If you are the right fit for us and us for you we can discuss what best works for all of us. Please send an email with a detailed description of yourself, what you are looking for in a roommate-ship and when you are looking to move. Serious inquiries only. We are looking forward to meeting with you!<br>\n<br>\n<br>\nNW Portland,  Saint Johns Bridge, Germantown Road, Cathedral Park.\n    ",
        "image": "http://images.craigslist.org/00V0V_gqqCMBTQKNF_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4793972152.html"
    },
    {
        "title": "Large, quiet home / Reed College area",
        "href": "/mlt/roo/4831371923.html",
        "time": "2015-01-03 19:38",
        "price": "$600",
        "neighborhood": " (se portland)",
        "postBody": "\n        clean &amp; very quiet<br>\n<br>\nabsolutely no pets (allergic)<br>\n<br>\non bus line &amp; near max, 2 other roommates<br>\n<br>\nLarge bedroom, high ceilings, built in bookcases. Furnished or unfurnished.<br>\n<br>\ncharm, 1920&apos;s house\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831371923.html"
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4831349431.html",
        "time": "2015-01-03 18:40",
        "price": null,
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Looking for Responsible, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.<br>\n\n <a href=\"/fb/pdx/roo/4831349431\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "image": "http://images.craigslist.org/00101_duzkYKcr8lm_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831349431.html"
    },
    {
        "title": "405 + electric",
        "href": "/mlt/roo/4831339648.html",
        "time": "2015-01-03 18:29",
        "price": "$405",
        "neighborhood": " (west slope)",
        "postBody": "\n        I have a cat and possibly getting another, its two bedrooms 1 bath. I have one of the bedrooms.  Im not the most tidy person in the world but i do try and keep my stuff picked up, you can have people over, because i will too. if you want to be on the lease you can but if you dont want to you dont have too. im looking for people my age (20&apos;s) with a job.  420 friendly .  Respectful. im pretty easy going .  buy your own food but we will share expenses for the house. please text me and i will get back to you with pictures of the place, or email me.  oh and the carpet is pretty messed up but working on fixing it. the place is by the 58 bus, and just a 15 min walk to walmart , fredmeyers and the bus 55 and 54. let me know if you have any questions. :)<br>\nmay be avalable sooner than january 30... but not before the 15\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831339648.html"
    },
    {
        "title": "Two rooms available off SE 87th and Flavel",
        "href": "/mlt/roo/4831319472.html",
        "time": "2015-01-03 18:09",
        "price": "$425",
        "neighborhood": null,
        "postBody": "\n        Two Rooms for rent<br>\nEach is 425 plus &#xBC; utilities. <br>\nDogs negotiable, but only if they get along well with the animals already living at the house. <br>\n<br>\nWho lives here:<br>\n<br>\nAndrea: The home owner. My super awesome and ambitious girlfriend who just bought a house! And she&apos;s only 25! She is a recent graduate from Pacific University, and is now working at a residential treatment facility. She has 3 animals which I will describe shortly. She realllllllly likes anything Buffy, SVU, V for Vendetta, and Magic the Gathering related. <br>\n<br>\nAngela (myself): I am the home owners girlfriend. I&apos;m a pretty shy and quiet person. I work at a French immersion school, and am a student at PSU. I enjoy a quiet environment. I prefer reading and doing puzzles over going out at night. <br>\n<br>\nJance: I just want to get the worst out of the way first. So Jance is an interesting dog. He is an old Australian Shepard. He really likes balls, so men proceed with caution (I joke). He can be intimidating when you first meet him, but if you can get past the initial barking when introduced you&apos;ll come to realize that he isn&apos;t at all aggressive like he sounds at first. The thing to be aware of most about Jance is his stinky farts, they will kill on impact.   <br>\n<br>\nOlivia: She is a really cute 9 month old German Shepard mix. She will be going through some training soon which will hopefully make her the perfect dog.  <br>\n<br>\nFox: He&apos;s my favorite. He&apos;s also a cat (who thinks he&apos;s a dog sometimes). Him and Olivia are best friends and its adorable. <br>\n<br>\nAbout the house and environment: <br>\nAndrea bought it within the last month and we have worked hard to refurbish the whole house. The exterior hasn&apos;t, but will soon, be painted. The house is fully furnished expect for the bedrooms. There&apos;s a decent sized back yard with room for garden space. There is lots of parking. We both like the house to be clean (her more so than I) so it is important that you pick up after yourself. <br>\n<br>\nWe&apos;re looking for someone who is responsible, quiet, has a reliable income, and doesn&apos;t do drugs or drink heavily. No kids, age range is early 20&apos;s to mid 30&apos;s. We are both sober so there will be no parties, but we don&apos;t mind that there&apos;s alcohol in the house. We&apos;d like housemates who we can have conversations with and sometimes hangout together. Please tell us about yourself. Your age, occupation, hobbies, etc. <br>\n<br>\nThank you.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831319472.html"
    },
    {
        "title": "Room for rent near Chiropractic University",
        "href": "/mlt/roo/4831302496.html",
        "time": "2015-01-03 18:02",
        "price": "$450",
        "neighborhood": " (Parkrose)",
        "postBody": "\n        Hello, <br>\nI have a room for rent about a block and a half from the University of Western States. There are four students living here currently (10th,9th, and 6th quarter). We are ideally looking for a fellow student to rent a small room in the basement. <br>\n<br>\n-utilities included in rent<br>\n-washing machine/ dryer/ dishwasher<br>\n-internet<br>\n-netflix/hulu/xfinity (no cable)<br>\n-1.5 blocks from the University of Western States Chiropractic University<br>\n-Large back yard with table <br>\n-2 full bathrooms (shared)\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831302496.html"
    },
    {
        "title": "House share with progressive early 30 somethings",
        "href": "/mlt/roo/4831311677.html",
        "time": "2015-01-03 18:01",
        "price": "$475",
        "neighborhood": " (inner NoPo)",
        "postBody": "\n        A room is available in our home Feb 1. Seeking  a reliable, queer friendly, and generally friendly person to fill it!<br>\n<br>\nABOUT THE HOUSE: Multiple bay windows, allowing for tons of sunlight and views of trees. Hard wood floors. The available room is upstairs and shares the upstairs level (including a bathroom) with 1 person. Downstairs there are 2 bedrooms, a kitchen, a breakfast nook, a living room, dining room, and another bathroom. There is also a basement for all of your storage and laundry needs. Backyard has a patio, fireplace, and plenty of gardening space.<br>\n<br>\n LOCATION: Nestled between Alberta St and Mississippi Ave.  We are blocks away from bars (Florida Room, Seraveza), cafes, restaurants (lots of Ethiopian places), the library, and Peninsula Park. <br>\n<br>\nABOUT THE HOUSEMATES: 3 women in our early 30&apos;s. A social worker, a nurse, and teacher&apos;s assistant.  We get along and enjoy each other&apos;s company, but we each have pretty busy schedules. We&apos;re stable, friendly, and respectful. There is also a large, friendly dog in the home. Dog lovers are encouraged to apply, but please note that we cannot have additional pets.<br>\n<br>\nTHE DETAILS: $475/mo + around $100/mo for utilities. Security Deposit is $665. <br>\n<br>\nIf interested, please shoot us an e-mail and tell us a bit about yourself and what evenings you are available to meet/tour the house.\n    ",
        "image": "http://images.craigslist.org/00505_a0hZBE11XJV_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831311677.html"
    },
    {
        "title": "Female room to share with another female",
        "href": "/mlt/roo/4831297310.html",
        "time": "2015-01-03 17:47",
        "price": "$350",
        "neighborhood": " (Barbur boulverd)",
        "postBody": "\n        Clean and sober place: I am a female student I do not drink alcohol  and do not do drugs . I am  looking for a female with the same  frame of mind wanting to share my place , there is wireless in this place, utilities included,washer and dryer in the apartment building. Very close to Pcc 3 mile, ohsu  4 mile , Lewis and Clark college 1/4 mile , psu 2 mile  and sumner college 1 mile.   10 min to downtown portland . Across street from Fred myer Burlingame and terwilliger shopping complex on barbur blvd. Run errands at stores , shops,salons,ace hardware , bank,Starbucks and post office. Bus 1,12 , 38 ,39 ,65,65x,94 go outside the place . Price is 350 per month including utilities for shared room .if you reply by email don&apos;t forget to leave your phone number else it will go to junk mail , thank you.\n    ",
        "image": "http://images.craigslist.org/00j0j_jhqO4rgObRu_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831297310.html"
    },
    {
        "title": "1604 SW CLAY",
        "href": "/mlt/roo/4831287231.html",
        "time": "2015-01-03 17:37",
        "price": "$450",
        "neighborhood": " (PORTLAND)",
        "postBody": "\n        my friend and i live in an apartment. we want a roommate and s/he will have a private room but the bathroom is sharing. it is not far from downtown, it is takes you 12 minute to get there by walking.<br>\n<br>\n# I want to meet the person who want the room before my friend and i agree\n    ",
        "image": "http://images.craigslist.org/00S0S_azUR46LhaiD_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831287231.html"
    },
    {
        "title": "#408 Return to a Beautiful 2BR Home with Floor-to-Ceiling Windows!",
        "href": "/mlt/roo/4831231570.html",
        "time": "2015-01-03 17:33",
        "price": "$700",
        "neighborhood": " (Portland, OR)",
        "postBody": "\n        <b> Welcome to MW8 Apartments. </b><br> 2 Bed 1 Bath &#x2014; 2 &#xA0;bed / 1 bath / 627 sq ft / $1,625 - $1,710 <br><h2>MW8</h2><p>434 Sw College St Portland, OR 97201<br><br><b>Property Website: </b><br>http://www.mw8apartments-dot-com/</p><br><p><b>Want more information?</b> http://unit-availability.com/lead/501351190510/1?extnId=3793327<br></p><h2> Call Us Today! \n <a href=\"/fb/pdx/roo/4831231570\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nx229 </h2><p><strong> Property Description </strong><br> MW8 has a two-bedroom, one-bathroom home with an equipped kitchen, featuring stainless steel appliances and Corian countertops. It also has a dishwasher and the utility closet comes with laundry appliances. Call to learn about living with your cat or dog. </p><strong> Floor Plan/Unit Features <br></strong> * Individual Climate Control <br> * Washer/Dryer in Unit <br> * Disposal <br> * In-Unit Washer/Dryer <br> * Private Decks <br> * Refrigerator <br> * Microwave <br> * Dishwasher <br> * Key Fob Entry <br> * City Views <br> * Corian Countertops <br> * Stainless Steel Appliances <br><br><strong> Property Amenities <br></strong> * Secured Bike Storage <br> * On-site Maintenance <br> * Elevator <br> * Rain Water Wall In Lobby <br> * Minutes From OHSU <br> * Close To Portland Street Car <br> * ValetWaste <br> * Ground Floor Restaurant <br> * Package Receiving <br> * Near Public Transit <br> * Controlled Access <br> * Green Roof Technology <br> * Night Patrol <br> * Applying For Leed Gold Certification <br> * On-site Management <br> * Easy Freeway Access <br> * Close To Max Light Rail <br> * One Block From Portland State University <br><br><p></p><p><strong>Parking:</strong><br></p><p><strong>Pet Policy:</strong><br> Cats and Dogs are allowed. <br><br>Limit of 2 pets maximum. $250 non-refundable pet fee per pet. $25 monthly pet fee per pet. Breed restrictions - Please call for more details. </p><p><strong>Units:</strong> 54 </p><p><strong>Office Hours</strong><br></p><p><i>Monday-Friday 9-6</i></p><p></p><p><strong>Management Company:</strong><br> Greystar </p><p><b>Call Us Today! </b> \n <a href=\"/fb/pdx/roo/4831231570\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nx229 </p><p>Equal Housing Opportunity</p>\n    ",
        "image": "http://images.craigslist.org/00Y0Y_4IXgbbFOBDP_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831231570.html"
    },
    {
        "title": "Room for rent Must Love dogs! Female Only",
        "href": "/mlt/roo/4831274107.html",
        "time": "2015-01-03 17:25",
        "price": "$450",
        "neighborhood": " (Troutdale)",
        "postBody": "\n        My husband and I have a 3 bedroom 2.5bath 1800+sq ft home in Troutdale and are looking for a roommate to help pay the mortgage. The room is available Jan 1st.<br>\n<br>\nWe have 5 indoor dogs and a large fenced yard. All are Havanese Poodle mixes that are around 10lbs each. We are looking for not only a person we can live with, but that will treat our dogs like their own family. If you are not a dog lover then you would not be happy with us. No cats. I also board dogs here at the house.<br>\n<br>\nWe have a 10&apos;x12&apos; bedroom available as pictured below with a full bathroom directly across the hall from it. This would be your bathroom exclusively and has a tub shower combo. <br>\n<br>\nWe would share the rest of the house excluding our bedrooms and bathroom. The $450 would cover all utilities including internet and TV. We have some small space in the garage for extra storage but not much.<br>\n<br>\nWe have a lovely front loader washing machine and dryer, gas stove, gas fireplace and a 400sqft deck. The house backs up to trees and a small walking trail that runs throughout the neighborhood and down towards downtown Troutdale.  Also a small pond in the back yard perfect for summer relaxing.<br>\nThe house is in a very nice quiet cul de sac built in 1996 and filled with upper middle class families with lots of children and trees. We are close to Mount Hood community college but not within walking distance. It&apos;s 2 miles away. We are less than 5 minutes by car to grocery stores, library, Walmart or the outlet mall. There is room in the driveway to park your car as the garage is used for storage.  Your car must be in running condition.<br>\n<br>\nWe are looking for a Female roommate who is mature (over 25), responsible, EMPLOYED and pays her bills on time.  <br>\n<br>\nI am 36 and my husband is 50 so anywhere near those ages would be good. (I&apos;m kind of an old soul and he&apos;s rather immature so we both act around 40) I am home a great deal but my husband works out of town and so will only be home on his days off. He is here about 60% of the time. He may stay for a week, then be gone for a week type thing.<br>\n<br>\nSome of his interests are hiking, camping, windsurfing, surfing, snowboarding and being active.<br>\n<br>\nSome of mine are reading, computers, anything to do with dogs, Vintage VWs, going to the theater, belly dance, cooking, art, poi spinning and music.<br>\n<br>\nWe are pretty open minded people and hope you will be too. We are LBGT friendly. We will not push our religious beliefs on you and expect you not to push yours on us. We are not neat freaks but we aren&apos;t total slobs either. We recycle and are energy conscious. We like to keep the house temperature around 66-70 degrees whenever possible. We are meat eaters. My decorating style is very eclectic and colorful. We are 420 friendly but will not tolerate cigarettes.  (asthma) I am allergic to most perfume so I am seriously hoping to find a woman who doesn&apos;t wear any. We don&apos;t have company over all that often. We would like to find someone who will live with us for a while, we don&apos;t want to be the neighborhood flop house. No cats.<br>\n<br>\nMust have good references. Proof of stable employment as well as a $400 deposit.<br>\n<br>\n<br>\nIf after all this you are still interested then send an email.<br>\n<br>\n<br>\nFeel free to ask us any questions. The house is in the Strawberry Meadows neighborhood of Troutdale.<br>\n\n    ",
        "image": "http://images.craigslist.org/00N0N_83oTry9VzAv_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831274107.html"
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4825332076.html",
        "time": "2015-01-03 17:16",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY.  <br>\n <a href=\"/fb/pdx/roo/4825332076\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4825332076.html"
    },
    {
        "title": "BIG Room in Cool SE Home- ALL utilities included",
        "href": "/mlt/roo/4831258174.html",
        "time": "2015-01-03 17:11",
        "price": "$595",
        "neighborhood": " (Arleta/Woodstock)",
        "postBody": "\n        Big Room available in cool SE Portland house shared with two mature gentlemen, two small dogs and a cat. House is in the Arleta neighborhood, just 3 blocks to cafe&apos;s, pubs, stores, and Mt. Scott Park and Community Center. On the Tri-met #10 busline. Fully equipped kitchen, laundry room. The room is very large, has two big windows, reach in closet, and a loft which can be used for sleeping, display, storage or...? Brand new carpeting, paint, lighting and window treatments. Rent is $595 per month, and includes all utilities, including high speed WiFi. Small pets are negotiable. Please call William \n <a href=\"/fb/pdx/roo/4831258174\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n if you&apos;d like more information. NO TEXTS please, they will not be returned.<br>\n <br>\nReedway at SE 68th\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831258174.html"
    },
    {
        "title": "Female roommate, $465, private room",
        "href": "/mlt/roo/4831246517.html",
        "time": "2015-01-03 17:09",
        "price": "$465",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Private bedroom in quiet apartment in Gresham near Fairview, private bath with Jacuzzi tub and shower, shared kitchen, living room, common area, washer/dryer in unit, south-facing deck with sliding door, off-street parking, end unit, garbage and utilities included in rent. Split PGE, Comcast (internet and basic cable). <br>\n<br>\nClose to bus lines and other public transit (walking distance).<br>\n<br>\nI am a 31 year-old female working professional. I have one cat that stays in my room. I enjoy all kinds of music, baking, reading, arts and crafts, and theater. I prefer non-smoking, no drugs and no drama. I would like someone with a steady income.  I am looking for a friendly, kind and reliable roommate.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831246517.html"
    },
    {
        "title": "2 Rooms for price of one for rent - Must see!",
        "href": "/mlt/roo/4824026653.html",
        "time": "2015-01-03 17:05",
        "price": "$750",
        "neighborhood": " (NE Portland Ainsworth)",
        "postBody": "\n        I&apos;m looking for a housemate to share my home. I do have one other roommate. I live a few blocks away from Peninsula Park and not that far from hot Mississippi, Killingsworth, Alberta Arts district on Ainsworth. Close to buslines on MLK and fairly close to the MAX lines on Interstate. There is great bike lanes up and down Williams and Vancouver I use a lot.<br>\n<br>\nAbout the room:<br>\nYou get 2 rooms! Both rooms have hardwood floors. Both have closets. Feel free to use the extra room for an office or even a giant walk-in closet. My kitchen is newly remodeled - cork floor, new appliances, gas range, hot water dispenser (great for coffee, cup-a-noodle or hot tea), pantry - great for cooking! Lots of perks: new washer/dryer, hi-speed WIFI throughout, digital HD cable in every room, big flatscreen with huge movie collection and HBO (at least till my trial runs out ha)<br>\n<br>\nI&apos;m a professional photographer and my other roommate Matt works at Adidas. I don&apos;t use any drugs - just some drinks with friends. I&apos;m probably the most laid back guy you will meet. Into rock climbing, sort of a foodie so I eat out a lot - so the kitchen is all yours! NO PETS! Sorry.<br>\n<br>\n<br>\nThe rent, which includes all utilities, is $750 a month flat rate. I hate cutting up all the bills. It makes it easier. $100 refundable deposit and first/last months rent due. <br>\n<br>\nIf you are interested then please reply to this by telling me a little bit about yourself, name, phone number with your email address and any questions you would like answered. Come by for a tour! <br>\n<br>\nNo smoking of any kind in the house, no drugs, NO PETS!<br>\n<br>\nThe room is available now. We can pro-rate the rent.<br>\n<br>\n<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00G0G_8Urr1r6ABDj_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824026653.html"
    },
    {
        "title": "Room for rent. Available 3/1",
        "href": "/mlt/roo/4831245729.html",
        "time": "2015-01-03 17:00",
        "price": "$600",
        "neighborhood": " (SE Pdx)",
        "postBody": "\n        I have a room to rent in my home in SE Portland. I would be happy to do short term or longer term. <br>\n<br>\nModerate alcohol use is OK, but no heavy drinkers, daily marijuana users or hard drugs<br>\n. <br>\nAbout me: 43 (act a bit younger), medical social worker at Providence. I enjoy cooking, running, dancing, traveling, road trips, nature, hanging out with friends. I&apos;m friendly, pretty neat/clean, somewhat quiet at home, since I need to unwind from my job. I work M-F 9-5. I generally go to bed early during the week. <br>\n<br>\nI&apos;m progressive and open-minded, LGBT friendly. I am open to being friends and social on occasion, but mostly will be doing my own thing. I have a newish boyfriend that has his own place, but would be here at times. I have a lot of friends and I&apos;m out a fair bit, but don&apos;t entertain at home a whole lot.    My house is small enough that we would be interacting a fair bit while we are here, so it is important to be friends and get along well. Good sized bedroom and shared living spaces and bathroom. The kitchen is nice and I have a lot of pots/pans/cooking utensils. The backyard is huge (feel free to garden- I don&apos;t!) and great in the summertime.  <br>\n<br>\nI would rent the room for 600/mo, includes utilities. It&apos;s a nice cozy home with a big back yard, which is great for barbecues and lying in the hammock. If you like to garden, it&apos;s perfect, though I don&apos;t do a whole lot, since I&apos;m busier than I&apos;d like to be. That said- you&apos;d have the place to yourself quite a bit.   <br>\n<br>\nMy place is not really big enough for more than one roommate (it&apos;s about 1130 sq feet). I don&apos;t have pets, but like small dogs and cats, but you would have to be the one taking care of the pet full time. <br>\n<br>\nSince I own the home, I plan on doing all the basic house maintenance, etc, but roommate would need to keep common spaces clean and help out some around the house (garbage, recycling, dishes) I&apos;m clean, so cannot live with really messy people, but don&apos;t get too uptight either. <br>\n<br>\nI&apos;d love to hear from you if interested!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831245729.html"
    },
    {
        "title": "Female Student Looking for off campus student housing close Mt. Hood?",
        "href": "/mlt/roo/4793410892.html",
        "time": "2015-01-03 16:47",
        "price": "$575",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Looking for affordable off campus student housing without the responsibility of bad roommates? or paying more for a place on your own? NW Student Housing is a great resource for you. Right now we have a room available by Mt. Hood Community College for a Female student. It is located exactly one mile away from school cutting your commute time. Easy access to public transportation. We have two different times of packages you can choices from single occupancy to double dorm style. Basic furnishing provided. UTILITIES INCLUDED AND WIFI INSTALLED BEFORE MOVING IN! Please visit us at www.nwstudenthousing.com We are open seven days a week Monday through Friday 8:30 a.m through 5:30 pm and Saturdays 10:00 am through 5:00 p.m. Give us a call at <br>\n <a href=\"/fb/pdx/roo/4793410892\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor TOLL Free at <br>\n <a href=\"/fb/pdx/roo/4793410892\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n We look forward to hearing from you.\n    ",
        "image": "http://images.craigslist.org/01212_4VjML3BIP6w_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4793410892.html"
    },
    {
        "title": "Nice 2 bedroom/bathrooms _Seeking For roommate_ Deposit Free",
        "href": "/mlt/roo/4831156782.html",
        "time": "2015-01-03 16:43",
        "price": "$420",
        "neighborhood": " (Portland)",
        "postBody": "\n        Nice 2 bedroom/bathrooms _Seeking For  roommate_ Deposit Free<br>\n<br>\nSpacious 2 bedroom and 2 bathroom luxury condo, approximately 1400 square feet.<br>\nThe Condo is brand new with hardwood flooring in the kitchen, dining.<br>\nLiving room area, 10&apos;-12&apos; ceilings, stainless steel refrigerator, granite countertops, and a nice view from the balcony.<br>\nCondo amenities feature 24-hour concierge, state-of-the-art fitness center.<br>\nThere is private underground parking in the condo building garage for free.<br>\nWasher and Dryer are included. Utility bills will be shared.<br>\nThe master bedroom is fully furnished with a set of furniture including queen size bed, two night stands and a big dresser.<br>\nIt has the private bathroom with double sinks, spacious cabinets below the sinks.<br>\nThe room also has a big walk-in closet capable of storing all your clothes as well as lots of other personal belongings.<br>\nNo smokers and no pets allowed. Rent is $420 and No Deposit required. <br>\nWill do month to month or short term lease and you may move out upon 30 days notice.<br>\n<br>\ntext here \n <a href=\"/fb/pdx/roo/4831156782\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "image": "http://images.craigslist.org/00V0V_bBplYq5KPwo_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831156782.html"
    },
    {
        "title": "Looking for a roommate in Fairview",
        "href": "/mlt/roo/4831222108.html",
        "time": "2015-01-03 16:39",
        "price": "$550",
        "neighborhood": " (Courtyards at Fairview)",
        "postBody": "\n        I have a 2b/2b. 3rd Floor. $975 rent.. $75 electric in the winter.. half that in the summer.. $30 Internet.. Total- $550 EACH. Month-to-month. You will be on the lease.<br>\n<br>\nHere are images of the place..<br>\n<br>\nhttp://www.apartmentguide.com/apartments/Oregon/Gresham/Courtyards-at-Fairview/163150/<br>\n<br>\nI have a dog that will be in common areas. I do not lock her up. I don&apos;t work very much, and I hang around the house often either reading or on my computer when its rainy. I am vegan. I spend every nice day outdoors. I hike a lot. I go to yoga. I volunteer. I go on a lot of road trips. If it&apos;s a nice weekend, I will most likely be camping. I like non-violent communication practices. I am conscious and would like to find a drama-free roommate. I am generally clean b/c I don&apos;t own very much, but obviously you have to be someone who doesn&apos;t get bothered by dog hair. <br>\n<br>\nNo smoking. No pot/ drugs. No alcohol please. No pets.. My dog was attacked by someone else dog recently.. and now she is terrified of dogs, which is a huge bummer. Must have a clear background check to live here.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831222108.html"
    },
    {
        "title": "Room for rent",
        "href": "/mlt/roo/4824370707.html",
        "time": "2015-01-03 16:12",
        "price": "$700",
        "neighborhood": " (Woodvillage)",
        "postBody": "\n        Room for rent in 1 level , 3 bedroom 2 bathroom home in quiet upscale neighborhood. <br>\nFully furnished. <br>\n<br>\nShare with one other professional person. <br>\nMust like cat&apos;s <br>\n<br>\nThis is a month to month rental agreement and includes weekly landscaping maintenance. <br>\nFirst and last month deposit. Utilities extra<br>\n<br>\nBackground check is required <br>\n<br>\nPlease respond to this email for additional information<br>\n<br>\nThank you <br>\n<br>\nKeith\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824370707.html"
    },
    {
        "title": "**Clean Quiet Room for Rent**",
        "href": "/mlt/roo/4828024016.html",
        "time": "2015-01-03 16:05",
        "price": "$500",
        "neighborhood": " (NE Portland)",
        "postBody": "\n        Roommate wanted to share 4bdrm house in NE Portland. Close to Trimet.\n    ",
        "image": "http://images.craigslist.org/01111_b2gpC5sCkpc_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4828024016.html"
    },
    {
        "title": "Vegetarian, Clean, Quiet",
        "href": "/mlt/roo/4831165658.html",
        "time": "2015-01-03 15:53",
        "price": "$450",
        "neighborhood": " (SW, near PCC Sylvania)",
        "postBody": "\n        Looking for a woman to share a vegetarian and clean house in a quiet residential neighborhood.<br>\n<br>\nConvenient location: about 1/2 mile from PCC Sylvania, 1/4 mile from Barbur Transit Center and I-5, and 2 blocks from a bus stop..<br>\n<br>\nHigh-speed wireless internet access.  Includes utilities. <br>\n<br>\nNo pets.  No smoking.<br>\n<br>\nIf you want a response, please tell me something about yourself and why you would make a good house-mate.\n    ",
        "image": "http://images.craigslist.org/00U0U_3Chccqw3s9o_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831165658.html"
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4828101597.html",
        "time": "2015-01-03 15:32",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY.  <br>\n <a href=\"/fb/pdx/roo/4828101597\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4828101597.html"
    },
    {
        "title": "Room for Rent w/ Separate Private Bathroom / Bonus Room Available $200",
        "href": "/mlt/roo/4824702091.html",
        "time": "2015-01-03 15:23",
        "price": "$675",
        "neighborhood": " (NE Killingsworth / Alberta / Dekum)",
        "postBody": "\n        The Room:<br>\nI have a 100 sq. ft. bedroom for rent with its own separate full bathroom right next door. There is also an adjacent 100 sq. ft. room available for storage, office, or a chill room for extra monthly fee ($200 / extra).<br>\n<br>\nThe House:<br>\nNE Portland townhouse. Newer construction and energy efficient (built in 2010). Within walking distance to Dekum, Alberta, and Mississippi streets. Shared living space is the kitchen / dining room / living room all combined into one space (think townhouse). There is also a small garage for storage and a modest backyard. <br>\n<br>\nUs:<br>\nYou would share the house with two sophisticated 30 year old men (Portland local high school buddies). We have a large variety of interests and intellectual pursuits. We are both very active and enjoy the Pacific Northwest and all it has to offer to the fullest.  While we share the same circle of friends, we operate independently of each other, which is something we would value in our third housemate.<br>\n<br>\nThe Kitchen:<br>\nWe both like to cook but often cook separately of each other i.e. we don&apos;t regularly have formal group dinners. We have newer appliances and plenty of cookware, so if you like to cook, you&apos;ll enjoy this kitchen.<br>\n<br>\nYou:<br>\nYoung professional type, with a steady job, who is chill and vibes well with us. <br>\n<br>\nMusts:<br>\nclean<br>\ntimely with rent<br>\nsteady job / young professional<br>\neasy demeanor <br>\nindependent<br>\nno pets<br>\n<br>\nPreferences:<br>\nnon-smokers <br>\n<br>\nRent Terms:<br>\nThe term is 3 months minimum and then month to month after that. Room is available now but an ideal move-in date would be sometime in January 2015. First month&apos;s deposit required. <br>\n<br>\nUtilities:<br>\nUtilities will be divided by 3.<br>\naverage utilities: $100/month<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00l0l_gWy9M49yW3a_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824702091.html"
    },
    {
        "title": "Need One Roomate for a Two Bed/Bath Apartment ($400/mo)",
        "href": "/mlt/roo/4821405014.html",
        "time": "2015-01-03 15:19",
        "price": "$860",
        "neighborhood": " (Troutdale)",
        "postBody": "\n        Thank you for taking the time to read this ad.<br>\n<br>\nMy name is Harley and my girlfriend and I moved into an apartment with a previous roommate over the summer. We have a lease that is signed until July 2015, and our previous roommate has since moved out. <br>\n<br>\nWe are in need of a roommate that would be able to afford roughly $400/mo. The breakdown of this amount can be found at the bottom of this ad. We are also asking a $200 security deposit that you would of course get back once our deposit comes in after the lease is up. <br>\n<br>\nThe apartment complex is Beaver Creek Meadows Apartments in Troutdale Oregon. It is LITERALLY right next to Mt. Hood Community College and so would be great for a fellow student. The apartment is nearly 1,000 sq feet, and it&apos;s a two bedroom two bath meaning that you would get your own bedroom (My girlfriend and I are sharing the master bedroom) and you&apos;re own bathroom. Washer and dryer in unit so you can do laundry whenever you&apos;d like. Full size kitchen, living room, dining room, and balcony. There is also two assigned parking spots, and you would have one of them. No pets are allowed in this complex so we don&apos;t have any. No smoking cigarettes inside the apartment, but my girlfriend is a smoker. You can find more information about the complex at their website at http://www.beavercreekmeadows.com/<br>\n<br>\nWe need to find a roommate by the end of December so that we can afford rent for January. If you&apos;re interested, please shoot me a email, call, or text me at \n <a href=\"/fb/pdx/roo/4821405014\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nso we can set up a time for us to meet and discuss details. <br>\n<br>\nAny furniture found in the pictures above are available to you at no cost if you decide to move in. If you choose that you don&apos;t want them, we will dispose of them for you.<br>\n<br>\nPrice breakdown:<br>\n&#x2022; Rent: $860/mo (Includes basic utilities)<br>\n&#x2022; Internet: $45/mo<br>\n&#x2022; Electric: $100/mo (Avg)<br>\n&#x2022; Groceries: $200/mo (Avg)<br>\n<br>\nSince there are three people living in the apartment, the total expenses of about $1200/mo would be divided by three making an equal amount of $400/mo each. <br>\n<br>\nPreferences:<br>\n&#x2022; Young Adult<br>\n&#x2022; College Student at MHCC<br>\n&#x2022; Steady Income<br>\n&#x2022; Reliable<br>\n<br>\nYou will also be required to be able to pass a background check, and willing to sign to be added to the lease until July 2015.\n    ",
        "image": "http://images.craigslist.org/00p0p_lqWROsx9gyt_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4821405014.html"
    },
    {
        "title": "LETS HELP EACHOTHER OUT! / ESPACIO PARA RENTAR, SI ABLO ESPANOL",
        "href": "/mlt/roo/4831100402.html",
        "time": "2015-01-03 15:18",
        "price": "$366",
        "neighborhood": " (GRESHAM)",
        "postBody": "\n        Hey, hey..... I&apos;m lookin for someone who&apos;s lookin to rent a place to stay for a while ASAP! It&apos;s only a one bedroom, I am willing to rent out the dinning room area, water/sewer/garbage paied. Washer/dryer in unit.Very clean unit, apartment complex in Gresham, on 9 bus line. Pool, hot tub. must be HONEST, DRAMA FREE, RESPECTFUL, AND DRUG FREE. If you are interested hit me up for more details. \n <a href=\"/fb/pdx/roo/4831100402\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n               buscando a alguien que quiere alquilar un espacio para vivir por un tiempo. los apartamentos est&#xE1;n en Gresham, en el oeste de Powell. lavadora y secadora incluidas. necesita a alguien honesto, respetuoso y limpio. y parecen ser espa&#xF1;ol, mas informaci&#xF3;n llame o me texto. \n <a href=\"/fb/pdx/roo/4831100402\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n gracias\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831100402.html"
    },
    {
        "title": "1.5 blocks from University of Western States",
        "href": "/mlt/roo/4831119073.html",
        "time": "2015-01-03 15:17",
        "price": "$500",
        "neighborhood": " (132nd Ave NE)",
        "postBody": "\n        Room for rent 1.5 blocks from University of Western States. This is a shared air conditioned accommodation with full access to the kitchen, living room, laundry. Also included is wireless internet and telephone anywhere in North America.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831119073.html"
    },
    {
        "title": "Furnished Rm in OHSU Rooming House Great for Medical Rotation &amp; Intern",
        "href": "/mlt/roo/4831088262.html",
        "time": "2015-01-03 15:02",
        "price": "$750",
        "neighborhood": " (Under Tram OHSU Above Southwater Front)",
        "postBody": "\n        Furnished cozy large room in 100 year old /Victorian house <br>\nSunny, slanted ceilings with posted bed<br>\nFeels like a 1940s rooming house<br>\nAll linens provided with weekly changes<br>\nClean,  private, and quiet<br>\nClose in: 20 min walk to Downtown &amp; PSU and 7min walk to OHSU tram lower campus <br>\nPark your car on street and just walk to OHSU and Downtown<br>\nWalk across new Gibbs pedestrian walkway to tram and trolly, OHSU lower campus <br>\nComfortable furnishings from 1940&apos;s read in a rocking chair or study at the desk<br>\nBath in hall with tiled shower shared with one other room<br>\nEntrance from private hallway<br>\nPlace for study <br>\nUtilities included in rent.... Wifi and fridge in room<br>\nSit on the front porch and get  a zen look at the river<br>\nHardwood floor<br>\nHospitality-food warming area with tea and coffee/microwave/toaster oven<br>\nGreat neighborhood feeling. <br>\nSafe to walk at night<br>\nInternational/Graduate Students welcome<br>\nWell connected to the city with mass transit<br>\n#17 a 3 block walk (frequency 7 minutes a 5 min ride to dntwn)<br>\n#12  a 3 blocks walk (frequency 10 minutes to dntwn a 5 min. ride)<br>\n#36 one block walk (frequency 20 minutes to dntwn a  5 min ride)<br>\nPortland Street Car &quot;Trolly&quot; 3 blocks away $1 per ride<br>\nMax Line 10 blocks away <br>\nOHSU Aerial Tram 3 blocks lower campus<br>\n<br>\n$750 for three months or more stay<br>\n$800 for under three months.<br>\n$600 fully refundable deposit <br>\n<br>\nReferences from Airbnb listing can be provided<br>\n<br>\nKey words: PSU, PCC, Oregon Health Science University, Reed College, Lewis and Clark, Downtown Portland, close in downtown, South downtown, City Center, Medical center, Hospital. <br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00V0V_j3ywt24A1Hl_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831088262.html"
    },
    {
        "title": "#501 Roommate needed Stunning 4BR/2BA Residence with Corian Counters!",
        "href": "/mlt/roo/4831011673.html",
        "time": "2015-01-03 14:57",
        "price": "$700",
        "neighborhood": " (Portland, OR)",
        "postBody": "\n        <h2><b><u>Mw8 </u></b></h2><h2> CALL US TODAY! \n <a href=\"/fb/pdx/roo/4831011673\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nx228 </h2><p><b>Want more information?</b> http://unit-availability.com/lead/501351190510/1?extnId=3792461<br></p><h2><b> 4 &#xA0;bedroom 2 bath 909sqft  $2,710 - $2,825/mo </b></h2><br> Welcome to MW8 Apartments. <br> If you are looking for a stunning four-bedroom, two-bathroom residence, check out this unique floor plan at MW8. The residence has a private entrance with key fob entry. Residents love the open living and dining room as well as the separate kitchen area! This deluxe kitchen boasts spacious cabinets as well as Corian countertops. The stainless steel appliance package includes everything from a dishwasher and stove to a refrigerator. The in-home laundry room is also outfitted with a full-size washer and dryer for your convenience! This beautiful home boasts four expansive bedrooms with large closets and two sparkling bathrooms. MW8 is LEED certified and has green roof technology and offers on-site bicycle storage. Residents have additional conveniences such as a restaurant on the first floor and professional and friendly on-site staff! Learn more about leasing a room at MW8 today! <br><p><b><u> FLOORPLAN/UNIT AMENITIES: </u></b></p> * Dishwasher <br> * Private Decks <br> * Key Fob Entry <br> * Washer/Dryer in Unit <br> * In-Unit Washer/Dryer <br> * Microwave <br> * Corian Countertops <br> * Disposal <br> * Refrigerator <br> * Individual Climate Control <br> * Stainless Steel Appliances <br> * City Views <br><p><b><u> PROPERTY AMENITIES: </u></b></p> * Secured Bike Storage <br> * Night Patrol <br> * ValetWaste <br> * Near Public Transit <br> * Close To Portland Street Car <br> * One Block From Portland State University <br> * Ground Floor Restaurant <br> * Easy Freeway Access <br> * Green Roof Technology <br> * Close To Max Light Rail <br> * On-site Management <br> * On-site Maintenance <br> * Package Receiving <br> * Minutes From OHSU <br> * Rain Water Wall In Lobby <br> * Applying For Leed Gold Certification <br> * Elevator <br> * Controlled Access <br><br><p><b><u>MANAGED BY:</u></b><br><br>Greystar</p><p><b>PROPERTY WEBSITE: </b><br><br>http://www.mw8apartments.com/</p><p><b>CALL US TODAY!</b> \n <a href=\"/fb/pdx/roo/4831011673\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nx228 </p><p> 434 Sw College St <br> Portland, or 97201 <br></p><p>Equal Housing Opportunity</p>\n    ",
        "image": "http://images.craigslist.org/00Y0Y_4IXgbbFOBDP_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831011673.html"
    },
    {
        "title": "Short-term stays",
        "href": "/mlt/roo/4827349863.html",
        "time": "2015-01-03 14:46",
        "price": "$35",
        "neighborhood": " (Portland)",
        "postBody": "\n        Looking for short term stays (1-3 days)? I am open to having a roommate.  20 minutes from downtown in a quite residential neighborhood.   You will share a room with me.<br>\n<br>\nPlease be clean and be respectful.<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4827349863.html"
    },
    {
        "title": "hey there, I&apos;m glad your chill and respectful too !",
        "href": "/mlt/roo/4831072183.html",
        "time": "2015-01-03 14:43",
        "price": "$600",
        "neighborhood": " (montavilla)",
        "postBody": "\n        Hi there, I have a nice big room available the 1st of February ...there is one other roomate and we are both respectful of each other and looking for the same...hence the available on february first ! This is Not a party house!!! We do have a good beer and 420 ok ! Have two awesome dogs ...so sorry no pets ! 600 month to month first and last that covers utilities !\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831072183.html"
    },
    {
        "title": "Attic room + extra nook/office room",
        "href": "/mlt/roo/4821353954.html",
        "time": "2015-01-03 14:42",
        "price": "$800",
        "neighborhood": " (Inner SE)",
        "postBody": "\n        Entire upper level of inner SE house for rent. There&apos;s a bedroom with a built in closet, and a hallway that leads to your own extra large walk in closet (with a window) or student/office area if you&apos;d prefer. <br>\n<br>\nShared bathroom. There&apos;s lots of shelf space and we keep it tidy :)<br>\n<br>\nShared kitchen. Basically we have all the pots and pans and dishes etc that can be accommodated (all for shared use of course) but there&apos;s shelf and fridge space for your food stuff.<br>\n<br>\nShared washer and dryer in the basement. <br>\n<br>\nThere are also large planter boxes in the backyard, and if you&apos;re so inclined you&apos;re welcome to take over one and grow veggies and whatnot :)<br>\n<br>\nYour housemates:<br>\nRachel, Katherine and Amy (that&apos;s me!) - we&apos;re all graduate students at Portland State University. We work hard and like to have a chill study environment during the week, but like to go out dancing  or hiking or just kick back on the weekends. We&apos;d like to keep the respectful, laid back, community atmosphere here.<br>\n<br>\nI have an overly friendly cat and a small friendly (licky) dog. Sorry, no more pets.<br>\n<br>\nThe perks:<br>\nThe house is super cute, with big back and front yards. It&apos;s right off of Powell (all the convenience with none of the traffic). The 9 bus goes directly from the bottom of our street to downtown/the PSU campus in 11 minutes. You&apos;ll have your own level so you can be as social or reclusive as you want.<br>\n<br>\nThe catch:<br>\nThere&apos;s a narrow spiral staircase to get to the upper level. A queen mattress can go up the stairs with a little effort, but not any large preassembled furniture.<br>\n<br>\nMove in is 1 month&apos;s rent +  800 deposit (deposit payment plan can be worked out if necessary). You&apos;ll pay 25% of the utilities. We have high speed internet but no cable TV.\n    ",
        "image": "http://images.craigslist.org/00r0r_9NyczqLAQmD_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4821353954.html"
    },
    {
        "title": "space available in SE",
        "href": "/mlt/roo/4831070075.html",
        "time": "2015-01-03 14:42",
        "price": "$375",
        "neighborhood": " (8235 SE Morrison)",
        "postBody": "\n        Musical household of 4, seeking a new roommate to fill a vacant upstairs bedroom.<br>\nGreat neighborhood, close to public transport.  Please email with your phone number if you are interested.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831070075.html"
    },
    {
        "title": "2 Rooms in Shared House with Queers -- $450/$250 + utils",
        "href": "/mlt/roo/4831037064.html",
        "time": "2015-01-03 14:37",
        "price": "$450",
        "neighborhood": " (NE Portland)",
        "postBody": "\n        [This ad is for two spaces, an inside room for $450+utilities and an outside modified shed for $250+utilities with full use of common spaces in house.  Move in date by Feb 1, earlier possible]<br>\n<br>\nOur desire is to live w/qUeer positive, proactive, creative and communally aware beings. <br>\n<br>\nThe house is spacious and welcoming; common spaces have some room for your input (no tvs in common spaces except basement).  Enormous yard.<br>\n<br>\nWe hope to keep basement space for our occasional guests, however, no extra live-ins: know what i mean jelly bean!  Gas stove, gas heat, wood floors.  The house/yard/patio/firepit are conducive to sporadic parties...<br>\n<br>\nRoommate X&apos;s 13 year old wizard dog lives here and roommate B&apos;s 7 year old dog too.  Roommate B allergic to cats . . . but other creepy crawly critters can come ...<br>\n<br>\n420 friendly, but heavy drinkers, hard drug users, whiners, bullies and such: not considered<br>\n<br>\nplz bring good luck charms and sensible shoes.<br>\n<br>\nInside Room:  11x12, North facing, windows on two walls.<br>\nOutside shed: 10x10, with loft<br>\n<br>\nPerson X: i am a way left of center eccentric queer introvert w a kinky bend who grooves on celluloid. cookin, canning, dehydrating and matters of simple living, breathe life into me. <br>\ni am a minimalist consumer who thinks the Bins are a treasure trove!<br>\nPainting ~drawing~swinginging~dancing~conversing~gardening~ <br>\ncamping and all matters of creativity and tomfoolery spin my world!<br>\ni am a scent sensitive being into alternative ways of living. i am a pseudo omnivore who respects your choice~ i am aware of space ad energy and need the same ... <br>\n<br>\nmy goal for the household is to be a work in progress, celebrating victories and practicing tolerance. . .<br>\n<br>\nPerson B: <br>\n40-something, queer, overeducated former professor who is now trying hand at being a writer.  I have lived all over the US, and some abroad.  Political and intellectual lefty, dark humor, dog person, work from home.  I cook a lot, read, trying to learn more about all Portland has to offer.  I tend to get along well with people late 20s to 60, in the sense of energy, responsibility and sociability.  Things I like in random order:  Hindi, bowling, Strangers with Candy, going to river beaches with dog(s), cooking thai and Indian food (like to share food when possible), KZME . . .  slight shame: fondness for science fiction and horror genres in film and books, though also into all those indie and art house films, and given research and education, read a ridiculous amount of nonfiction.  In a house I hope and strive for good communication, mutual respect and hopefully some good times and conversation.  <br>\n<br>\nThe House and Room stats:<br>\nFirst Floor Room room w/ closet:  11x12 Feet, closet, windows on two walls<br>\naccess to large basement room (carpeted) <br>\nenuf storage space to keep yer clutter yer clutter<br>\ndishwasher, washing machine, dryer, and gas stove<br>\nan extraordinary large back yard- great for bbqs and such!<br>\n<br>\na chore list is in place and in flux to avoid bitterness... To curb resentments: please pack a tool chest to assist in a plethora of ways to resolve &apos;ism&apos;/phobic issues and conflict.<br>\nGARDENING opportunities!   An exuberance for gardening may move you to the top of the list.  Yard also has much room for outdoor projects of various kinds if you are so inclined. <br>\n<br>\nfire pit ~ partially covered back porch~ a garage for your bike<br>\nbus lines 17 ,75 and close by the 70 and 8 quick access to I-5 and the airport! <br>\nnearby= alberta street, kennedy school, new seasons, a couple of parks, etc and as a bonus = great neighbors!<br>\nthe logistics=<br>\nrent = $450<br>\nall split utilities total between $50 and $125<br>\nand to avoid leaving roomies in a lurch...a deposit to match your rent also <br>\nFirst Month, Last Month and Utility deposit.<br>\n<br>\n<br>\nplz respond to this ad w/ QUEERLY HAPPY in the TITLE<br>\n<br>\nfollow w a little current biographical synopsis, and if you can muster= a touch of luster!<br>\nquestions encouraged~ leave contact info~ GOOD LUCK!<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831037064.html"
    },
    {
        "title": "HAWTHORNE DISTRICT- close to shops, buses, Mt. Tabor, food carts",
        "href": "/mlt/roo/4831030561.html",
        "time": "2015-01-03 14:16",
        "price": "$600",
        "neighborhood": null,
        "postBody": "\n        Currently we are 1M and 3F. One 1F is moving out shortly. We are looking for a new housemate who are down to earth, drama free and know how to clean up after themselves.  Average age of current housemates is 28. We all kind of do our own thing, though we do enjoy cooking meals together once in a while, going out to eat, the occasional movie night or Sunday morning coffee and doughnut making parties on the front porch with the DONU-MATIC. <br>\n<br>\n Beautifully restored 5 bedroom, 2.5 bath Craftsman Bungalow in Hawthorne District. The house has 2 stories plus big basement (one bedroom and full bath is in the basement, 2 bedrooms on first, and one on the second floor) Music and/or crafty space and some storage space also in basement. If you are a student/grad student and need a mellow quiet house to study in this would be ideal.<br>\nThis is NOT a party house, but friends over for dinner/drinks is always a nice idea.  You must be FINANCIALLY SECURE and RESPONSIBLE and ABLE TO CLEAN UP AFTER YOURSELF.<br>\n<br>\nBig front porch, fire place, hardwood floors throughout, gas stove in kitchen, small back porch, yard with room to garden, washer/dryer, garage. Walking distance to Hawthorne shops. Mt Tabor, Fred Meyers, and New Seasons are a short walk or bike ride away. We are near many bus lines. Por Que No and food carts just up the street.<br>\n<br>\nThe rent on the room is $700...INCLUDING  all utilities and wireless internet. ($600 base rent)<br>\n <br>\nSorry but NO PETS.<br>\nAlso NO SMOKERS, NO COUPLES, NO DRUGS. <br>\nAvailable now/soon<br>\n<br>\nMonth to Month<br>\nWe look forward to hearing from you...feel free to send us your a note to tell us a little about yourself, a FB link a poem or whatever you like...and please remember to leave us your number and we will call you right back! We look forward to meeting you!!<br>\n<br>\nThanks!<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00t0t_avjGzulPSs0_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831030561.html"
    },
    {
        "title": "Large Room and Private Bath in the Country - Utilities, etc. Included",
        "href": "/mlt/roo/4819372426.html",
        "time": "2015-01-03 14:10",
        "price": "$600",
        "neighborhood": " (Rural Scappoose)",
        "postBody": "\n        Large room for rent in country home,  about 6 miles northwest of Scappoose on 5 partially wooded acres along the North Fork of Scappoose Creek.  Rent is $600/month, and includes electric, water, and garbage, with in-room separate telephone number (party line), DSL internet service, and satellite TV.  I commute to work in NE Portland, and it takes about 45 minutes each way in most weather - it&apos;s also about 45 minutes to Beaverton, Hillsboro, Longview, Vancouver, etc.<br>\n<br>\nCarpeted 11&apos; x 23&apos; room is downstairs, (daylight basement) and separate from my living area, in a modest ranch-style country home.  Private bath upstairs.  One parking space included in garage, along with a small area of basement storage.  Shared kitchen area. Fenced yard, and pets are negotiable. <br>\n<br>\nRental is month-to-month, but I am hoping to rent long-termish to someone responsible, reliable, and trustworthy who enjoys the country environment.  I like my privacy and general solitude, and offer the same to you.  (I&apos;m not at all anti-social, just the solitary sort.)  If you have an interest in country living, I&apos;d be glad to talk with you about your living needs and plans. <br>\n<br>\nThank you.<br>\nIrene\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4819372426.html"
    },
    {
        "title": "SMALL ROOM IN KENTON",
        "href": "/mlt/roo/4831014364.html",
        "time": "2015-01-03 14:05",
        "price": "$450",
        "neighborhood": " (Kenton)",
        "postBody": "\n        I have a small room for rent in Kenton. The house is close to MAX, the bus and a Library.  The house has a shared bathroom, washer and dryer and a shared kitchen.  The room is about 12x12.  I have a dog who will be living with us, so no additional pets please.  <br>\n<br>\nRent is 450 a month plus half of the utilities, which range from 100-150 per month.<br>\n<br>\nPlease contact me with any questions.<br>\n<br>\nThanks.<br>\nMatt\n    ",
        "image": "http://images.craigslist.org/00S0S_lddMhMvZZxT_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831014364.html"
    },
    {
        "title": "Affordable, Yoga, Community, Gardening",
        "href": "/mlt/roo/4830994994.html",
        "time": "2015-01-03 14:04",
        "price": "$486",
        "neighborhood": " (Alberta Arts Distr.)",
        "postBody": "\n        The Vision &amp; Sustainability Community seeks a housemate who wants to live your vision of sustainability, wellness, community, &amp; fun.<br>\n<br>\nBeautiful, affordable, sustainable housing &amp; community in the heart of Alberta.<br>\n<br>\n* Available Feb. 1.<br>\n<br>\n* Low utilities &amp; High Energy Efficiency (Fully insulated house, solar power produces up to 25% of electricity, efficient gas furnace, energy efficient lighting)<br>\n* ENERGY-EFFICIENT appliances (washer, dryer, 2 refrigerators, dishwasher);<br>\n* cool INTERGENERATIONAL housemates committed to supporting one another&apos;s visions<br>\n* large locked BIKE SHED, plus garden shed<br>\n* CHEAP YOGA, meditation, &amp; wellness classes on-site<br>\n* Large STUDIO space w/ hardwood floor<br>\n* Gas stove &amp; great kitchen<br>\n* Large GARDEN<br>\n* 1100 gallon Rainwater Cistern &amp; gravity-fed drip irrigation for garden<br>\n* OFF-STREET PARKING (limited to one additional vehicle)<br>\n* Attic Storage Space<br>\n* HI-SPEED INTERNET connections in every room &amp; wireless internet throughout,<br>\n* opportunity to buy-in to the co-op (BECOME an OWNER) after 6 months<br>\n<br>\n* $486/month for Medium sized Bedroom with South Window<br>\n<br>\nWe&apos;re a cooperatively-owned house that encourages residents to become co-owners if they vibe with the house for 6 months.<br>\nMainly looking for someone who already has or is genuinely interested in a daily spiritual practice.<br>\nIt&apos;s a big plus if you also love gardening, vegetarian cooking, yoga, music, meditation &amp;/or being the change you want.<br>\nYou don&apos;t have to be a vegetarian to live in the house, although shared meals are vegetarian (you can cook &amp; add meat).<br>\nNo pets, smoking, or illegal drugs in house.<br>\n<br>\nCALL:  Bart at \n <a href=\"/fb/pdx/roo/4830994994\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n ext. 2<br>\nPlease call rather than e-mail for fastest response.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830994994.html"
    },
    {
        "title": "COOL space open in NE home",
        "href": "/mlt/roo/4830993073.html",
        "time": "2015-01-03 14:02",
        "price": "$450",
        "neighborhood": " (cully area)",
        "postBody": "\n        <br>\n....we have an open room in a very unique set-up that&apos;s a loft type with an entire room attached... very hard to explain but really quite a nice private spot..... If your traveling thru Portland for any length of time, or need a month to month situation  even long term works......<br>\n<br>\n.....house is in NE pdx and has many extras that we can go into if this sounds like someplace you may want to hear more about. Must enjoy dogs and willing to help out with household chores , Make this a place that you call home and not use it as if it were a hotel......   <br>\n<br>\n.....be honest, respectful and easy going is what will make you a good fit here.... looking for another guy to share the house with because its easier since we are 3 men now.....home has a work space , if you feel creative and extra storage if needed..... Bi or gay male preferred for comfort level .....no couples or other pets......\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830993073.html"
    },
    {
        "title": "Perfer Female. 1 rm for 600.00",
        "href": "/mlt/roo/4830973041.html",
        "time": "2015-01-03 13:58",
        "price": "$600",
        "neighborhood": " (THOMPSON/LAIDLAW)",
        "postBody": "\n        FURNISHED 900 SQ FT COTTAGE IN GREAT NEIGHBOR HOOD. 2 BEDROOM, LOFT AND 1 BATH. WOOD STOVE, HARDWOOD FLOORS UPSTAIRS,CARPET IN DAY LIGHT BASEMENT, FENCED YARD. TV/INTERNET READY. UTILITIES NOT INCLUDED.   <br>\n<br>\n<br>\nNOW AVAILABLE NOW!<br>\n<br>\nPLEASE TEXT<br>\n<br>\n<br>\n<br>\nFIRST AND LAST MONTH&apos;S REQUIRED!!!<br>\nREFERENCE &amp; BACKGROUND CHECK<br>\nPLEASE SHOW PROOF OF INCOME<br>\nNO DRUGS!! SMOKING OR THIEVES! !!!!<br>\n<br>\nPRIVATE PARKING<br>\n<br>\nTHIS IS OUR HOME FOR EAT, SLEEP AND YOUR PERSONAL DOWN TIME. NOT COMMENDED FOR YOUR FRIENDS ENTERTAINMENT. <br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00Z0Z_6a1VfovgSOY_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830973041.html"
    },
    {
        "title": "Room for rent -Hawthorne (hip and safe)",
        "href": "/mlt/roo/4831002606.html",
        "time": "2015-01-03 13:57",
        "price": "$550",
        "neighborhood": " (37th and Hawthorne)",
        "postBody": "\n        Hello all! 3 housemates (2 girls-1 Guy) are looking for a 20-something young professional who enjoys the occasional house party, 420, and pets.  The house has three floors, two bathrooms, four rooms, and a nice backyard.  We also currently have a dog.  We all work 9-5 jobs and are very friendly and enjoy hanging out with one another.  The rent would be $550 a month plus utilities. We are hoping to find someone to move in next month (Feb.)!  If you are interested please email us with some information about yourself (your likes, dislikes, job, hopes, dreams etc.) and if we mesh we&apos;ll email you back.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4831002606.html"
    },
    {
        "title": "Roommate Wanted: Close in NE",
        "href": "/mlt/roo/4830996919.html",
        "time": "2015-01-03 13:53",
        "price": "$550",
        "neighborhood": " (Alberta Arts District)",
        "postBody": "\n        Hello, <br>\n<br>\nI&apos;m in search of a person to share my colorful and quirky two bedroom, two bathroom apartment.  Ideally located in the heart of the Alberta Arts District.  An abundance of restaurants, bars, coffee shops, parks, food carts, public transit and bike shops are within comfortable walking distance.  This is a great neighborhood that has seen a good many changes in the last few years.<br>\n<br>\nThis duplex apartment features hard wood floors, new appliances, new windows, private washer and dryer, shared internet and some basement storage space.  We also have a large shared back yard with a fire pit, hammock and raised garden beds.<br>\n<br>\nThe room for rent is rather large with a walk in closet and big windows that offer great morning light.  Included is a recently remodeled, private, full bath, located off the living room.  <br>\n<br>\nRent is $550/month plus electricity and internet.  No lease required but landlord references and last months rent will be considered.  <br>\n<br>\nThere is one lovable, 6 year old boy cat who currently lives here, we would be accepting of another.  <br>\n<br>\nIf this sounds interesting to you or you have questions please contact me.  <br>\n<br>\nThank you!\n    ",
        "image": "http://images.craigslist.org/01313_ewl4khNRkI_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830996919.html"
    },
    {
        "title": "Nice! Month to Month. Large/Private/Furnished Room near Downtown/OHSU.",
        "href": "/mlt/roo/4819407404.html",
        "time": "2015-01-03 13:49",
        "price": "$750",
        "neighborhood": " (Portland Hills / OHSU / 5-min drive to Downtown)",
        "postBody": "\n        Available ... clean, month to month furnished room 14x20<br>\nLocated on Upper level within a large home.<br>\nNo separate entrance.<br>\nRoom is furnished with queen bed as seen in pic. <br>\nGreat for: med students due to close proximisty to OHSU; mature professionals <br>\nwho are in transitions or new to the city.<br>\n<br>\nRENT 750 + UTILITIES 175 per month<br>\nStudent Discount.<br>\nMonth to Month...possibility of shorter terms. Just Ask! <br>\nHigh Speed Internet<br>\nShared use of newer Washer &amp; Dryer <br>\n<br>\nNo actual Closet in the room. <br>\nInstead, a large metal clothing rack is used for hanging clothes w/4 shelves. <br>\nShare Full Bath w/1 adult on main level.<br>\nShare common space...kitchen, dining, loft, 1/2 bath with 2 mature females. <br>\nBedding/Linens...Supplied and Laundered for you as well.<br>\nOff-Street Parking is available for one car.<br>\nThis location is within walking distance of OHSU&apos;s Main Campus. <br>\n<br>\nLOCATION<br>\nSafe SW neighborhood 1.4 miles above OHSU,<br>\nA 5-minute Drive Downtown &amp; to NW Portland. <br>\nNearest BUS... is 1/2 mile away or an approx 15-minute walk. <br>\nOHSU is 1.4 miles away..(a 20-minute walk each direction).<br>\nNear walking/running trails.<br>\nOff street (driveway parking) is available.  <br>\nWeekly rides for grocery shopping are offered for students residing here &quot;without&quot; transportation.<br>\nNOT near MAX<br>\n<br>\nHOME: very clean, non-smoking, no drugs, no pets. <br>\nHOUSEHOLD &amp; YOU: professional or serious full-time student, <br>\nfinancially stable, mature, clean-up after yourself in common areas, respectful, <br>\ngood communicator.<br>\n<br>\nClearly NOT intended for use as a work from home space.<br>\n<br>\nInterested replies please include your name, email and contact #<br>\nHappy hunting!<br>\n<br>\nmonthly - short term - temporary stay - long term - private - igh speed internet - wifi - <br>\nshare full bath - off-street parking - garage parking - quiet - comfortable - furnished - <br>\nqueen bed - no pets - no smoking - no drugs - no 420 (no pot) - use of washer &amp; dryer - <br>\nuse of laundry room / wash room - professional - mature - cleaning services - bath cleaning -<br>\nroom cleaning   <br>\n\n    ",
        "image": "http://images.craigslist.org/00P0P_5NvmrhgXmMH_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4819407404.html"
    },
    {
        "title": "Short terms rent for international students in tigard",
        "href": "/mlt/roo/4830943635.html",
        "time": "2015-01-03 13:37",
        "price": "$430",
        "neighborhood": null,
        "postBody": "\n        Greeting<br>\n I rent my spare apt room for person who seeks and wants to stay short terms 3 months.<br>\n Rent fee is pre-paid on time. No deposit requiered.<br>\n the Internet is Free provided.<br>\n Electricity is sharing 1/n<br>\n water is included.<br>\n<br>\n No kitchen applianace share.<br>\n I want very clean and responsible international students, but if you are   <br>\n not satisfied person that I mentioned, Please do NOT contact me or send spam!<br>\n<br>\n we are students from Korea and couple so I preper clean female.<br>\n<br>\n the house is located near PCC sylvania campus walk by 20 min.<br>\n<br>\n the room is fully furnished. you will need your own stuffs (No provide blanket). you can use kitchen <br>\n to cook, but after use it, make sure CLEAN! it is very Important and core of my home.<br>\n you will use and share full bathroom.<br>\n If you want to stay here, reserve for it.<br>\nthe room will be avail on March 1st.<br>\n \n <a href=\"/fb/pdx/roo/4830943635\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n Thanks\n    ",
        "image": "http://images.craigslist.org/00u0u_82GSlix1lSS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830943635.html"
    },
    {
        "title": "450$ Room close to MAX line, and right off highway 205",
        "href": "/mlt/roo/4821697358.html",
        "time": "2015-01-03 13:32",
        "price": "$450",
        "neighborhood": " (102nd between Holgate &amp; foster)",
        "postBody": "\n        2200 square feet house with 3 bedrooms, one of which is available. <br>\nRoom measurements are14 by 14 feet.<br>\nOwn entrance.<br>\n1/2 acre yard with 8 chickens 2 ducks (providing organic eggs).<br>\nFull organic garden.<br>\nFire pit outside.<br>\nclose to MAX line and right off highway 205 (Powell or Foster exit).<br>\nWasher and dryer.<br>\nCats or dogs are open for discussion. (Negotiable)<br>\nFriendly environment, decent neighbors.   Call or text either Matt \n <a href=\"/fb/pdx/roo/4821697358\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nor mike \n <a href=\"/fb/pdx/roo/4821697358\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "image": "http://images.craigslist.org/01414_73zQoYFu2EM_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4821697358.html"
    },
    {
        "title": "off campus student housing Available, MOVE IN NOW!!!",
        "href": "/mlt/roo/4826746799.html",
        "time": "2015-01-03 13:30",
        "price": "$575",
        "neighborhood": " (174th&amp; Powell)",
        "postBody": "\n        Available room for immediate move in !!! Single Occupancy within apartment unit is 800.00, Double Occupancy is $ 575.00 All Utilities and Basic furnishings are included in rental rate. Close to public transportation and local eateries and shops. Call today for immediate move in! Upstairs unit. Feel Free to call Local <br>\n <a href=\"/fb/pdx/roo/4826746799\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor Toll Free <br>\n <a href=\"/fb/pdx/roo/4826746799\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "image": "http://images.craigslist.org/01212_9l47HKlrbHe_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826746799.html"
    },
    {
        "title": "Female Room Available, MOVE IN NOW!!!",
        "href": "/mlt/roo/4826756428.html",
        "time": "2015-01-03 13:30",
        "price": "$575",
        "neighborhood": " (beaverton)",
        "postBody": "\n        Girl Roommate/s Occupancy IMMEDIATELY!!! Double Occupancy is $ 575.00 All Utilities and Basic furnishings are included in rental rate. Close to public transportation and local eateries and shops. Call today for immediate move in! Upstairs unit. Feel Free to call Local <br>\n <a href=\"/fb/pdx/roo/4826756428\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor Toll Free <br>\n <a href=\"/fb/pdx/roo/4826756428\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "image": "http://images.craigslist.org/01313_7YNNekE6eYp_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826756428.html"
    },
    {
        "title": "Female Room Available, MOVE IN NOW!!!",
        "href": "/mlt/roo/4826728998.html",
        "time": "2015-01-03 13:29",
        "price": "$575",
        "neighborhood": " (beaverton)",
        "postBody": "\n        Girl Roommate/s Occupancy IMMEDIATELY!!! Double Occupancy is $ 575.00 All Utilities and Basic furnishings are included in rental rate. Close to public transportation and local eateries and shops. Call today for immediate move in! Upstairs unit. Feel Free to call Local <br>\n <a href=\"/fb/pdx/roo/4826728998\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor Toll Free <br>\n <a href=\"/fb/pdx/roo/4826728998\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826728998.html"
    },
    {
        "title": "Female Room Available, MOVE IN NOW!!!",
        "href": "/mlt/roo/4826731429.html",
        "time": "2015-01-03 13:28",
        "price": "$575",
        "neighborhood": " (beaverton)",
        "postBody": "\n        Girl Roommate/s Occupancy IMMEDIATELY!!! Double Occupancy is $ 575.00 All Utilities and Basic furnishings are included in rental rate. Close to public transportation and local eateries and shops. Call today for immediate move in! Upstairs unit. Feel Free to call Local <br>\n <a href=\"/fb/pdx/roo/4826731429\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor Toll Free <br>\n <a href=\"/fb/pdx/roo/4826731429\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "image": "http://images.craigslist.org/01313_7YNNekE6eYp_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826731429.html"
    },
    {
        "title": "Temporary room on Division ($450)",
        "href": "/mlt/roo/4830926774.html",
        "time": "2015-01-03 13:10",
        "price": "$450",
        "neighborhood": " (Division and 39th)",
        "postBody": "\n        My roommates and I are seeking a fourth to join our home in SE PDX for the month of January.<br>\n<br>\nAbout the house/room: <br>\nA two-story, four bedroom house near SE 39th and Division. There is one bathroom, a basement with washer and dryer, and backyard. The first floor living room has a fireplace. Fully furnished, except the bedroom. Bedroom has panoramic windows, half carpeted, half hardwood floors, and walk-in closet. Plenty of street parking. Very close to several food carts and bus stations. The rent is $450 (all utilities included) with a $400 deposit. The deposit will be returned February 1st upon inspection of any damages. <br>\n<br>\nAbout us: <br>\nWe are friendly folk in our mid 20s that love art, music, and social gatherings. A couple of us lead professional lives and work the 8-5 M-F shifts. The other is an artist that works at various hours. We share in conversation, as well as housework. <br>\n<br>\nAbout you: <br>\nIdeally, you are social and willing to interact with the other roommates. You are respectful of everyone&apos;s schedules and space, as we will be of yours.<br>\n<br>\nIf interested, send us an email or text/call with a little more about yourself. Happy hunting!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830926774.html"
    },
    {
        "title": "roommate wanted in SW!",
        "href": "/mlt/roo/4830900627.html",
        "time": "2015-01-03 13:06",
        "price": "$395",
        "neighborhood": " (Hillsdale)",
        "postBody": "\n        hi! My name&apos;s katie, I&apos;m looking for someone to fill the other room in my two bedroom apartment in Hillsdale when my roommate moves to eugene at the end of the month. <br>\n<br>\nI&apos;ll post pictures when I get back into town Tuesday. <br>\n<br>\nI&apos;m 23 and a geography/gis student at portland state. i do a lot of outdoorsy stuff (hiking, backpacking, etc) and i love to cook/bake. I&apos;m super laid back and mostly keep things pretty clean. My cat sprout lives here too (I&apos;d rather not have any other furry pets) and unless you&apos;re allergic I can nearly promise you&apos;ll love him. I&apos;m quiet for the most part other than occasionally playing music through the TV while I&apos;m cooking or whatever. If something i do bothers you and you point it out to me I won&apos;t be offended! I never really have parties because the apartment isn&apos;t that big but I like having friends over sometimes for movies/food/420/etc and I&apos;ll do my best to give you some notice before they show up.  I&apos;m totally open minded and accepting and I&apos;m looking for someone who is also. <br>\n<br>\nThe room isn&apos;t huge but it&apos;s a decent size. it&apos;s big enough to fit a queen sized bed with room to walk around and I&apos;ll try to get the square footage when I post the pictures. there&apos;s a nice closet and a ceiling fan and it has a southwest facing window with plenty of daylight. it&apos;s on the second floor and the neighbors generally aren&apos;t very loud but the road can be a little noisy in the summer when the windows are open. it&apos;s right around the corner from the burlingame Freddy&apos;s and the 12 and 94 bus lines. the 1 to downtown stops right in front of the building on weekdays too. utilities range from ~$120 in the winter to ~$70 in the warmest months, total. The lease is month to month but I&apos;m hopefully looking to find someone to stay for a while. <br>\n<br>\nMy biggest hope is that we get along! I love having a roommate who I can hang with when we&apos;re both home or share meals with every once in a while. i dont want to live wih someone who i have to tolerate, or has to tolerate me. there&apos;s no room for any more living room furniture (unless your couch is nicer than mine, haha) but the shared spaces are really shared and I&apos;m more than cool with you throwing your style in. I love decorating but I never really put effort into it so the walls could actually use some stuff on them. I&apos;m open to living with a girl or guy but no couples or children please, sorry! <br>\n<br>\nshoot me an email with questions or to tell me a little about yourself! I&apos;ll start meeting people this week.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830900627.html"
    },
    {
        "title": "ROOM FOR RENT",
        "href": "/mlt/roo/4830842469.html",
        "time": "2015-01-03 12:53",
        "price": "$400",
        "neighborhood": " (Portland)",
        "postBody": "\n        12&apos; X 15&apos; room furnished<br>\n<br>\nwith bed (6 drawers underneath)<br>\n<br>\nnightstands, table &amp; chair.<br>\n<br>\nFull size microwave &amp; fridge in room.<br>\n<br>\nShared laundry and Kitchen.<br>\n<br>\nQuiet house, no drama, no parties,<br>\n<br>\nno smoking, no drugs, no pets. <br>\n<br>\n$400 month + shared utilities.<br>\n<br>\n+ security deposit<br>\n<br>\nrequired upon move-in.<br>\n<br>\nAverage age of current tenants 45-70 yrs old.<br>\n<br>\nOn bus line, located one block from Halsey &amp; 162nd.<br>\n<br>\nIf interested, give me a call at<br>\n<br>\n\n <a href=\"/fb/pdx/roo/4830842469\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n NO TEXT NO E-MAIL please<br>\n<br>\nThanks Lloyd<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830842469.html"
    },
    {
        "title": "Room open now, close-in SE",
        "href": "/mlt/roo/4830896333.html",
        "time": "2015-01-03 12:52",
        "price": "$580",
        "neighborhood": " (SE Division)",
        "postBody": "\n        Close to food carts, bus lines, fancy restaurants &amp; dive bars, and all that is SE Division&apos;s new culture, is a room open in a house that hearkens back to pre-popular shabby geek SE Portland.  <br>\n<br>\nSunny bedroom in shared house (will be 4 housemates). Fixer upper with art, eclectic  and cluttered decor and one shared bathroom for all. Owner is one of the housemates. <br>\n<br>\nPrefer someone with a full life who is comfortable with bohemian homey chaos (not too hung up on cleanliness) and has a general air of bonhomie. There is a cat and a large puppy and cigarettes are smoked on the porch so sometimes the smell goes inside a bit. We is what we is. <br>\n<br>\nRent is $580 a month, and that includes all utilities and internet. <br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830896333.html"
    },
    {
        "title": "22nd/Hawthorne/Division private bedroom in Spacious Clean Home",
        "href": "/mlt/roo/4822805568.html",
        "time": "2015-01-03 12:48",
        "price": "$715",
        "neighborhood": " (Colonial Heights/ Ladd&apos;s Edition Area)",
        "postBody": "\n        Available for move in December 27th, 2014. <br>\n<br>\nThe available room is big enough to be a studio apartment.  It becomes available for move-in this December 27th 2014.  I will run this add until I fill the room, so if you&apos;re reading this then the room IS available.  This house is an elegant 1927 structure, the people who live here are wonderful and you couldn&apos;t ask for a better location.  This available room is the best in the house it&apos;s getting the hardwood floors refinished, new light fixture and new paint before the next move-in, so you will be moving into an incredibly pristine space. The bathroom with one other person  <br>\n<br>\nThe current renters: All women in their 20&apos;s, who are professionals or in school. They are all active, friendly and respectful of people&apos;s privacy. No drama. The owner: is a Male, Professional, in his 30&apos;s who manages house operations, house cleaning, repairs and etc. He lives in a separate part of the house. <br>\n<br>\nThe home is fully furnished with a comfortable dining room table for dinner guests, a TV room with 52&quot; TV and surround sound for movies, and BBQ and outside patio for grilling and out door dining.   The room for rent is a large room with plenty of closet space and a faint view of downtown Portland. The room has hardwood floors and shares a bathroom with 1 other roommate. This room is ideal for someone who wants to live in a large, spacious home in a fantastic location on a reasonable budget. :) <br>\n<br>\nNo pets.<br>\n<br>\nNo Smoking.<br>\n<br>\nRequired 9 month lease.  Bills are around $90(summer) -$145(winter) per month.  Note: The bills are less in the summer.<br>\n<br>\nIf you are looking for a sanctuary to call home, and open communication/drama free shared housing situation, we&apos;d love to hear more about you. Please respond to this email with more about you, your work schedule, what you do for fun and what you are looking for in a living environment. The room is available Dec 27th and we do run a background check on all roommates for all of our mutual comfort and safety.  If you are interested you will be contacted by the home owner, Matthew<br>\n<br>\nThank you!!<br>\n<br>\nKEY WORDS TO DESCRIBE THE HOUSE: <br>\nHawthorne/Division home, 22 streets from the river, close to restaurants, shops, groceries, public transit, shopping, wi-fi enabled coffee houses, High Speed wi-fi House, 4000 sqft home, 6 bed 3 bath, clean, kind, outgoing and respectful housemates. \n    ",
        "image": "http://images.craigslist.org/00T0T_7GBA9r6RGqV_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4822805568.html"
    },
    {
        "title": "Three Bedroom Two Bath House.",
        "href": "/mlt/roo/4820753614.html",
        "time": "2015-01-03 12:45",
        "price": "$550",
        "neighborhood": " (NE PDX.)",
        "postBody": "\n        Looking for roommate(s) to share 1350 sq ft three bedroom two bath home with over sized double car garage and RV parking in quiet cult de sac on large private fenced lot with mid 30&apos;s male automotive professional and 16 week old American Bully puppy. Close to freeways and public transit. Washer and dryer, Central air, DirecTV, six person hot tub and Comcast high speed wireless. $550/month for one 14&apos; X 10&apos; bedroom with a 3&apos; X 5&apos; closet and utilities included. And $450/month for 11&apos; X 11&apos; bedroom with a 3&apos; X 5&apos; closet and utilities included. Prefer first and last months rent to move in but flexible. Also prefer no other pets. Both rooms available now. NO couples, room shares, ect. unless renting BOTH rooms. Not interested in renting out RV space.<br>\nIF THIS AD IS STILL UP ROOMS ARE STILL AVAILABLE.\n    ",
        "image": "http://images.craigslist.org/00A0A_gVz0WiWPbRg_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4820753614.html"
    },
    {
        "title": "Available now! Huge bedroom in beautiful Belmont apartment",
        "href": "/mlt/roo/4830861617.html",
        "time": "2015-01-03 12:42",
        "price": "$780",
        "neighborhood": " (Inner SE)",
        "postBody": "\n        Available now! One bedroom in a 2-bedroom, 1-bathroom apartment close in SE in the Buckman/Sunnyside area. <br>\n<br>\nAbout the apartment:<br>\nIt&apos;s a relatively recently updated building (last 3 years or so) with lots of great touches. Lots of fun features on the property: fire pit (free firewood!), barbecue, patio area outside the apartment. There&apos;s coin-op laundry and storage in the common area. <br>\n<br>\nThe apartment itself is really spacious and has a seriously upgraded kitchen with lots of storage. Electric stove/oven, fridge, microwave, garbage disposal in the sink. The kitchen and living room are pretty well stocked, so it would be ideal if you had minimal large furniture to move in, but there&apos;s plenty of space and we can figure that out later. There is a big glass sliding door that gives beautiful natural light in the apartment. The bathroom has a spacious tub and shower with good water pressure.<br>\n<br>\nThe open bedroom is a really good size, with plenty of room for a queen size bed and dressers, with a double lighted closet with fully customizable shelves and rods. It also has its own heating vent so you can control the temperature of your bedroom, and it has cable hookups in case you want a TV in there.<br>\n<br>\nOverall, it&apos;s a really beautiful apartment in a great location. There are tons of bars and restaurants within walking distance on Belmont and Stark, and it&apos;s just a short walk to either the Hawthorne Safeway or Whole Foods on Burnside.<br>\n<br>\nAbout me:<br>\nI work full time at a local nonprofit, and I currently live with my dog Polly, who is a loving, goofy little mutt who will gladly invite herself into your lap whenever possible. I love cooking vegan food, watching both quality and not-so-quality movies, and sampling all the tater tot-related dishes Portland has to offer. I enjoy having a glass of wine sometimes after work, but keep it pretty chill during the week. <br>\n<br>\nAbout you:<br>\nClean, considerate and respectful, and employed (can pay rent on time). It would be great if you were also vegan, or okay with keeping a vegan kitchen in the apartment--but let&apos;s talk about it! I&apos;d love to share the apartment with someone who is fun to hang out with, but also has their own friend group/stuff going on. <br>\n<br>\nInterested?<br>\nRent is $790/month (which we can pro-rate from when you move in)<br>\n$450 deposit (negotiable)<br>\nHalf of electricity and internet bills each month (other utilities are included. Electricity runs about $90 in the winter, for reference.)<br>\nSorry, no more pets. :(<br>\n<br>\nPlease respond to this post via email with some details about yourself (your job, hobbies, lifestyle, etc). Links to social media profiles are always nice!<br>\n<br>\nI look forward to hearing from you!\n    ",
        "image": "http://images.craigslist.org/00w0w_cJ4kF4xaZa5_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830861617.html"
    },
    {
        "title": "Furnished Room in great NE, quiet/clean-Concordia/ Kaplan/PELA approve",
        "href": "/mlt/roo/4830871216.html",
        "time": "2015-01-03 12:37",
        "price": "$475",
        "neighborhood": " (NE 21st &amp; Knott)",
        "postBody": "\n        Furnished Room in great NE 21st &amp; Knott area <br>\nCurrently have female ESL student and she&apos;s moving<br>\nHome is me and my daughter <br>\nHave been Approved by Concordia/PELA/Kaplan <br>\n\n <a href=\"/fb/pdx/roo/4830871216\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\nNear Lloyd Center, walk everywhere <br>\nMany bus lines close by <br>\nNo pets and no couples at all\n    ",
        "image": "http://images.craigslist.org/00505_dxMYU4RvrWJ_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830871216.html"
    },
    {
        "title": "NO DEPOSIT! Walk In Closet",
        "href": "/mlt/roo/4830792560.html",
        "time": "2015-01-03 12:17",
        "price": "$450",
        "neighborhood": " (NE Portland)",
        "postBody": "\n        If you like to save money, and want to help 2 roommates save money. This is a one bedroom apartment. Room would be JUST 4 U! <br>\nIf your cool with that shoot a message please say a little about yourself!<br>\nRoom for 1 person.<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830792560.html"
    },
    {
        "title": "Room in shared house - mostly vegetarian &amp; great location",
        "href": "/mlt/roo/4830810800.html",
        "time": "2015-01-03 12:03",
        "price": "$550",
        "neighborhood": " (inner SE Portland)",
        "postBody": "\n        Very good condition, spacious room in a wonderful shared house has 1 bedroom available January 1, possibly sooner if needed. <br>\n<br>\nGreat location - 4 blocks off Division St - near Clinton St, New Seasons grocery, various shops and restaurants, and parks.<br>\n<br>\nA bit about us:<br>\nWe are 2 easy-going 30something professionals, looking for someone who is into having a strong community within the house.  We don&apos;t need to hang out all the time but we do want to get along and have a comfortable social environment.<br>\n<br>\nWhat we&apos;re looking for:<br>\nSomeone who&apos;s: <br>\nmature and in their late 20s-early 40s.<br>\n6 month lease (or more) minimum as we want stability here.<br>\nfun and likes to hang out although having our own downtime is typical too<br>\nbut who wants to have a community rather than just always hang out by themselves<br>\nOK with a mostly vegetarian house - fish is ok if needed but no other meat.  <br>\nand finally, sorry- no smokers, no pets.<br>\n<br>\nThe apartment also includes:<br>\no brand new washer/dryer<br>\no energy efficient tankless water heater &amp; high efficiency furnace<br>\no fenced back yard <br>\no garden area <br>\n<br>\nCredit check required with rental application. <br>\n<br>\nPlease email me with any questions or if you&apos;d like to view the property. Please include times that work for you this weekend and your phone number. It would be great if you briefly told us about yourself too.<br>\n\n    ",
        "image": "http://images.craigslist.org/00v0v_6cpR5NutyYE_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830810800.html"
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4824516670.html",
        "time": "2015-01-03 11:51",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY.  <br>\n <a href=\"/fb/pdx/roo/4824516670\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824516670.html"
    },
    {
        "title": "BEAUTIFUL &amp; FRIENDLY HOUSE ROOMMATE WANTED",
        "href": "/mlt/roo/4824193238.html",
        "time": "2015-01-03 11:40",
        "price": "$500",
        "neighborhood": " (130TH DIVISION)",
        "postBody": "\n        Hello, I have an empty room in a quiet neighborhood in the SE area up for rent $500/ month utilities and internet included. <br>\n<br>\nOur us:<br>\n<br>\nWe are in early and mid 30&apos;s.  My uncle and I are laid back cool as a cucumber laid back people both have full time job. I work from 10-7PM and he works the night shift. We are responsible adult not into any kind of drugs (no thank you) and are looking for a like mind room mate, who clean after themselves. I&apos;m a spiritually fit and morally clean man who attends church every weekend.  And my uncle takes his son to Takewondo practice daily.  <br>\n<br>\nPlease text me to check things out.\n    ",
        "image": "http://images.craigslist.org/00G0G_fGNpA8if5fY_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824193238.html"
    },
    {
        "title": "guest room, furnished, incl. utilities/wi-fi",
        "href": "/mlt/roo/4830742068.html",
        "time": "2015-01-03 11:32",
        "price": "$550",
        "neighborhood": " (SW PDX/OHSU)",
        "postBody": "\n        Furnished guest room, month/month, $550.<br>\n<br>\nPrefer female (2 female housemates; 1 1/2 shared bathrooms).<br>\n<br>\nThis is a large private home in the West Hills, 10 minutes from OHSU/VA. Great public transportation from nearby bus stop: #44, 45,54, 55, 56, 65x. Fifteen minutes from downtown. Many amenities within walking distance: grocery store, farmer&apos;s market, restaurants, pubs, banks, post office, coffee shops, bakery, library, etc.<br>\n<br>\nStreet parking.<br>\n<br>\nPLEASE:<br>\n<br>\nNo smoking of anything inside or outside<br>\nNo drugs (incl. 420)<br>\nNo pets<br>\nNo overnight visitors<br>\n<br>\nKitchen access; cleaning services provided; clean sheets &amp; towels provided regularly.<br>\n<br>\nStorage space is NOT available. Please do not bring any of your own furniture.<br>\n<br>\nAll utilities &amp; wi-fi included.<br>\n<br>\nPlease provide your background information and a phone # in your response.<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830742068.html"
    },
    {
        "title": "Have references? Room in senior home all utilities, dish, wifi $500",
        "href": "/mlt/roo/4830735913.html",
        "time": "2015-01-03 11:28",
        "price": "$500",
        "neighborhood": " (st. helens)",
        "postBody": "\n        Have reference from current and one prior landlord?  Seeking quiet renter for large furnished or unfurnished room in senior home with private bath (guest bath in house).  All utilities including internet and dish tv included.  MUST BE NEAT AND CLEAN.  Must have proof of income.  No pets.  First and last.  Deposit waived with good local references.  No tobacco or MJ on premisis.  Full kitchen privileges.  Enjoy TV in the bright living room.  No extra storage.  1 running vehicle only.  Small yard and garden,\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830735913.html"
    },
    {
        "title": "Bedroom for rent in 3bdr/2 bath house",
        "href": "/mlt/roo/4830736652.html",
        "time": "2015-01-03 11:22",
        "price": "$500",
        "neighborhood": " (Multnomah Village)",
        "postBody": "\n        I live in a lovely 3 bedroom 2 bathroom house, my roommate moved out and I am stuck in a lease until the end of June. I found one roommate and am looking for another to help pay the rent until then. Currently my plan is to move out when my lease is up (at which point you and my other roommate could keep the place) but if we end up with a great dynamic then I may be interested in staying. The room is $500 per month and I ask for a deposit of $500. <br>\n<br>\nIt is a cool house in a super quiet neighborhood. Awesome back deck which has hosted many summer dinner parties and BBQs. I painted the place when I moved in so there is lots of color in here. Very close to Barbur blvd (#12 bus) and I-5 on ramps. The house is below street level in a stand of trees so it feels kind of woodsy. I have a big empty garage so there is plenty of storage space. I am super close to Lewis &amp; Clark College and a short bus ride to PSU. The pictures of the orange room is the bigger of the two bedrooms. The bookshelves can go or stay if you like them. The desk is leaving.<br>\n<br>\nI am a 31 year old female working on a graduate degree in marriage family therapy. I love to cook and would love to share some meals with my roommate(s). I eat meat and like to use cast iron. It is not uncommon to find a jar of bacon fat or homemade pickles on my counter. I like to drink and get a little silly on weekends but I know how to be responsible. I am super passionate about my work and find that hang-overs get in the way of doing it well. I read a lot of sci-fi, I crochet, and like to work crosswords. I don&apos;t have a tv but I watch movies and shows on my laptop from time to time. I love Doctor Who with all my heart. I keep my house tidy and my kitchen clean but I am not crazy about it. I have a cat. She goes outside so no gross liter box. We are not interested in more animals in the house. <br>\n<br>\nIdeally I would love to live with other people that love what they do and are goal-directed. I would like to share some meals and maybe play some cards in the evenings but we don&apos;t need to be best friends. I don&apos;t care if you smoke pot as long as the house doesn&apos;t smell or look like Cheech&apos;s dorm room.  I know this is kind of an unusual situation so if this sounds like it could work for you feel free to shoot me an email and tell me a bit about yourself.\n    ",
        "image": "http://images.craigslist.org/00505_bID4fmV4jry_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830736652.html"
    },
    {
        "title": "all utilities included,,no credit check,,,can furnish,,420 ok..move i",
        "href": "/mlt/roo/4830696808.html",
        "time": "2015-01-03 11:14",
        "price": "$495",
        "neighborhood": " (se portland)",
        "postBody": "\n        1100$/So 525 moves you in today,but will split the total move in cost to help .... covers 1st mo and 150$ deposit also utilities to get acclimated ..no guests and no drugs this is a quiet older workers type..,420 is ok....all utilities included .rent per month will be a special right now for only 500$ a mo<br>\n<br>\nIn the home my wife and i &quot;owners&quot;...,older construction type guy in the basement,..that&apos;s all at the moment someone is holding one of my rooms until the 11th...older computer type guy<br>\n<br>\nMax line only 5/10 min away &#x1F600;<br>\nBuses right out the door and on the corner 30 feet away &#x1F600;<br>\nRight next to Safeway &#x1F600;les then 500 feet<br>\nWasher and dryer in home!!&#x1F600;<br>\n<br>\nNo weirdos,No couples,...just a normal and quite individual looking for a room more on the short term side..can furnish the room for a little extra $...thanx for looking folks...<br>\n<br>\nEmail me and ill get right back to ya thanx!\n    ",
        "image": "http://images.craigslist.org/00l0l_8tfZjRJZMBY_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830696808.html"
    },
    {
        "title": "Community Has Jan. Opening",
        "href": "/mlt/roo/4821167161.html",
        "time": "2015-01-03 11:12",
        "price": "$420",
        "neighborhood": " (N.E. Portland)",
        "postBody": "\n        Cool room for rent in a large 1970&apos;s 5+br house.<br>\nOne room open Jan. 1st. <br>\n<br>\nWe are looking for an addition to our community -- We like to hang out, but we also have our own lives. Food is not communal, but we are gearing up to occasionally have dinner together. <br>\nThis place is an amazing location once you get to know Portland&apos;s wonderful transportation system. It&apos;s out of the way enough to have some peace and quiet, but it&apos;s close enough to be able to get into town within five or ten minutes (about 45 to get into downtown). <br>\nWe are in N.E. Portland in the Faloma area, one exit off I-5 before you get to Vancouver. <br>\n<br>\nWe also are a start up public benefit non profit so if you know what Monsanto is and are aware of the current environmental and social issues that have been plaguing us you will be a better fit.<br>\n<br>\nWe have people here who ride bikes or use public transportation that enjoy our secluded place. We are on an acre of land with one neighbor. <br>\n<br>\nYour room rents at only $420, and we split the electric, wifi, and water. Normal utilities come to around $. There is also a refundable $350 deposit that must be paid. Of course, you get it back provided you don&apos;t trash the place and pay your bills.<br>\nIt&apos;s a normal-sized room: not huge, not small; there&apos;s decent carpet; the windows face south with a view of our beautiful, lush green backyard. There&apos;s a small walk-in closet in the bedroom, too. <br>\nThe rest of the house has newly put-in, easy-to-clean hardwood floors. We do some good cleaning every couple of weeks.<br>\nWe aren&apos;t bourgeois yuppies; we&apos;re down-to-earth people. We&apos;re musicians, artists, and college students, activists and all around decent humans. <br>\n<br>\nThere&apos;s a large food area in the kitchen, plenty of room for cooking and eating. Good fridge, too!<br>\nThere&apos;s a beautiful, giant field for a back yard, and a substantial front yard as well. <br>\nWe are minutes from Safeway<br>\nWe have absolutely zero tolerance for hard drugs, but we are 420 friendly. <br>\nSewing, gardening, music, and art are encouraged. We love creativity!<br>\nThere&apos;s garage space for storage and a motorcycle/bicycle if you have one.<br>\nThere is off-street and on-site parking.<br>\n2 awesome indoor-only kitties that don&apos;t pee on stuff<br>\nWe have WIFI, it&apos;s the fastest that Comcast that will install in residential homes.<br>\nWe all pay our bills reliably (and expect you to, too!).<br>\nThe house is really quite big.<br>\nIt&apos;s quite mellow here. Many of us play music professionally though, and there is often a live band here during the day practicing. It&apos;s good stuff, though, and pleasant to hear, as well as to join in if you&apos;re musically inclined. <br>\nWe have Central AC for the summer.<br>\n<br>\nSome of us have to get up early in the morning for work (4am) so this house shuts down in the common areas around 9pm or so.<br>\n<br>\nBELOW IS WHAT WE&apos;RE LOOKING FOR IN A ROOMMATE:<br>\n<br>\nEMPLOYED, STUDENT or STEADY INCOME<br>\nCleanliness. We don&apos;t want to live in a gross house, just clean up after yourself and occasionally help clean the kitchen, bathroom and common areas. This is important to be a team player when it comes to the kitchen as the mindset of &quot;I didn&apos;t do that&quot; is a bit immature. We would also be looking at people that are socially stable so we don&apos;t have a bunch of strangers living under a roof. We are trying to create a home not a flop house. <br>\n<br>\nNo Dogs.<br>\nWe tried dogs and have one. Dogs are great but their owners suck.<br>\nWe keep a safe household. There will be no tolerance for hard drugs or aggression.<br>\n<br>\nTOTALLY BE - ok with green herb, a person of peace and tolerance, an artist of any kind, a gamer, a college student, a hippy, a free spirit, a mountain biker, a Clint Eastwood fan, a music fan, gardener, intelligent, witty, mellow, extroverted, shy, funny, happy, goofy, be anything you damn want. Just be respectful. <br>\n<br>\nWe are a mix of omnivores and vegetarians.<br>\nWe don&apos;t care how old you are, as long as you can be young at heart but we prefer 25+ if possible.<br>\nCouples are welcome.<br>\n<br>\nWe would love to meet you and talk about your joining our vibrant community. <br>\nIf you are interested, send an e-mail! The next step is for you to come by and check the place out. <br>\nWe are looking for a new roommate asap to replace  people moving out in June. . <br>\n<br>\nI cannot take phone calls.<br>\nPlease try to remember you are not the only one that is responding to this ad and I cannot take extra time to answer questions in detail other then what is here or what can be answered when we meet. <br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4821167161.html"
    },
    {
        "title": "All Util big house bus max UofP PCC PSU nice area cool pubs and stores",
        "href": "/mlt/roo/4830707061.html",
        "time": "2015-01-03 11:11",
        "price": "$495",
        "neighborhood": " (n portland)",
        "postBody": "\n        I have a room that has just became available in my 2 story house that is in N Portland $495 per month all utilities included and just a few blocks from the University Of Portland and Swan Island. The room is smaller but the house in general has lots of room . I have the house fully furnished you will need to furnish the room... The house is a block off Lombard and the bus that will take you down to the max rail to connect to the rest of the City. Pcc Cascade is 3 miles from the house 5 miles to Downtown  if you would like tolearn more call 503 two 0 9 2 3 zero four\n    ",
        "image": "http://images.craigslist.org/00h0h_clDBk9QpgCS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830707061.html"
    },
    {
        "title": "PCC students",
        "href": "/mlt/roo/4825330604.html",
        "time": "2015-01-03 11:10",
        "price": "$800",
        "neighborhood": " (Beaverton)",
        "postBody": "\n        Going to school at portland community college- sylvan? Need an affordable place to live? We offer student housing off campus only 5 miles away from school. We offer a shared roommate program for more affordable living and the full college living experience. This program lets you focus on school, classes, work, and life in general, while leaving the housing hassles to us. Our program allows us to rent the apartment from the community, and then you pay the total amount due monthly for yourself or all the roommates. The rent payment, furniture, and utilities would be the same price each month. In addition, we&apos;re the only relocation company that furnishes with bedbug protection covers in each and every unit. Want to learn more? visit us at www.nwstudenthousing.com or call us <br>\n <a href=\"/fb/pdx/roo/4825330604\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n We are open six days a week from 8:30 am to 5:30 pm\n    ",
        "image": "http://images.craigslist.org/01515_ej0IK35jBsC_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4825330604.html"
    },
    {
        "title": "Female Mt Hood Community College Students",
        "href": "/mlt/roo/4825332338.html",
        "time": "2015-01-03 11:09",
        "price": "$800",
        "neighborhood": " (Gresham)",
        "postBody": "\n        We are locally owned company that specializes in helping college students secure off-campus housing in the state of Oregon. Since 2008, we have been helping students by easing the burden of finding a place to live while in school. We offer different programs to accommodate the needs and budgets of our clients. Whether you are looking for a place all to yourself or would prefer to have a place to share with some like-minded roommates, we can help you. We are open 6 days a week from 8:30 am to 5:30 pm to answer questions and provide assistance. You can check us out at www.nwstudenthousing.com or you can reach us at \n <a href=\"/fb/pdx/roo/4825332338\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nor Toll Free \n <a href=\"/fb/pdx/roo/4825332338\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n we look forward to helping you! <br>\n***Weekly Rates are based on a one year lease contract term***\n    ",
        "image": "http://images.craigslist.org/00505_jU9UwzRBo6k_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4825332338.html"
    },
    {
        "title": "Temporary Internship Relocation",
        "href": "/mlt/roo/4825331680.html",
        "time": "2015-01-03 11:09",
        "price": "$745",
        "neighborhood": " (Portland Metro Area)",
        "postBody": "\n        Are you moving to Portland metro area for an internship? For Nike Inc., Intel, etc? Need temporary housing till your internship is done? We can help. Here at NW student Housing we specialize in personalized service therefor we recognize the need for flexible lease terms. Internships &amp; Short Term Lease Contracts.Traditional Rental Leases are 12 months long. we have created Short Term Lease Contracts, to best fit your needs. This makes short term rentals as easy as a long term rental but we do all the work, all you have to do is plan your internship and give us a call. We can accommodate terms as short as one month. To get more information about us feel free to visit www.nwstudenthousing.com or give us a call direct: <br>\n <a href=\"/fb/pdx/roo/4825331680\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor toll free <br>\n <a href=\"/fb/pdx/roo/4825331680\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n We are open six days a week Monday through Friday from 8:30 am through 5:30 pm\n    ",
        "image": "http://images.craigslist.org/00H0H_j4J1NdbtOYi_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4825331680.html"
    },
    {
        "title": "FOR RENT IN 4 BEDROOM HOME (SW Portland)",
        "href": "/mlt/roo/4830706607.html",
        "time": "2015-01-03 11:06",
        "price": "$450",
        "neighborhood": " (Multnomah Village)",
        "postBody": "\n        I am looking for a roommate in my 4 bedroom remodeled in and out SW Portland home. Great location within 10 minutes from downtown. The room available is a private large room and is not furnish. This is not just a room but the whole house shared with three other males.. Must have references and a job or proof of school. Great location in SW for students at PSU, Lewis &amp; Clark, &amp; PCC. Call if interested <br>\n <a href=\"/fb/pdx/roo/4830706607\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\navailable Jan .  Please no emails or texts.\n    ",
        "image": "http://images.craigslist.org/00G0G_jlKQRKafks8_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830706607.html"
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4830705097.html",
        "time": "2015-01-03 11:05",
        "price": null,
        "neighborhood": " (Portland)",
        "postBody": "\n        Looking for Responsible, Christian, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.<br>\n\n <a href=\"/fb/pdx/roo/4830705097\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830705097.html"
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4830704044.html",
        "time": "2015-01-03 11:05",
        "price": null,
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Looking for Responsible, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.<br>\n\n <a href=\"/fb/pdx/roo/4830704044\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "image": "http://images.craigslist.org/00101_duzkYKcr8lm_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830704044.html"
    },
    {
        "title": "SE room for rent on Division and 35th",
        "href": "/mlt/roo/4830684130.html",
        "time": "2015-01-03 10:54",
        "price": "$650",
        "neighborhood": " (2607 SE 35th Pl)",
        "postBody": "\n        Hi,<br>\n<br>\nMy name is Miguel and my roommate Phil is moving out sometime this month, so my other roommate John and I are looking for someone to move after February 1st. About the townhouse: it&apos;s two floors and all three rooms are upstairs along with a bathroom and shower that you would share with John. Downstairs is the kitchen, dining area, living room, half bathroom, laundry room, garage, and backyard.<br>\n<br>\nAbout me: I am 28 and work in the financial industry. I am originally from San Francisco and have been in Portland for just over a year. I like cooking, trying new restaurants and bars, although both John and I don&apos;t drink a whole lot and we&apos;re looking for someone to be along the same lines. I love sports, so I&apos;m typically watching some kind of sport on TV as well as movies and shows. I enjoy hiking and snowboarding and just being active in general. I work a M-F job with an occasional Saturday. I enjoy traveling, so I&apos;m typically going back to the Bay or other places when I can. <br>\n<br>\nJohn is 31 and works from home in his room. He has his own trading business. He is very chill and enjoys the outdoors too. He is originally from the Midwest but has been in Portland for some time. He enjoys riding his bike and spending time on his computer. <br>\n<br>\nWe keep the house pretty clean and expect our new roommate to also be clean, especially in the shared areas of the house. We are looking for someone that has a full-time job/going to school that can pay rent every month along with utilities. We hope our new roommate is respectful, nice, easy to get along with, and trustworthy. We are pretty good about not keeping one another up late or waking one another too early. Loud music is a no and we enjoy having company over but also are not looking to have parties and people getting drunk and being annoying. <br>\n<br>\nWe are looking for a single roommate and not couples, kids, nor pets. Utilities are not included, so that means we split electricity, water, sewage, and cable three ways. The cost for the room is $650. You are literally about 50 yards from Division St and in the area where all the new shops, restaurants, bars are opening up. The bus stops are less than a 5 minute walk too. We have really cool and chill neighbors and the neighborhood itself is very safe. The place is fully furnished and I am pretty sure the room will be too if you want. Also, the lease end at the end of April, so you would be taking over Phil&apos;s portion of the rent. I don&apos;t plan on renewing and I am pretty sure John won&apos;t be either. I will most likely be moving back to the Bay Area with work. So that means you have the option of renewing the lease. <br>\n<br>\nIf interested please respond and I would enjoy setting a time and day so you can come check the place out and meet John and myself to see if this would be a good fit. If interested, text me at \n <a href=\"/fb/pdx/roo/4830684130\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nand I will send you pics of the place and room. <br>\n<br>\n<br>\nThanks, <br>\n<br>\nMiguel<br>\n<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830684130.html"
    },
    {
        "title": "Apt to Share (util incl) with Female Next to Reed College",
        "href": "/mlt/roo/4830682063.html",
        "time": "2015-01-03 10:53",
        "price": "$700",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        I&apos;m looking for a female roommate to share a large two bedroom apartment.   It has a separate vanity in bedroom, two closets in bedroom, air conditioning, a beautiful view with lots of large trees and a gorgeous nature trail (with a large lake and a creek) about a block away.  There is some space to add your own furniture.  I&apos;m open to swapping some of your furniture for mine.  Lots of your own shelf space in the kitchen.<br>\n<br>\nIt&apos;s right next to the complexes office with an exercise room, laundry facilities, swimming pool and hot tub. Lots of parking.  Rent would be $700 which includes the utilities and WIFI.<br>\n<br>\nIf you are a foreign student in need of English tutoring, I would be happy to help you learn English.<br>\n<br>\nAbout me:  I&apos;m female. I like to take walks with friends, read books, spend time with my grandchildren and search for divine truths in all things. I&apos;m easy to get along with and try to look at the positive side of events.<br>\n<br>\nIt&apos;s on Steele and 30th with buses stopping at the corner of the complex.<br>\n\n    ",
        "image": "http://images.craigslist.org/00101_82fz4TjQyrB_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830682063.html"
    },
    {
        "title": "Huge Private Room w/Loft in Irvington",
        "href": "/mlt/roo/4824758696.html",
        "time": "2015-01-03 10:48",
        "price": "$850",
        "neighborhood": " (Lloyd Center)",
        "postBody": "\n        Huge Room w/Loft for Rent on private top floor, with private large full bathroom and tons of storage, all utilities included in rent. Beautiful large 1907 gay friendly craftsman home in highly desirable Irvington/Lloyd Center area 5 minutes to downtown and off bus line. Single occupancy and no smoking or pets will be allowed in this quiet drug-free home. Kitchen and laundry privileges; Month to month rental available, 3 month minimum; background check, first &amp; last month rent and $350 security deposit will be required.\n    ",
        "image": "http://images.craigslist.org/00q0q_6dhnX0WW66K_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4824758696.html"
    },
    {
        "title": "Room &amp; House share Se portland",
        "href": "/mlt/roo/4816768836.html",
        "time": "2015-01-03 10:38",
        "price": "$600",
        "neighborhood": " (se portland)",
        "postBody": "\n        I have a large room for rent and share of the house. It&apos;s a smaller 2 bedroom 1 bath house, off of all the main streets in a culde sac, or however you spell it. Room is un furnished, washer and dryer located in bathroom. Large backyard w/ deck for outside fun. Parking in driveway. Full kitchen with dishwasher. Im a 9 to 5 full time mechanic, 38 year old man. I have a 3 year old black lab who is very loving, so you must like dogs. Rent is 600 and that includes utilities. If interested contact Tim @ \n <a href=\"/fb/pdx/roo/4816768836\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n   Room / house share is available for immediate move in.<br>\n<br>\n$600 rent includes utilities, $250 cleaning andand damage fee, $40 application/background<br>\nNo drugs , light alcohol, 420ok. \n    ",
        "image": "http://images.craigslist.org/00t0t_5eB3BhZl74B_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4816768836.html"
    },
    {
        "title": "Nice room in nice apartment in beaverton right off max and busline.",
        "href": "/mlt/roo/4826680536.html",
        "time": "2015-01-03 10:29",
        "price": "$575",
        "neighborhood": " (Beaverton OR)",
        "postBody": "\n        Me and my wife and little Chloe 22 months. Have a nice 2br apartment in Beaverton right off the max and bus line. Looking to rent out the extra room to a nice clean respectful non smoker. Female who doesn&apos;t do drugs and has a clean background history. You would have your own bathroom and room and high speed internet, cable, washer and dryer in apartment so that&apos;s nice. No pets in apartment. Shared living space. 575.00 all utilities included. 1st and last due upon moving in available January 1st hurry wont last long nice place thanks Jason call today \n <a href=\"/fb/pdx/roo/4826680536\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\nlook forward to meeting you.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826680536.html"
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4827723254.html",
        "time": "2015-01-03 10:22",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY.  <br>\n <a href=\"/fb/pdx/roo/4827723254\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4827723254.html"
    },
    {
        "title": "Buckman House Share",
        "href": "/mlt/roo/4826361611.html",
        "time": "2015-01-03 09:42",
        "price": "$650",
        "neighborhood": " (Buckman)",
        "postBody": "\n        \nBuckman area of SE Portland (a.k.a. Lower Hawthorne) that has two rooms coming available for rent on January 15th. The sum total of roommates is 6 when fully occupied, but there are 3 bathrooms, and LOADS of space.\nThe house was built in 1908, and is an old classic foursquare. This house is huge.The house is over 5000 sq feet, and was originally built as a rooming house. <br>\nNo, not kidding. Huge.<br>\nEnjoy your own room and common space galore! There is a full dining room, living room, TV room, and two sun porches. The backyard is small, but fenced, with a small BBQ pit. Off street parking, and plenty of room for bikes.<br>\n<b>VERY IMPORTANT</b><br>\nThis house is for sale, although off the market for the month of January. Showings will resume in February. Although it may be sold to an investor, who would likely keep all tenants, a family interested in the house have the right to give you 60 days notice if they choose to occupy the house after a sale. Just sayin&apos;<br>\nMoving on...<br>\nBoth rooms are a good size on the 2nd floor, one is probably &apos;nicer&apos; than the other, but both have wood floors and sunny windows. If you prefer one over the other, you might want to get in first....or you&apos;ll just have to duke it out. There are three bedrooms on this floor of the house, and share one large bath with shower and clawfoot tub. There are two more bathrooms in the house on other floors (okay, technically, there are four baths total, but for your purposes, there are three)<br>\n Another dog is up for discussion (apparently cats and dachshunds don&apos;t get on?) At this time, I am only renting for one person per room, to keep the house #s in balance. If you are a couple and want both rooms, have at it, no discounts.<br>\n*We are particularly looking for CLEAN habits on this round.<br>\n\nNo, not chore wheels, just identifying areas needing attendance and what I like to refer to as &apos;after clean&apos; Did you make a mess? Clean it the f@$* up. <br><br>\nEnjoy the community and sustainability of shared living.  Utilities are shared on a point system for gas and electric (about $50/60 a month) everything else including wireless internet is included. Washer and dryer are on the 1st floor (as well as the kitchen)<br>\n<br>\n\nPlease contact me with some information about your situation, and I will arrange something with the current tenants so you can meet and see the house.<br>I will try to respond to all inquiries, because I know things are tight and competitive, but I am only the first and last gatekeeper, you&apos;ve still got to appeal to the members of the house.\n<br>\nSome short facts:<br>\nNo smoking of any product tobacco or otherwise in the house.<br>\nMonth-to-month agreements, first month and one months deposit to secure the room. (all deposits must clear prior to move in).<br>\nThe four-legged guardian of the house is a middle-aged dachshund, but is known to get on with others<br>\nCarnivore-friendly<br>\nVegan-friendly<br>\nLGBT friendly<br>\nOh, and anyone practicing for their next dictatorship should look elsewhere.\n    ",
        "image": "http://images.craigslist.org/00h0h_a3dsgjxxkMr_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4826361611.html"
    },
    {
        "title": "Room takeover wanted",
        "href": "/mlt/roo/4821621570.html",
        "time": "2015-01-03 09:39",
        "price": "$550",
        "neighborhood": " (sw portland)",
        "postBody": "\n        Looking for someone to take over the rest of me leases in a duplex very close to PSU Campus the deposit is $833 and Rent would be $550 a month. The move in date would be Feb 9th  and the lease would be up on August 1.\n    ",
        "image": "http://images.craigslist.org/00m0m_8LAbdMdeYkp_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4821621570.html"
    },
    {
        "title": "*** HOME AT LAST: Private 2 Bedroom Suite ***",
        "href": "/mlt/roo/4827612569.html",
        "time": "2015-01-03 09:20",
        "price": "$995",
        "neighborhood": " (Very close in SE Portland)",
        "postBody": "\n        If you are looking for a gracious home in a desirable neighborhood ...<br>\n<br>\nYOU HAVE FOUND YOUR HOME AT LAST!<br>\n<br>\nLocated just minutes from the Sellwood Bridge, and within walking distance to wonderful restaurants, coffee shops, bakeries, New Seasons, bike paths, and kayaking ...<br>\n<br>\nYour 2 bedrooms, private bath, plus living quarters on the second floor are spacious, light-filled, and freshly painted.<br>\n<br>\nWe would share a fully-stocked kitchen and the dining room. The laundry facilities and some storage are available to you in the basement. <br>\n<br>\nThis is a clean, respectful, and peaceful home, not a party house, so NO smoking or drugs.<br>\n<br>\nI&apos;m respectful, easy to get along with, have an active life, and keep a clean home. Hopefully you are as well.<br>\n<br>\nCredit check, references, and proof of dependable income are required. One year lease with first and last month&apos;s rent + $150 security deposit. We will split the utilities.<br>\n<br>\nYour new home is available immediately. Email Chris via this posting and tell me a little about yourself. Include your phone number in your email, and I&apos;ll promptly return your call.<br>\n<br>\nThanks for your interest - I look forward to hearing from you!\n    ",
        "image": "http://images.craigslist.org/00m0m_9WzOKWIs8pe_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4827612569.html"
    },
    {
        "title": "*** PRIVATE 2 bedrooms + bath + living area ***",
        "href": "/mlt/roo/4830501628.html",
        "time": "2015-01-03 09:17",
        "price": "$995",
        "neighborhood": " (Lovely home in very close-in SE Portland)",
        "postBody": "\n        Do you want to live in a centrally located neighborhood, just minutes from the Sellwood Bridge, and within walking distance to wonderful restaurants, coffee shops, bakeries, New Seasons, bike paths, and kayaking?<br>\n<br>\n... LOOK NO FARTHER!<br>\n<br>\nYour 2 bedrooms, private bath, plus living quarters on the second floor are spacious, light-filled, and freshly painted.<br>\n<br>\nWe would share a fully-stocked kitchen and the dining room. The laundry facilities and some storage are available to you in the basement. <br>\n<br>\nThis is a clean and peaceful home, not a party house, so NO smoking or drugs.<br>\n<br>\nI&apos;m respectful, have an active life, am easy to get along with, and keep a clean home ... hopefully you are as well.<br>\n<br>\nCredit check, references, and proof of dependable income are required. One year lease with first and last month&apos;s rent + $150 security deposit. We will split the utilities.<br>\n<br>\nYour new home is available immediately. Email Chris via this posting and tell me a little about yourself. Include your phone number, and I&apos;ll promptly return your call. <br>\n<br>\nThanks for your interest. I&apos;ll look forward to hearing from you!\n    ",
        "image": "http://images.craigslist.org/00m0m_9WzOKWIs8pe_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830501628.html"
    },
    {
        "title": "Seniors Coop/Commune",
        "href": "/mlt/roo/4830482546.html",
        "time": "2015-01-03 09:07",
        "price": "$250",
        "neighborhood": " (Close in SW)",
        "postBody": "\n        The  location is yet to be determined but seeking fairly close in \\SW side.  I tried to post this on Meet Up but that didn&apos;t work, then tried the Srs section of CL and clearly lots of mentally ill people chatting there, so will try again here.  <br>\n<br>\nI am working on building a very friendly shared housing arrangement for seniors.  One where we would rent a house for low cost but in good, clean, nice area and  by transport. The object is to provide an environment where we help each other instead of relying on family (whose often not available), and the massive bureaucracy, including care providers that&apos;s steal, don&apos;t like their job or are squatters.  I figure if like 5 or so of us got together and helped each other, i.e. my bad day is your good day, etc as well as providing companionship through the challenges of aging, it could be a way good thing.  To make it better would be to have at least one bedrm shared so rent is lower.  <br>\nI do feel there needs to be requirements though, as clearly mental illness is pretty rampant and if not that, then just people who don&apos;t have a clue as to what it takes to share space with others in a peaceful and constructive manners. We can discuss the rules too, but for now they are;  <br>\n1.  Must not have mental health issues,  (intermittent brain fog or moodiness is ok)<br>\n2.  Must be able to discuss any issues without arguing or fighting<br>\n3.  Must be intelligent with good sense of humor and into  constructive things<br>\n4.  Must be cat  and smoker tolerant (ie smells on clothing etc as smoking will be outside)<br>\n<br>\nIm working on being able to obtain housing that will cost ea person approx $200 for rent and then their share of  utilities/intenet/tv  (hence I reflect $250 which maybe a little off but not much, I don&apos;t think).  <br>\n<br>\nIf interested let me know.  Once I  have connected with like 7 people I will set an initial  meeting downtown (convenient to all) where we can meet and chat. Then   I think we should all meet say 5 times so  we have a good sense of each other. Maybe meeting at each others current residence  if workable.  <br>\n<br>\n Look forward to hearing from you.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4830482546.html"
    },
    {
        "title": "Eco Friendly Living for Women",
        "href": "/mlt/roo/4827183302.html",
        "time": "2015-01-03 09:01",
        "price": "$695",
        "neighborhood": " (SE 37th &amp; Gladstone)",
        "postBody": "\n        Kailash Ecovillage is a sustainably based intentional community with plenty of garden space and bike parking. This is shared housing for earth friendly Women. Would you like to live with others who share your passion for the environment? Have you ever wanted to live in an intentional community? Then you will love this great housing option. Our apartment complex has just remodeled one of our units to be shared housing with lovely bamboo flooring and granite counter tops. It is close to Reed College and also very easy to get to PSU by bike or bus. Everyone in our community has been selected for their dedication to recycling, composting and sustainability. We have around an acre of vegetable gardens!<br>\n<br>\nA private bedroom and bathroom, shared kitchen and dining with one other woman. 12-month lease.<br>\n<br>\nIf you have an interest in viewing our sustainable living property then please send us a quick email about your experience with sustainable living and we can set up a tour date for you. Rent is $695 per month plus utilities.<br>\n<br>\nNote: Non Smokers Only, No Pets\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4827183302.html"
    }
]