[
    {
        "title": "Buckman House Share",
        "href": "/mlt/roo/4826361611.html",
        "time": "2015-01-03 09:42",
        "price": "$650",
        "neighborhood": " (Buckman)",
        "postBody": "\n        \nBuckman area of SE Portland (a.k.a. Lower Hawthorne) that has two rooms coming available for rent on January 15th. The sum total of roommates is 6 when fully occupied, but there are 3 bathrooms, and LOADS of space.\nThe house was built in 1908, and is an old classic foursquare. This house is huge.The house is over 5000 sq feet, and was originally built as a rooming house. <br>\nNo, not kidding. Huge.<br>\nEnjoy your own room and common space galore! There is a full dining room, living room, TV room, and two sun porches. The backyard is small, but fenced, with a small BBQ pit. Off street parking, and plenty of room for bikes.<br>\n<b>VERY IMPORTANT</b><br>\nThis house is for sale, although off the market for the month of January. Showings will resume in February. Although it may be sold to an investor, who would likely keep all tenants, a family interested in the house have the right to give you 60 days notice if they choose to occupy the house after a sale. Just sayin&apos;<br>\nMoving on...<br>\nBoth rooms are a good size on the 2nd floor, one is probably &apos;nicer&apos; than the other, but both have wood floors and sunny windows. If you prefer one over the other, you might want to get in first....or you&apos;ll just have to duke it out. There are three bedrooms on this floor of the house, and share one large bath with shower and clawfoot tub. There are two more bathrooms in the house on other floors (okay, technically, there are four baths total, but for your purposes, there are three)<br>\n Another dog is up for discussion (apparently cats and dachshunds don&apos;t get on?) At this time, I am only renting for one person per room, to keep the house #s in balance. If you are a couple and want both rooms, have at it, no discounts.<br>\n*We are particularly looking for CLEAN habits on this round.<br>\n\nNo, not chore wheels, just identifying areas needing attendance and what I like to refer to as &apos;after clean&apos; Did you make a mess? Clean it the f@$* up. <br><br>\nEnjoy the community and sustainability of shared living.  Utilities are shared on a point system for gas and electric (about $50/60 a month) everything else including wireless internet is included. Washer and dryer are on the 1st floor (as well as the kitchen)<br>\n<br>\n\nPlease contact me with some information about your situation, and I will arrange something with the current tenants so you can meet and see the house.<br>I will try to respond to all inquiries, because I know things are tight and competitive, but I am only the first and last gatekeeper, you&apos;ve still got to appeal to the members of the house.\n<br>\nSome short facts:<br>\nNo smoking of any product tobacco or otherwise in the house.<br>\nMonth-to-month agreements, first month and one months deposit to secure the room. (all deposits must clear prior to move in).<br>\nThe four-legged guardian of the house is a middle-aged dachshund, but is known to get on with others<br>\nCarnivore-friendly<br>\nVegan-friendly<br>\nLGBT friendly<br>\nOh, and anyone practicing for their next dictatorship should look elsewhere.\n    "
    },
    {
        "title": "*** HOME AT LAST: Private 2 Bedroom Suite ***",
        "href": "/mlt/roo/4827612569.html",
        "time": "2015-01-03 09:20",
        "price": "$995",
        "neighborhood": " (Very close in SE Portland)",
        "postBody": "\n        If you are looking for a gracious home in a desirable neighborhood ...<br>\n<br>\nYOU HAVE FOUND YOUR HOME AT LAST!<br>\n<br>\nLocated just minutes from the Sellwood Bridge, and within walking distance to wonderful restaurants, coffee shops, bakeries, New Seasons, bike paths, and kayaking ...<br>\n<br>\nYour 2 bedrooms, private bath, plus living quarters on the second floor are spacious, light-filled, and freshly painted.<br>\n<br>\nWe would share a fully-stocked kitchen and the dining room. The laundry facilities and some storage are available to you in the basement. <br>\n<br>\nThis is a clean, respectful, and peaceful home, not a party house, so NO smoking or drugs.<br>\n<br>\nI&apos;m respectful, easy to get along with, have an active life, and keep a clean home. Hopefully you are as well.<br>\n<br>\nCredit check, references, and proof of dependable income are required. One year lease with first and last month&apos;s rent + $150 security deposit. We will split the utilities.<br>\n<br>\nYour new home is available immediately. Email Chris via this posting and tell me a little about yourself. Include your phone number in your email, and I&apos;ll promptly return your call.<br>\n<br>\nThanks for your interest - I look forward to hearing from you!\n    "
    },
    {
        "title": "*** PRIVATE 2 bedrooms + bath + living area ***",
        "href": "/mlt/roo/4830501628.html",
        "time": "2015-01-03 09:17",
        "price": "$995",
        "neighborhood": " (Lovely home in very close-in SE Portland)",
        "postBody": "\n        Do you want to live in a centrally located neighborhood, just minutes from the Sellwood Bridge, and within walking distance to wonderful restaurants, coffee shops, bakeries, New Seasons, bike paths, and kayaking?<br>\n<br>\n... LOOK NO FARTHER!<br>\n<br>\nYour 2 bedrooms, private bath, plus living quarters on the second floor are spacious, light-filled, and freshly painted.<br>\n<br>\nWe would share a fully-stocked kitchen and the dining room. The laundry facilities and some storage are available to you in the basement. <br>\n<br>\nThis is a clean and peaceful home, not a party house, so NO smoking or drugs.<br>\n<br>\nI&apos;m respectful, have an active life, am easy to get along with, and keep a clean home ... hopefully you are as well.<br>\n<br>\nCredit check, references, and proof of dependable income are required. One year lease with first and last month&apos;s rent + $150 security deposit. We will split the utilities.<br>\n<br>\nYour new home is available immediately. Email Chris via this posting and tell me a little about yourself. Include your phone number, and I&apos;ll promptly return your call. <br>\n<br>\nThanks for your interest. I&apos;ll look forward to hearing from you!\n    "
    },
    {
        "title": "Seniors Coop/Commune",
        "href": "/mlt/roo/4830482546.html",
        "time": "2015-01-03 09:07",
        "price": "$250",
        "neighborhood": " (Close in SW)",
        "postBody": "\n        The  location is yet to be determined but seeking fairly close in \\SW side.  I tried to post this on Meet Up but that didn&apos;t work, then tried the Srs section of CL and clearly lots of mentally ill people chatting there, so will try again here.  <br>\n<br>\nI am working on building a very friendly shared housing arrangement for seniors.  One where we would rent a house for low cost but in good, clean, nice area and  by transport. The object is to provide an environment where we help each other instead of relying on family (whose often not available), and the massive bureaucracy, including care providers that&apos;s steal, don&apos;t like their job or are squatters.  I figure if like 5 or so of us got together and helped each other, i.e. my bad day is your good day, etc as well as providing companionship through the challenges of aging, it could be a way good thing.  To make it better would be to have at least one bedrm shared so rent is lower.  <br>\nI do feel there needs to be requirements though, as clearly mental illness is pretty rampant and if not that, then just people who don&apos;t have a clue as to what it takes to share space with others in a peaceful and constructive manners. We can discuss the rules too, but for now they are;  <br>\n1.  Must not have mental health issues,  (intermittent brain fog or moodiness is ok)<br>\n2.  Must be able to discuss any issues without arguing or fighting<br>\n3.  Must be intelligent with good sense of humor and into  constructive things<br>\n4.  Must be cat  and smoker tolerant (ie smells on clothing etc as smoking will be outside)<br>\n<br>\nIm working on being able to obtain housing that will cost ea person approx $200 for rent and then their share of  utilities/intenet/tv  (hence I reflect $250 which maybe a little off but not much, I don&apos;t think).  <br>\n<br>\nIf interested let me know.  Once I  have connected with like 7 people I will set an initial  meeting downtown (convenient to all) where we can meet and chat. Then   I think we should all meet say 5 times so  we have a good sense of each other. Maybe meeting at each others current residence  if workable.  <br>\n<br>\n Look forward to hearing from you.\n    "
    },
    {
        "title": "Eco Friendly Living for Women",
        "href": "/mlt/roo/4827183302.html",
        "time": "2015-01-03 09:01",
        "price": "$695",
        "neighborhood": " (SE 37th &amp; Gladstone)",
        "postBody": "\n        Kailash Ecovillage is a sustainably based intentional community with plenty of garden space and bike parking. This is shared housing for earth friendly Women. Would you like to live with others who share your passion for the environment? Have you ever wanted to live in an intentional community? Then you will love this great housing option. Our apartment complex has just remodeled one of our units to be shared housing with lovely bamboo flooring and granite counter tops. It is close to Reed College and also very easy to get to PSU by bike or bus. Everyone in our community has been selected for their dedication to recycling, composting and sustainability. We have around an acre of vegetable gardens!<br>\n<br>\nA private bedroom and bathroom, shared kitchen and dining with one other woman. 12-month lease.<br>\n<br>\nIf you have an interest in viewing our sustainable living property then please send us a quick email about your experience with sustainable living and we can set up a tour date for you. Rent is $695 per month plus utilities.<br>\n<br>\nNote: Non Smokers Only, No Pets\n    "
    },
    {
        "title": "Space Available in Furnished Home",
        "href": "/mlt/roo/4823427779.html",
        "time": "2015-01-03 08:40",
        "price": null,
        "neighborhood": " (Downtown)",
        "postBody": "\n        Centrally located, this Condo is only blocks from Portland State University. Enjoy Life in a secure, newly renovated building. Take a short walk to Waterfront Park, shop Pioneer Place, browse the Farmers, or Saturday Markets. Dine at any number of fabulous restaurants and bars centrally located or hop on the street car or MAX, both are right at your front door for a quick ride to anywhere else your heart desires!<br>\n<br>\nWith just under a thousand square feet this fully furnished condo will meet all your Entertaining needs, with tasteful furniture, internet/WiFi, phone, gaming console, and a PC based home theater solution. <br>\n<br>\nThe unit has a covered patio &amp; BBQ, wood floors, Berber carpet, stainless steel appliances, granite counters, and access to free laundry, pool, spa, and sauna. Enjoy great views of the South Waterfront to the West Hills and City Lights. The place is a fully equipped with all the gadgets, cooking or multimedia. All the dishes, utensils and a fully stocked pantry with everything you need to dine-in.<br>\n<br>\n<br>\nRATES &amp; PRICES Negotiable based on Length &amp; Use of Property<br>\n<br>\nNightly, Weekend, Weekly, or Extended Stay Negotiable<br>\n<br>\n<br>\n* Spectacular Southern and Western Views<br>\n* Just under &lt;1000 sq ft w/ BBQ &amp; Balcony.<br>\n* Great downtown location, close to PSU, OHSU.<br>\n* Walk to Shops, Waterfront, Keller Auditorium, Restaurants and much More<br>\n* All appliances, offices, household supplies and anything else upon request<br>\n* Price Includes all utilities, including electric, water, garbage, security, cable, high speed internet<br>\n* Queen Size Canopy Bed &amp; Dresser and all furniture possible<br>\n* All linens, towels &amp; household goods<br>\n* Portland Streetcar &amp; Max located next to building<br>\n* Secured Underground Parking Available<br>\n* No Smoking on the Property/Building Rule<br>\n<br>\nPlease Reply via email with a contact email &amp;  #, some details about yourself, reason &amp; dates for your stay.<br>\n<br>\nPlease include a price range for the length of time you&apos;d expect to stay/pay.<br>\n<br>\nPlease understand it is hard to value something you haven&apos;t seen, but once you&apos;ve seen the place, I assure you it is worth the price you pay.<br>\n<br>\n<br>\n<br>\nOther listings do not compare... but if you want to check out how others market the property:<br>\nhttp://www.harrisontowerapartments\n    "
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4824732723.html",
        "time": "2015-01-03 08:25",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY. <br>\n <a href=\"/fb/pdx/roo/4824732723\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    "
    },
    {
        "title": "Female Student Seeks Mature Female Roomma",
        "href": "/mlt/roo/4808310519.html",
        "time": "2015-01-03 08:16",
        "price": "$425",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Hi,<br>\n<br>\nI&apos;m a full time student @ MHCC and work graveyard.  I enjoy a peace and quiet atmosphere. <br>\nI am most comfortable in a neat and clean environment. <br>\nConvenient location in downtown Gresham, close to max and bus lines, 10 minutes from MHCC.<br>\nNO Alcohol and drugs.<br>\nBackground check required.<br>\n<br>\nPlease contact me if you are interested in setting up an appointment to meet.<br>\nThank you &amp; have a nice day.\n    "
    },
    {
        "title": "$485, comes with large furnished living rm/kitchen",
        "href": "/mlt/roo/4825206538.html",
        "time": "2015-01-03 08:07",
        "price": "$485",
        "neighborhood": " (SE Bush, E of SE 136)",
        "postBody": "\n        Utilities, &amp;YI5 included. QUIET  in grand house, share furnished   large clean kitchen and living room, Shared with  3 quiet men. Private room Not shared. Share shower, bath shared with one male. No roommates, sublets, no mates, couples. No pets. Excellent for those who don&apos;t party, want QUIET!. Edwin, <br>\n <a href=\"/fb/pdx/roo/4825206538\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    "
    },
    {
        "title": "Room in cozy St. John&apos;s home for Young professional/student",
        "href": "/mlt/roo/4830328752.html",
        "time": "2015-01-03 07:33",
        "price": "$525",
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Hey there!<br>\n<br>\nWe are looking for a student/young professional to rent our spare bedroom starting in the month of January.  We are just a few blocks from downtown St. John&apos;s where you can find many restaurants, bars, coffee shops, and boutiques. We are really close to Columbia Blvd for easy access to I-5 or 84. You can go over the St. John&apos;s bridge and get on hwy 30 or head on Germantown road to get to Beaverton/Hillsboro. Todd and I both work in Vancouver and it&apos;s only a 15 min drive. If you&apos;d like to be close to the university of Portland we are just a 5min drive away. <br>\n<br>\n Here is a little about us! Todd is a school counselor and I&apos;m a teacher. (My name is Erin) Todd is 31 and I am 28. We are super active. We are just getting into white water kayaking which has been really fun. We&apos;re both from the Midwest and grew up going to lakes in the summer but neither of us had really been around rivers much.  Todd snowboards and I like to ski. We both love to drink beer :) We are friendly, fun loving people. We have a cuddle monster of a dog named Angus. Unfortunately Angus has hip dysplasia so we can&apos;t accept any more animals. We are clean people but we understand that life happens.  I have an extra bed that could be used for a bit if needed but we&apos;d like to eventually keep it in the other spare room for guests. Let me know if you&apos;re interested! <br>\n<br>\nWe are looking for just one person to occupy the room. We&apos;ve received several inquiries from couples. We feel that with the space we have, one person would be best.  We are looking for someone to move in asap.<br>\n<br>\nGive me a call!<br>\n\n <a href=\"/fb/pdx/roo/4830328752\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nTake Care,<br>\nErin and Todd<br>\n\n    "
    },
    {
        "title": "Sunny Pvt FURNISHED Room! Large Yard to Enjoy",
        "href": "/mlt/roo/4830275127.html",
        "time": "2015-01-03 06:52",
        "price": "$550",
        "neighborhood": " (ne portland)",
        "postBody": "\n        Great opportunity for a person new to the area in a good neighborhood, close to public transportation, shops &amp; services, parks n&apos; Libraries.<br>\nPark your car and bike everywhere from here-----that is what I do and it works well.<br>\nI&apos;m quiet, studious and occasionally have wild Scrabble, Backgammon &amp; Trivial pursuit parties/get-togethers with other over-educated, well traveled friends.<br>\nI&apos;m looking for someone who is Liberal, Progressive and Open Minded---------no grinches allowed!<br>\ndoes this sound like it might work for you? This is not a &quot;Party House&quot; even though I&apos;m 420 freindly. I&apos;m into clean &amp;sober living, practice Naturopathy. A heavy drinker &amp; smoker would not like it here. <br>\nMy 3 &apos;Kitties&apos; are clean and friendly. Yours would be welcome, also.<br>\nRent includes: FREE Wi-Fi, Utilities, laundry  and Storage Space. Move in costs are: $550 + $200 (Available Jan 1st) Refundable Security Deposit + $50 cleaning fee (non-refundable) + 2 references. $800 to move in.\n    "
    },
    {
        "title": "Seeking Congenial Housemate - Female",
        "href": "/mlt/roo/4825024132.html",
        "time": "2015-01-03 05:41",
        "price": null,
        "neighborhood": " (Interstate Bridge)",
        "postBody": "\n        ONLY Long-Term Prospects (Over a year).<br>\n Share a townhouse centrally-located by the Interstate Bridge. In an idyllic setting, with public transportation at the door and shopping, downtown Vancouver, Clark College, and many amenities within walking distance. . . the living quarters include a bedroom and adjacent full bath for you (your housemate has the 2nd bedroom and bath); washer/dryer upstairs; high ceilings, both floors; expansive front porch and rear patio; and ample common areas (kitchen, dining and living). Townhouse is fully furnished EXCEPT for the bedroom; and deposit is in place (housemate has been residing here for several years). Cleaning chores to be shared!<br>\n Cost of lease, all utilities, cable and WIFI is approximately $1550 per month. . . but your share could be subsidized somewhat in exchange for some cooking/cleaning services or even editing services if you have the academic background (your housemate is a writer). Your cost: $500-$750 range.<br>\n Other: Prefer no pets but, if an otherwise great compatibility exists, an exception might be made -- it would require, however, a pet deposit. Housemate offer is extended to intellectually and emotionally-mature female in good health; someone with a reasonable education-culture capable of carrying a conversation; a person financially-solvent, AND a spotless [criminal] background.<br>\n Your host-housemate: a scholarly, mature gentleman with a successful and long professional background in the community now dedicating the third stage of his life to writing.<br>\n If interested, please reply in an extensive manner stating your preferences. . . and describing yourself. If you are in a hurry &quot;to rent a place,&quot; your needs and mine are probably incompatible, since my search is for congeniality. . . and finding whether it might exist requires more than just a casual meeting. <br>\n<br>\n<br>\n\n    "
    },
    {
        "title": "&#x271B;&#x271B;Elegant One BR in the Pearl District w/parking&#x271B;&#x271B;",
        "href": "/mlt/roo/4830177878.html",
        "time": "2015-01-03 05:04",
        "price": "$500",
        "neighborhood": " (portland)",
        "postBody": "\n        Stunning second floor home with extra large deck<br>\nand a western exposure, this tanner place condominium<br>\nhas it all; a enormous master bedroom with expansive closet, <br>\ngorgeous brazilian cherry wood flooring, modern kitchen with maple<br>\ncabinetry that overlooks an open concept entertaining space, a large storage <br>\nunit and garage parking space.All utilities except electric are included. In the heart<br>\nof the pearl district! Walk,shop,dine in portland.Shoot me a text if you are interested at  \n <a href=\"/fb/pdx/roo/4830177878\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\n\n    "
    },
    {
        "title": "Basement room, 420 friendly house, $306.00/month",
        "href": "/mlt/roo/4830125570.html",
        "time": "2015-01-03 01:42",
        "price": "$306",
        "neighborhood": " (Portland)",
        "postBody": "\n        <b>The Place:</b><br>\n3263 SE 178th Ave. Portland, OR 97236<br>\n<br>\nIt&apos;s a house, about ten minute walk from the #4 bus stop, about 30 minute walk to the Max line. Basement room, about 14&apos; by 12&apos; with it&apos;s own toilet.<br>\n<br>\nWasher/dryer, kitchen with dish washer, big back yard.<br>\n<br>\n<b>The Price:</b><br>\n$306.25/month rent<br>\n$56.00/month bills<br>\n<br>\n$365.00 moves you in today!<br>\n<br>\n<b>The House Rules:</b><br>\n-No pets. Sorry. I love animals, but I don&apos;t own the house and can&apos;t bend this rule.<br>\n-Must be 420 friendly. You don&apos;t have to smoke, just don&apos;t be annoyed by people who do.<br>\n-No junkies and <b><u>ABSOLUTELY NO METH.</u></b><br>\n-Respect the house/pick up after yourself and be easy to get along with.<br>\n<br>\n<b>The Dudes:</b><br>\nThere are four of us, ages 24, 28, 30, and 31. Two are musicians, I&apos;m a comic artist. All of us work. All pretty chill. All 420 enthusiasts. <br>\n<br>\n<b>The Disclaimer:</b><br>\nThe last time I posted this ad I got around 90 texts in three days. I work full time and can&apos;t always reply immediately, so please be patient with me. If this ad is still up, then the room is still available.<br>\n<br>\nSo, if you like what you read, then shoot me a text!\n    "
    },
    {
        "title": "LOOK!!! Nice Room for Rent is Great house across from Concordia UNIV",
        "href": "/mlt/roo/4830123004.html",
        "time": "2015-01-03 01:24",
        "price": "$440",
        "neighborhood": " (Portland, OR 30th Ainsworth)",
        "postBody": "\n        Available NOW!!! Great Price for the ROOM. Hi, I have 2 Bedrooms Available in my 2500 sq foot house right across from Concordia University. There are currently 3 people living upstairs on the main floor that has nice size living room, dinning room, kitchen, and 2 bathrooms.  Their are currently 3 males living upstairs. I recently remodeled the downstairs added 3 bedrooms a full bath and a full kitchen. It has a separate entrance but with a connecting door to the upstairs. Their are currently 2 males living downstairs. The room available is downstairs right next to the bathroom. Room size is about 14ft by 12ft. We are looking for someone that is clean, friendly, responsible and down to earth. Average age currently is 20 - 28 I am looking for someone that is either a student or has a full time job. Someone that is responsible picks up after themselves, and that can pay their rent and bills on time. The Utilities are divided up between everyone in the house. We have Wireless Internet and cable in all rooms. I&apos;m looking for someone that wouldn&apos;t mind having a utility bill in there name. I ask for a $250 refundable security deposit and a $125 move in fee that goes towards lock &amp; key, application, background check etc. I also have a Lawn care service that comes a couple times a month. The house is semi furnished now. Very safe and friendly neighborhood. If you are interested please give me a call and we can set up a time for you to see the house and meet everyone thanks. Luke <br>\n <a href=\"/fb/pdx/roo/4830123004\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nNO pets\n    "
    },
    {
        "title": "LOOK!!! Nice Room for Rent is Great house across from Concordia UNIV",
        "href": "/mlt/roo/4830122768.html",
        "time": "2015-01-03 01:23",
        "price": "$440",
        "neighborhood": " (Portland, OR 30th Ainsworth)",
        "postBody": "\n        Available NOW!!! Great Price for the ROOM. Hi, I have 2 Bedrooms Available in my 2500 sq foot house right across from Concordia University. There are currently 3 people living upstairs on the main floor that has nice size living room, dinning room, kitchen, and 2 bathrooms.  Their are currently 3 males living upstairs. I recently remodeled the downstairs added 3 bedrooms a full bath and a full kitchen. It has a separate entrance but with a connecting door to the upstairs. Their are currently 2 males living downstairs. The room available is downstairs right next to the bathroom. Room size is about 14ft by 12ft. We are looking for someone that is clean, friendly, responsible and down to earth. Average age currently is 20 - 28 I am looking for someone that is either a student or has a full time job. Someone that is responsible picks up after themselves, and that can pay their rent and bills on time. The Utilities are divided up between everyone in the house. We have Wireless Internet and cable in all rooms. I&apos;m looking for someone that wouldn&apos;t mind having a utility bill in there name. I ask for a $250 refundable security deposit and a $125 move in fee that goes towards lock &amp; key, application, background check etc. I also have a Lawn care service that comes a couple times a month. The house is semi furnished now. Very safe and friendly neighborhood. If you are interested please give me a call and we can set up a time for you to see the house and meet everyone thanks. Luke <br>\n <a href=\"/fb/pdx/roo/4830122768\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nNO pets\n    "
    },
    {
        "title": "LOOK!!! Nice Room for Rent is Great house across from Concordia UNIV",
        "href": "/mlt/roo/4830122601.html",
        "time": "2015-01-03 01:23",
        "price": "$440",
        "neighborhood": " (Portland, OR 30th Ainsworth)",
        "postBody": "\n        Available NOW!!! Great Price for the ROOM. Hi, I have 2 Bedrooms Available in my 2500 sq foot house right across from Concordia University. There are currently 3 people living upstairs on the main floor that has nice size living room, dinning room, kitchen, and 2 bathrooms.  Their are currently 3 males living upstairs. I recently remodeled the downstairs added 3 bedrooms a full bath and a full kitchen. It has a separate entrance but with a connecting door to the upstairs. Their are currently 2 males living downstairs. The room available is downstairs right next to the bathroom. Room size is about 14ft by 12ft. We are looking for someone that is clean, friendly, responsible and down to earth. Average age currently is 20 - 28 I am looking for someone that is either a student or has a full time job. Someone that is responsible picks up after themselves, and that can pay their rent and bills on time. The Utilities are divided up between everyone in the house. We have Wireless Internet and cable in all rooms. I&apos;m looking for someone that wouldn&apos;t mind having a utility bill in there name. I ask for a $250 refundable security deposit and a $125 move in fee that goes towards lock &amp; key, application, background check etc. I also have a Lawn care service that comes a couple times a month. The house is semi furnished now. Very safe and friendly neighborhood. If you are interested please give me a call and we can set up a time for you to see the house and meet everyone thanks. Luke <br>\n <a href=\"/fb/pdx/roo/4830122601\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nNO pets\n    "
    },
    {
        "title": "LOOK!!! Nice Room for Rent is Great house across from Concordia UNIV",
        "href": "/mlt/roo/4830122226.html",
        "time": "2015-01-03 01:21",
        "price": "$440",
        "neighborhood": " (Portland, OR 30th Ainsworth)",
        "postBody": "\n        Available NOW!!! Great Price for the ROOM. Hi, I have 2 Bedrooms Available in my 2500 sq foot house right across from Concordia University. There are currently 3 people living upstairs on the main floor that has nice size living room, dinning room, kitchen, and 2 bathrooms.  Their are currently 3 males living upstairs. I recently remodeled the downstairs added 3 bedrooms a full bath and a full kitchen. It has a separate entrance but with a connecting door to the upstairs. Their are currently 2 males living downstairs. The room available is downstairs right next to the bathroom. Room size is about 14ft by 12ft. We are looking for someone that is clean, friendly, responsible and down to earth. Average age currently is 20 - 28 I am looking for someone that is either a student or has a full time job. Someone that is responsible picks up after themselves, and that can pay their rent and bills on time. The Utilities are divided up between everyone in the house. We have Wireless Internet and cable in all rooms. I&apos;m looking for someone that wouldn&apos;t mind having a utility bill in there name. I ask for a $250 refundable security deposit and a $125 move in fee that goes towards lock &amp; key, application, background check etc. I also have a Lawn care service that comes a couple times a month. The house is semi furnished now. Very safe and friendly neighborhood. If you are interested please give me a call and we can set up a time for you to see the house and meet everyone thanks. Luke <br>\n <a href=\"/fb/pdx/roo/4830122226\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nNO pets\n    "
    },
    {
        "title": "LOOK!!! Nice Room for Rent is Great house across from Concordia UNIV",
        "href": "/mlt/roo/4830122085.html",
        "time": "2015-01-03 01:21",
        "price": "$440",
        "neighborhood": " (Portland, OR 30th Ainsworth)",
        "postBody": "\n        Available NOW!!! Great Price for the ROOM. Hi, I have 2 Bedrooms Available in my 2500 sq foot house right across from Concordia University. There are currently 3 people living upstairs on the main floor that has nice size living room, dinning room, kitchen, and 2 bathrooms.  Their are currently 3 males living upstairs. I recently remodeled the downstairs added 3 bedrooms a full bath and a full kitchen. It has a separate entrance but with a connecting door to the upstairs. Their are currently 2 males living downstairs. The room available is downstairs right next to the bathroom. Room size is about 14ft by 12ft. We are looking for someone that is clean, friendly, responsible and down to earth. Average age currently is 20 - 28 I am looking for someone that is either a student or has a full time job. Someone that is responsible picks up after themselves, and that can pay their rent and bills on time. The Utilities are divided up between everyone in the house. We have Wireless Internet and cable in all rooms. I&apos;m looking for someone that wouldn&apos;t mind having a utility bill in there name. I ask for a $250 refundable security deposit and a $125 move in fee that goes towards lock &amp; key, application, background check etc. I also have a Lawn care service that comes a couple times a month. The house is semi furnished now. Very safe and friendly neighborhood. If you are interested please give me a call and we can set up a time for you to see the house and meet everyone thanks. Luke <br>\n <a href=\"/fb/pdx/roo/4830122085\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nNO pets\n    "
    },
    {
        "title": "gay male in brooklyn seeks housemate",
        "href": "/mlt/roo/4830121688.html",
        "time": "2015-01-03 01:19",
        "price": "$700",
        "neighborhood": " (gladstone and 26th avenue)",
        "postBody": "\n        36 yo gay healthcare professional seeks a like minded roomie to share nice, 3-bedroom remodeled brooklyn bungalow. rent is $700 and includes utilities. no pets. i have a dog but don&apos;t want another one in the house. room is furnished but can be negotiated. private bath, shared laundry room, kitchen and common areas.\n    "
    },
    {
        "title": "&#x25BA;---LONG TERM WEEKLY SHARED HOUSING---&#x263B;---HURRY---",
        "href": "/mlt/roo/4830118377.html",
        "time": "2015-01-03 01:17",
        "price": "$149",
        "neighborhood": " (SE PORTLAND)",
        "postBody": "\n        * SRO=SINGLE ROOM OCCUPANCY=1 PERSON<br>\n* FURNISHED ROOM<br>\n* SHARE KITCHEN<br>\n* EUROPEAN SHARED BATHROOM<br>\n<br>\n* ROOM PRICES $149 + UTILITIES + CABLE/INTERNET<br>\n* EASY BUS TO CITY CENTER<br>\n<br>\n* SMOKE FREE<br>\n* ALCOHOL &amp; DRUG FREE ZONE<br>\n* NO VISITORS/GUESTS<br>\n* NO ANIMALS<br>\n<br>\n<h2>SE PORTLAND &lt;&gt; \n <a href=\"/fb/pdx/roo/4830118377\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n&lt;&gt;</h2><br>\n<br>\nAll rooms subject to prior rental. Minimum stay required 5 weeks. We reserve the right to make changes without notice, and are not responsible for errors or omissions. All prices exclude city, county, state, and federal fees and taxes, screening fees, and deposits.<br>\n\n\n    "
    },
    {
        "title": "Room available 2/1/15",
        "href": "/mlt/roo/4830105471.html",
        "time": "2015-01-03 00:20",
        "price": null,
        "neighborhood": null,
        "postBody": "\n        I have a room available in a shared housing situation located in SE Pdx in the mt. Tabor/Montavilla neighborhood...the room is 11x11 with closet...I&apos;m charging $500/month with first and last prior to move in...rent includes all utilities minus cable...Comcast wifi factored into monthly rent...please be pet friendly respectful of housemates space and personal belongings\n    "
    },
    {
        "title": "small unfinished basement room",
        "href": "/mlt/roo/4830094683.html",
        "time": "2015-01-02 23:48",
        "price": "$300",
        "neighborhood": " (60th and Flavel)",
        "postBody": "\n        Small unfinished basement room, no windows. We drink and smoke inside, No Pets, we have 2 small dogs and a tortoise, 420 friendly. We are 2 single guys both with jobs, we work weird hours. Either 1/3 utilities or trade for cleaning. $300 a month plus deposit. Respond with a name or link to your Facebook <br>\n<br>\n*no vegans, glutton free, Christians, homophobs or whatever else..... We&apos;re rad dudes who get rad.\n    "
    },
    {
        "title": "Room for rent in SE $275",
        "href": "/mlt/roo/4830084360.html",
        "time": "2015-01-02 23:20",
        "price": "$275",
        "neighborhood": " (Lents neighborhood)",
        "postBody": "\n        Looking for a fairly clean and mellow female roomate. In the south east portland area, 420 friendly :) It will be a month from now so please let me know ASAP\n    "
    },
    {
        "title": "Room For Rent",
        "href": "/mlt/roo/4821764800.html",
        "time": "2015-01-02 22:23",
        "price": "$575",
        "neighborhood": " (Beaumont / Wilshire)",
        "postBody": "\n        Share our beautiful Beaumont Wilshire neighborhood home. We live one block from TRIMET and 15 minutes from Concordia College and PCC Cascade Campus.  We are in a quiet neighborhood with friendly neighbors.  The room available looks out over a beautiful back yard with all kinds of fruits and vegetables in the garden.  We enjoy hiking, classical music, and the fine arts such as ballet, and the Oregon Symphony.  Right now the household includes myself,  my son, and an exchange student from overseas.  No alcohol, drugs, or sexual behavior in or around the premises. No pets.\n    "
    },
    {
        "title": "Room Open Now, utilities included",
        "href": "/mlt/roo/4827270593.html",
        "time": "2015-01-02 22:06",
        "price": "$550",
        "neighborhood": " (portland/clackamas)",
        "postBody": "\n        I need a roommate soon, Jan 8th, at the latest, large semi furnished, room with two big closets open now, mth to mth or temp stay is ok, at least 2 mths coming in, it is a house share with male and female roommates, includes utilities, internet also avail, shared kitchen and bath, there is a park in back of the house, a creek too. Nice setting, also is close to Portland, If you don&apos;t drive, there is a walk to the bus.Central location, we live on a private drive, so parking is good. Is a nonsmoking house, no pets. I would like to fill the room asap with a nice person, keeps space clean, who is respectful, and communicates well, and also does their own thing. If you are looking for a place, please text me with first name so I can put name with phone#. I can also send pics from my phone. contact me asap if interested, the room is open now. up late, and up early, call soon to discuss details.503 443 0 three 79, hope to hear from you soon\n    "
    },
    {
        "title": "Sellwood room 650",
        "href": "/mlt/roo/4830029467.html",
        "time": "2015-01-02 21:36",
        "price": "$650",
        "neighborhood": " (se sherrett st. and se and 9th ave)",
        "postBody": "\n        Two rooms a sun room and bedroom for $950 and a single bedroom for $650.<br>\nIt is a beautiful 3 bedroom home with spacious kitchen, basement, and washer and dryer. Located next to Share it Square, Sellwood River Front Park, Springwater Corridor multiuse path, parks and Oak Bottom Wildlife Refuge. It is a walkable town with a grocery store four blocks away and many other shops and boutiques. There are many bus lines less than ten blocks away such as the 70, 33, 19 and 35. The Orange Light Rail Line should be functional this summer which goes directly to downtown Portland and PSU campus.\n    "
    },
    {
        "title": "MEN&apos;S SOBER HOUSING",
        "href": "/mlt/roo/4829973327.html",
        "time": "2015-01-02 21:32",
        "price": "$450",
        "neighborhood": " (se portland)",
        "postBody": "\n        MEN&apos;S SOBER HOUSING\n    "
    },
    {
        "title": "OHSU Med rotations and Interns furnished Room",
        "href": "/mlt/roo/4795447673.html",
        "time": "2015-01-02 21:16",
        "price": "$750",
        "neighborhood": " (PSU OHSU Southwaterfront)",
        "postBody": "\n        Furnished  large room in 100 year old /Victorian house with view <br>\nDec 15th Available<br>\nFeels like an 1940s rooming house<br>\nLinens provided with weekly changes<br>\nClean and quiet<br>\nClose into Downtown, PSU and OHSU tram<br>\n <br>\nPark your car and walk to OHSU and Downtown<br>\nWalk across new Gibbs pedestrian walkway to tram and trolly, OHSU lower campus<br>\nWell connected to the city with many buses within 3 blocks <br>\nBath in hall with tiled shower <br>\nUtilities included in rent... with wifi. fridge in room<br>\nSit on the front porch and get a zen look at the river<br>\nInternational/Graduate Students welcome<br>\nSouth Water Front view<br>\nHardwood floors<br>\nLots of light<br>\nLarge closet for lots of storage<br>\nVery small food warming area with tea and coffee/microwave/toaster oven<br>\nGreat neighborhood feeling. <br>\nSafe to walk at night<br>\n<br>\n$750 per month w/ over 3 months stay<br>\n$800 per month under 3 months <br>\n<br>\nI am an artist with studio on first floor.  So come visit or have your own privacy.  <br>\n<br>\n<br>\n<br>\n\n    "
    },
    {
        "title": "clean&amp;sober room 4 rent,everything is included",
        "href": "/mlt/roo/4830012289.html",
        "time": "2015-01-02 21:10",
        "price": "$400",
        "neighborhood": " (5735 se mall st portland)",
        "postBody": "\n        we have a one bedroom clean and sober room for rent,the rent is $400 a month,with a $25 nonrefundable clean and sober fee,the house has six bedrooms,big kitchen,washer dryer in the basement, and a big back yard.<br>\nthis is a clean and sober OXFORD HOUSE,and is for MEN ONLY. Current occupants are mature, 50ish with long term sobriety.  available now.<br>\nPlease call Jim ,leave message and phone#\n    "
    },
    {
        "title": "Furnished Room in South Tabor House",
        "href": "/mlt/roo/4829984993.html",
        "time": "2015-01-02 20:34",
        "price": "$500",
        "neighborhood": " (SE 71st and Division)",
        "postBody": "\n        Furnished room in house in South Tabor. Single mom and four year old son. Private bathroom, (though my son will need to take baths in the bathtub,) wireless internet, between Powell and Division. Walking distance from Mt. Tabor, 7-11, Pizzicato, pho, Rain or Shine coffee, Steakadelphia, and Warner Pacific.<br>\n<br>\nI prefer a student. Someone quiet that won&apos;t have a lot of guests. My son sleeps before 8:00, so you would need to be quiet after that.<br>\n<br>\nWe have a mean fat cat and my boyfriend occasionally stays over. Other than that I work full time and my son goes to daycare during the week. <br>\n<br>\nYou can of course use the kitchen, laundry, and TV.  <br>\n<br>\n(I am guessing on square feet.)\n    "
    },
    {
        "title": "room ready NOW in my se home very quiet,ALL utilities included &#x1F600;",
        "href": "/mlt/roo/4817632797.html",
        "time": "2015-01-02 20:30",
        "price": "$500",
        "neighborhood": " (117th and Powell)",
        "postBody": "\n        1100$ moves you in today,, move in cost covers 1st mo and 150$ deposit also utilities to get acclimated ..no guests and no drugs this is a quiet older workers type..,420 is ok....all utilities included .rent per month will be a special right now for only 500$ a mo<br>\n<br>\nIn the home my wife and i &quot;owners&quot;...,older construction type guy in the basement,..that&apos;s all at the moment someone is holding one of my rooms until the 11th...older computer type guy<br>\n<br>\nMax line only 5/10 min away &#x1F600;<br>\nBuses right out the door and on the corner 30 feet away &#x1F600;<br>\nRight next to Safeway &#x1F600;les then 500 feet<br>\nWasher and dryer in home!!&#x1F600;<br>\n<br>\nNo weirdos,No couples,...just a normal and quite individual looking for a room more on the short term side..can furnish the room for a little extra $...thanx for looking folks...<br>\n<br>\nEmail me and ill get right back to ya thanx!\n    "
    },
    {
        "title": "Female room to share with another female",
        "href": "/mlt/roo/4829974351.html",
        "time": "2015-01-02 20:20",
        "price": "$350",
        "neighborhood": " (Barbur boulverd)",
        "postBody": "\n        Clean and sober place: I am a female student I do not drink alcohol  and do not do drugs . I am  looking for a female with the same  frame of mind wanting to share my place , there is wireless in this place, utilities included,washer and dryer in the apartment building. Very close to Pcc 3 mile, ohsu  4 mile , Lewis and Clark college 1/4 mile , psu 2 mile  and sumner college 1 mile.   10 min to downtown portland . Across street from Fred myer Burlingame and terwilliger shopping complex on barbur blvd. Run errands at stores , shops,salons,ace hardware , bank,Starbucks and post office. Bus 1,12 , 38 ,39 ,65,65x,94 go outside the place . Price is 350 per month including utilities for shared room .if you reply by email don&apos;t forget to leave your phone number else it will go to junk mail , thank you.\n    "
    },
    {
        "title": "Are you an awesome roommate?",
        "href": "/mlt/roo/4829941945.html",
        "time": "2015-01-02 19:55",
        "price": "$470",
        "neighborhood": " (downtown)",
        "postBody": "\n        The Location:<br>\nThis gem is downtown, slightly off-center to it all. It&apos;s near PSU. When you&apos;re hanging out downtown and miss the last bus, it&apos;s not that far of a walk.<br>\n<br>\nThe Apartment:<br>\nThere&apos;s two bedrooms. But it&apos;s small. Like, REALLY small.  And there&apos;s pretty much no storage. Unless you count the dishwasher. The building has really thin walls and you can hear EVERYTHING from everywhere. Which I guess could be a good thing, if you&apos;re into that sort of thing. But the building is locked so it keeps most of the riffraff out, except for the ones which actually live in the building. There&apos;s bike storage in the basement and a little laundry room too. <br>\n<br>\nThe Situation:<br>\nI&apos;ve been without a roommate for a while, and it&apos;s been pretty okay most of the time, except when I find myself talking to the walls. But, oh, the woes of losing your job. So I&apos;m looking for someone to occupy this space with me. The rent is $940 which means YOUR half is $470 (I like mathing). Water is included in that. Heat is also included, and it&apos;s steam heat that makes the apartment REALLY hot. The windows stay open pretty much the whole year. The gas for the stove is also included. We pay for internet (currently around $60 total, but I&apos;m open to getting cable or something else), and electric, which ranges around $50 for two people, depending on how good you are at remembering to turn off the lights. Ideally, I&apos;m looking for a move in around February, but that&apos;s flexible. It&apos;s $45 to apply (I need to check on that). And the deposit is equal to rent ($470). There may be some flexibility with the deposit as well. <br>\n<br>\nYou:<br>\nA person with minimal baggage, physically and figuratively. (seriously, this place is small.) Not passive-aggressive. Not the type to bring the ENTIRE bar home. Able to pay your share of bills. Able to have some type of pleasant interaction. I&apos;d like to feel comfortable with the person I&apos;m living with, maybe we can grab drinks, dinner, a show, or some other type of entertainment (Holy moley, I now have the need to add that &quot;some other type of entertainment&quot; is not a euphemism. I don&apos;t need your &quot;services&quot;). I don&apos;t want to feel like I&apos;m living with a stranger. I don&apos;t really care if you smoke, as long as it&apos;s not inside. 420 friendly. Have common sense AND common courtesy. I don&apos;t have any age or height requirements. Mostly just don&apos;t be psychotic or a perv. <br>\n<br>\nPets? <br>\nApparently the building does allow pets. But, like I said, it&apos;s really small, and I&apos;m weary of saying yes to pets because I don&apos;t feel like it&apos;s fair to them. Also, we&apos;re on the 2nd floor and the windows really do stay open all the time (unless you are a wizard that can figure out how to maintain a decent temperature in here). That said, I&apos;m all about flexibility and adaptability. <br>\n<br>\nMe:<br>\nI&apos;m 31, look like I&apos;m about 19, and act like I&apos;m 64. Which means I don&apos;t feel the need to party all weekend every weekend, and I don&apos;t particularly like LOUD NOISES, unless we&apos;re listening to good music or watching good movies. I&apos;m losing my job in a couple weeks, but don&apos;t worry, I can still pay the rent. It just means I get the pleasure of starting the new year with a new job search! I&apos;m sarcastic, and pretty entertaining if I do say so myself. I like(love) listening to music, and would be down for dance parties with you. I&apos;m super passionate about screen printing, and I&apos;ve got a bunch of equipment currently occupying the free space. I&apos;m finding somewhere else for it, but if you&apos;re into designing/printing and would rather have more of a print shop than a living room (a living print room?), that would be totally cool with me, and I&apos;ll share my equipment with you. <br>\nI&apos;m quiet, and don&apos;t have many people over. I&apos;m a good fatty that works out at 24 hour downtown if you need a gym buddy (it&apos;s a couple blocks away). I&apos;m vegan, but you don&apos;t need to be. Just don&apos;t splash your meat juices all over me and we&apos;ll be cool.<br>\nUgh, I&apos;m more chill and flexible than this ad would have you believe.<br>\n<br>\nOther random stuff:<br>\nI&apos;m more interested in finding the right fit than finding someone fast. I don&apos;t have furniture and kind of like it like that, though I&apos;ve been thinking about making it a little more &quot;homey&quot;. I don&apos;t own a tv, not because I&apos;m against it. If you have a tv to put in the living room, that&apos;s cool. Actually it&apos;s really cool, because then I could hook up my retro duo or plug and play pacman and school you in some retro gaming. My two life mantras are: be excellent to each other (aka treat others the way you want to be treated), and pay attention to what&apos;s going on around you (aka you&apos;re not the only person in the world). <br>\n<br>\nThis is getting really long, so maybe you should just write me, tell me about yourself, your hobbies, your schedule, your favorite music and movies, or whatever you want to tell me about and ask any questions you have. Good luck in your search!\n    "
    },
    {
        "title": "One Room inner S.E Craftsman - $400",
        "href": "/mlt/roo/4822660618.html",
        "time": "2015-01-02 19:42",
        "price": "$400",
        "neighborhood": " (west moreland/Sellwood)",
        "postBody": "\n        The House: <br>\n<br>\n-- Large Craftsman style West Moreland/Sellwood home, with hardwood floors throughout.  Ample kitchen space, sunny dining room and living room, complete with comfy couches and a fireplace<br>\n<br>\n--Some perks include a spacious covered front porch surrounded by gardenspace, herbs, and lots of chilis.  Chickens coming soon!<br>\n<br>\n-- Large basement  with ample storage space - bike hooks, W/D, work benches, and darts!<br>\n<br>\nThe Room:<br>\n<br>\n--The upstairs room is about 11x10, with one window facing to the west.  The room is unique in the house with a huge closet that is about 14 ft deep.  Available Feb 1st<br>\n<br>\nThe Housemates:<br>\n<br>\n-- We are all between 27-30, two females two males, college educated with awesome vocations:  a forestry apprentice (27), a spanish scholar and downtown server (30), a graphic designer (27) and a manufacturer&apos;s rep (30) with a small friendly senior dog<br>\n<br>\n--Everyone here enjoy things like hiking/camping, baking seasonal goodies, conversations about space, rock climbing, pickling things from the garden, and getting together for dinners or drinks on the porch every so often<br>\n<br>\nThe Neighborhood:<br>\n<br>\n--We are right off of McLoughlin in Sellwood/Westmoreland. We are very close to Grand Central Bakery, New Seasons, Tea Chai Te, a 24 hr QFC, Moreland Theater and more. There is easy access to the 99, bus lines 70 and 19, and the Springwater Corrider if you&apos;re a bike commuter <br>\n<br>\nThe Deal<br>\n<br>\n--We are looking for a person with a steady job and steady disposition around our age bracket.  A good sense of humor, who is fairly social, willing to keep fairly tidy, and interested in being part of a home<br>\n<br>\n--The Lease is for 1 year<br>\n--$400 per month, $400 deposit.<br>\n--Utilities average around $100 per month<br>\n<br>\nIf you&apos;re interested, send an e-mail about yourself and we&apos;ll go from there!<br>\n<br>\nThank You<br>\n\n    "
    },
    {
        "title": "-Two Rooms Available SE PDX - Immediate",
        "href": "/mlt/roo/4823627390.html",
        "time": "2015-01-02 19:33",
        "price": "$550",
        "neighborhood": " (SE 52nd/Flavel)",
        "postBody": "\n        2 bedrooms available in a 3 bedroom modern remodeled 1,300 sq ft basement unit with lots of natural light. Three rooms share a bathroom, living area and kitchen. There is also a full size washer and dryer in unit. The kitchen includes refrigerator and dishwasher with granite countertops. The bathroom includes a shower and granite countertop.  Rooms are approximately 11x11 to 12x14 not including roomy closet space.  The rooms are $525 and $550 per month. Rent includes water/sewer and trash pickup. Each room is responsible for 1/3 of electric utility bill in addition to rent. There is use of backyard with patio table and grill and room to garden if you are interested.  Plenty of Parking is avialable on street.<br>\n<br>\nCredit and references will be reviewed for prospective tenants.  <br>\n<br>\nMove in will require first month rent plus 1 month for security deposit. Rent and utility will be prorated if move in is during the month. <br>\n<br>\nHome is located near Springwater Corridor Trail and walking distance to bus lines. 5 minutes to Reed College, Sellwood and Woodstock, as well as the new Tacoma Max station opening next year. <br>\n<br>\nEmail with questions and if interested a walk through can be arranged. <br>\nThank you.<br>\n\n    "
    },
    {
        "title": "room for girls!",
        "href": "/mlt/roo/4825233378.html",
        "time": "2015-01-02 19:32",
        "price": null,
        "neighborhood": " (ne portland)",
        "postBody": "\n        I HAVE A ROOM FOR RENT (for girls only) IN NICE AND CLEAN THREE BEDROOM AND TWO BATHROOM HOUSE. RENT ONLY FOR GIRL THE RENT IS 500$ PER BED ROOM.<br>\nYOU WILL HAVE YOUR OWN GARAGE <br>\nYOU HAVE TO BE DRUG FREE, NONE SMOKER AND NOT PARTY GIRL BC THIS HOUSE IS NOT FOR PARTY ,DO WHAT EVER YOU WANNA DO OUT SIDE.<br>\nYOU HAVE TO CLEAN AFTER YOUR SELF AND DONT LEAVE DISHES IN THE SINK.<br>\nIF YOUR INTRESTED FEEL FREE TEXT \n <a href=\"/fb/pdx/roo/4825233378\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    "
    },
    {
        "title": "shop / art / music space",
        "href": "/mlt/roo/4829931902.html",
        "time": "2015-01-02 19:29",
        "price": "$450",
        "neighborhood": " (se holgate)",
        "postBody": "\n        basement apartment in house. no running water at the moment. private bath  - use run-off water for toilet. <br>\n<br>\nvery secure, private entrance. you can live there if you want but i dont know if i can legally rent it for that purpose because of the water situation. make noise / mess? no problem. <br>\n<br>\nconcrete floor. plenty of storage space. nice area, low crime. month 2 month lease. please no hard drugs or heavy drink. background check for person on person crimes and theft. $400 to $500 per month, depending on how much yard and storage space you need.<br>\n<br>\npeace<br>\n\n    "
    },
    {
        "title": "PRIVATE ROOM &amp; BATH, OFFICE GOURMET KITCHEN",
        "href": "/mlt/roo/4829925037.html",
        "time": "2015-01-02 19:22",
        "price": "$800",
        "neighborhood": " (north portland)",
        "postBody": "\n        Looking for a student or someone who works part-time or full time away from the house.<br>\nNewer, 2 story 1900 Sq. Ft. home. Very nice private bedroom with private bath located upstairs. Office available downstairs and lovely Gourmet Kitchen. Completely or partially furnished.<br>\nN Portland location near N. Greeley and Lombard. Quiet. Near all transportation. <br>\n1\\2 Utilities plus rent.<br>\n<br>\nPlease contact me by email and tell me about yourself!\n    "
    },
    {
        "title": "SUPER QUIET Neighborhood ROOM FOR RENT 97220 Roommate Needed",
        "href": "/mlt/roo/4794067283.html",
        "time": "2015-01-02 19:18",
        "price": "$550",
        "neighborhood": " (Parkrose / Maywood)",
        "postBody": "\n        ROOM FOR RENT<br>\n<br>\nAvailable NOW!<br>\n<br>\nSUPER QUIET, TRANQUIL, QUAINT, SUPER PRIVATE LOT in a very safe neighborhood.<br>\n<br>\nIt is a clean one-level house built in 2007, in the beautiful Parkrose/Maywood neighborhood - near the corner of NE 102nd Ave &amp; NE Halsey Street.  Close to Fred Meyers and WinCo Foods grocery stores. The home is 6 blocks away from a NE 102nd Ave bus-stop if you take public transportation - TriMet - Very close to the MAX Station&apos;s Park &amp; Ride.  Outdoor parking on street is available.  Very close to I-205 and I-84 on/off ramps.<br>\n<br>\nShared Bathroom, Washer/Dryer, Central Heating/Air Conditioning, WiFi Internet, DirecTV in living room, reverse osmosis water filtration system!<br>\n<br>\nWe have an outdoor charcoal grill, just bring your own charcoal and meat!<br>\n<br>\nWe currently have 3 professional easy going room-mates residing here right now.  <br>\n<br>\nIt is a very professional and SAFE QUIET FAMILY ATMOSPHERE.<br>\n<br>\nInternational Students Welcome!<br>\n<br>\nNo Pets, No Smoking Inside or Outside, No Drugs, No Drama, No Disrespect, No Medical Marijuana/420, No Partying, No Fun!!!<br>\n<br>\nCriminal Background Check, Employment or Student Verification Required.<br>\n<br>\nNO APPLICATION FEE <br>\n<br>\n6 months minimum rental agreement required.<br>\n<br>\nFully Refundable Security Deposit is equal to one month&apos;s rent.<br>\n$100 non-refundable cleaning fee (carpet cleaning service).<br>\n<br>\n    $550 / month with less than 1 year old Queen Bed + Frame (cost $1500)<br>\n    $525 / month with no furnishings<br>\n   + $25 / month for garage parking<br>\n<br>\n+ shared monthly utilities (Electric, Gas, Water, Internet, DirecTV, Garbage)<br>\n<br>\nPlease tell us a little bit about yourself, contact information, and when you would like to schedule a viewing!<br>\n<br>\nAvailable NOW!<br>\n<br>\n<br>\n++++++++++++++++  Thanks for looking!  ++++++++++++++++++++++\n    "
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4822910645.html",
        "time": "2015-01-02 19:18",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET Friendly.<br>\n <a href=\"/fb/pdx/roo/4822910645\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    "
    },
    {
        "title": "Lovely Room Available in Alameda",
        "href": "/mlt/roo/4829918431.html",
        "time": "2015-01-02 19:14",
        "price": null,
        "neighborhood": " (ne portland)",
        "postBody": "\n        I&apos;m looking for a roommate for my bungalow in the Rose City/Alameda neighborhood. The house is in a quiet area with many wonderful restaurants and cute shops only a few blocks away.  Public transportation is close and it&apos;s a quick drive to the city center. The available bedroom is on the main floor, with windows that overlook a lovely backyard and garden. It&apos;s an open space where a large bed and work area can fit comfortably together, and it has a roomy closet as well.  There&apos;s also a full bathroom next door that&apos;s primarily for your use. You can set up the room with your own furniture, or you can use the furnishings I currently have in the space.<br>\n<br>\nA little about me: I&apos;m in my thirties, professional, and recently divorced. I have two elementary age boys and they live with me about half of the time. We can get busy with their events, but when I have some free time I spend it running, biking, and hanging with my family and friends. The boys and I also enjoy some time just relaxing at home. As a roommate, I&apos;m fairly social and enjoy those incidental chats in the kitchen. I&apos;m respectful of your space and I try to keep the common areas in the house reasonably tidy.<br>\n<br>\nI&apos;m looking for a female roommate who&apos;s a non-smoker with a steady job and stable lifestyle. I love pets, but I&apos;m looking for someone without them right now. Rent is $575, plus 1/3 of utilities.  If you think we might be a good fit, send me an email with a little about you (including a phone number) and we&apos;ll go from there. Looking forward to hearing from you!<br>\n\n    "
    },
    {
        "title": "N.E. PDX $450 Room Huge Garden :)",
        "href": "/mlt/roo/4829907684.html",
        "time": "2015-01-02 19:02",
        "price": "$450",
        "neighborhood": null,
        "postBody": "\n        We have one  room available now. Washer and dryer situated in the basement, shared bathroom, kitchen and living space.<br>\n<br>\nThe house is an ADORABLE 1917 bungalow, located in the Woodlawn neighborhood. The house itself is constantly being updated and is a source of pride, including the huge yard, which is a gardener&apos;s dream. <br>\n<br>\nWe&apos;re an all-inclusive household, orientation, color, etc. doesn&apos;t matter. What does matter is that you are clean, respectful, good communicator, able to pay rent/bills on time, and a responsible and optimistic person. Drug free, occasional drinks and outdoor smoking okay. We are happy, health minded, occasional meat eaters . We lean toward the intentional community side of life and everyone joins in on gardening projects and general helpfulness. This is a must, if you are reclusive and not a giver this is not the place for you. Nature lover is a MUST! The ideal person would find joy in being helpful with projects in the garden. Not just eating the fruits of our labors but actually getting your hands dirty and planting and maintaining the garden. Several ways to contribute your time -- money, gardening, cooking meals or cleaning the house. We work together and truly enjoy our space.  Loving atmosphere that is more like family and drama free. <br>\n<br>\nCurrently we are two males and one female. We are looking for one individual, no pets. Two very mellow cats also reside here.<br>\n<br>\nMove in requirements: $450 per month + &#xBC; utilities(usually around 90/month). One month deposit required before move in.<br>\n<br>\nInterested? Send us a short note about yourself, when you are looking to move, and any questions you might have.\n    "
    },
    {
        "title": "Room available in SE easygoing household",
        "href": "/mlt/roo/4829905892.html",
        "time": "2015-01-02 19:00",
        "price": "$550",
        "neighborhood": " (Division/South Tabor/FoPo...)",
        "postBody": "\n        We have a room open in our house! It is large, has hardwood floors, gets a lot of sun, and has a big closet.<br>\nThe house is a 4bd/2ba with yard, garage, laundry, hardwoods, lots of room to garden, and happy, positive, easygoing people living in it.<br>\n<br>\nCurrent Housemates:<br>\n2 female, 1 male. Mid-late 20s. <br>\nGrad students/employed/musicians that are busy, rarely home, quiet at night... We are all very relaxed, tolerant, easy to live with, friendly, fun, outdoorsy, genuine, conscientious... The house is peaceful/no drama, clean, and mostly quiet, and we would love it to stay that way! Home should be a sanctuary.<br>\nThe area is great - lots of good food and bars nearby. Easy commute into downtown. On several buslines (9, 14, 71. 5 min walk to the 4). A few blocks from bike street (clinton). Close to Tabor.<br>\n<br>\n1 well-behaved dog and 1 cat live here. <br>\nNO MORE PETS (possible exception of a cat that has lived peacefully with other cats and dogs in the past)<br>\n<br>\nYou:<br>\nEmployed or living the student loan life<br>\nOne person - no couples please<br>\nMid-20s to 30s<br>\nMellow and have an easy time getting along with others<br>\nRelatively clean in shared spaces (but not neurotic)<br>\nLike pets but do not have any of your own<br>\nDon&apos;t bring the party home (occasional dinner parties, game nights, and study groups happen, but it&apos;s mostly a quiet house)<br>\nHappy without TV in the living room<br>\nCan discuss conflict/concerns without being passive aggressive<br>\n<br>\nBonus points if you are a grad student (any NCNM or OCOM people out there?) or if you have a green thumb<br>\n<br>\nMove-in by Feb 1. Sooner is possible<br>\n<br>\n$550 + utilities<br>\n<br>\nMove in = 1st month + $500 deposit<br>\n\n    "
    },
    {
        "title": "Room for Rent",
        "href": "/mlt/roo/4829894773.html",
        "time": "2015-01-02 18:49",
        "price": "$550",
        "neighborhood": " (se portland)",
        "postBody": "\n        A possible room for rent for 1 person in a 3 bedroom 2 bath house with a fenced yard.  The house is nice and clean.  Looking for the right person to rent a room in my home. The person must be a professional and mature.  Also the person needs to be tidy. No smoking, drugs, no storage, lite alcohol use ok.   No  animals and no at home employment.  $550 per month +1/2 of utilities.  Will need to pay a refunable $200 cleaning deposit and $125 non-refundable security deposit at move in.<br>\nAbout me:  I like to kayak, bike ride, x-country ski and am a professional.<br>\n<br>\nThe ideal situation:  The person lives out of town and needs a place to stay during the week and goes home on the weekends.  In that case the rent and utilities will be less.\n    "
    },
    {
        "title": "Luxury Modern URBAN Willamette Riverfront Private Room for Rent",
        "href": "/mlt/roo/4804131464.html",
        "time": "2015-01-02 18:41",
        "price": "$800",
        "neighborhood": " (Downtown Portland)",
        "postBody": "\n        AVAILABLE JANUARY 14TH.  I am renting out one quiet room in a stunningly beautiful, updated Townehome.  This townehome is truly the best of both worlds.  You get the feel of an open suburban sprawl with it&apos;s vast open spaces looking out onto the river, yet it&apos;s virtually right in the downtown area.  The home is located in an ideal location, right on the banks of the willamette river and just on the edge of downtown Portland.  The riverwalk is right in your backyard which has a boat marina, launching for kayaks, shops, restaurants and bars all at your doorstep.  The riverwalk contiues and turns into the Willamette River Trail which extends right through downtown Portland.  You could walk from the house along the riverwalk and go to the Saturday market, which is held every Saturday on the banks of the Willamette river.   <br>\n<br>\nhttp://www.travelandleisure.com/articles/americas-coolest-river-walks/8<br>\n<br>\nThe Tonwhome is up to date as of 2013 with all new stainless steel appliances, plush, upscale furnishings and tasteful decor.  The home comes equiped with wifi and comcast tv.<br>\n<br>\nFor a parking space in the parking structure, it&apos;s an extra $150 per Month in addition to the monthly rent.  There is also a max train line that runs right next to the housing community, just a hop, skip and a jump away. <br>\n<br>\nI&apos;m looking for a friendly, clean and responsible roommate, a male or female is welcome.  I am new to the Portland area so I&apos;d really love to have a roommate who is open to hanging out and exploring the city together perhaps.  I enjoy kayaking, hiking, shopping, singing karaoke, going to concerts, going on walks, watching movies, eating vegan food and trying new things.  <br>\n<br>\n<br>\nRent: $800 / Month<br>\nScreening Fee: $30<br>\nDeposit: $400 (Refundable)<br>\nUtilities: $100 / Month (Flat Fee)<br>\nOptional Parking Space: $150 / Month<br>\n<br>\n<br>\n<br>\n<br>\n\n    "
    },
    {
        "title": "Housemate wanted: bedroom + shared artist studio for rent",
        "href": "/mlt/roo/4829873501.html",
        "time": "2015-01-02 18:27",
        "price": "$700",
        "neighborhood": " (Eliot neighborhood)",
        "postBody": "\n        I am a thirty-year-old woman seeking a housemate to share my two-bedroom space (1,020 sq. ft.) in a close-in old-Portland duplex. $700 monthly rent includes shared internet, water/sewer, and garbage; tenants split gas and electricity. <br>\n<br>\nThe two-bedroom apartment is on the main floor with covered porch and sunny deck, bright kitchen with breakfast nook, living room, single shared bathroom, and built ins. Large, private bedroom is in the rear of the house, with brand new carpets, closet and two windows (southern exposure). Full unfinished basement includes washer/dryer and tons of storage. The apartment is currently semi-furnished--I travel light and I&apos;m used to sharing my space with others, so I don&apos;t have a full apartment worth of furniture. There&apos;s plenty of room for you to spread out.<br>\n<br>\nThe Boise-Eliot house, originally built in 1914, is located on NE Morris, right off of a frequent-service bus route (6) and on a bike route. We are within walking distance of the Wonder Ballroom, N Williams neighborhood and New Seasons with easy access to transit station. Biking time is 12 minutes to downtown, 7 minutes to Alberta Arts and 5 minutes to Mississippi. We share amenities with very cool upstairs neighbors (a couple and two cats), including blazing-fast internet, off-street parking spot, fenced backyard with raised garden beds and a fire pit. <br>\n<br>\nThe separate finished artists&apos; studio, complete with skylights, will be shared by three people (including you).<br>\n<br>\nMore about me: I am professional writer with a day job that keeps me out of the house three days a week. I also work from home two days a week, so my living space is important to me. I like to keep it clean, cozy, and quiet. I tend to go out to meet friends rather than I bringing people home, but I do like to open my space to visiting friends and family now and then and I&apos;m happy for you to do the same. I am a veggie-friendly omnivore, and I do cook with animal products (including meat) from time to time. I&apos;m looking for a reliable housemate with good past experiences living with others, who has compatible preferences in a living space.<br>\n <br>\nNo more pets, please. I have a cat who is sweet and medium grumpy, so I am looking for a housemate who is pet friendly. No smoking, 420 no problem.<br>\n<br>\nAvailable Feb 1 (Jan move-in date negotiable). Move-in costs include first month&apos;s rent and $700 security deposit. Must pass landlord&apos;s screening process, including credit check. Contact me with more info about you, including your timeline.\n    "
    },
    {
        "title": "(FILLED) Room Available in Spacious Alberta Craftsman House Jan. 15th",
        "href": "/mlt/roo/4829857894.html",
        "time": "2015-01-02 18:22",
        "price": "$660",
        "neighborhood": " (NE 13th and Alberta)",
        "postBody": "\n        **The room has been filled, I am just reposting to respond to emails because the original ad had expired. Thanks!**\n\nWe have a room in our nice big craftsman house on 13th and Alberta that will be available on January 15th. Read on for details.<br><br>\n\n<b>The Room:</b><br><br>\n- Warm and bright and measures roughly 11&apos; by 12&apos;<br>\n- Large walk-in closet that is roughly 3&apos;-6&quot; x 6&apos;-0&quot; (and very tall), with plenty of shelving for your storage needs.<br> \n- Two doors -- one locking door to the seldom used front entrance, and one to a short hallway that leads to the shared bathroom.<br><br>\n\nThe room is one of two bedrooms on the main floor and those two bedrooms share one bathroom off a common short hallway. The bathroom was recently refinished and has a built-in cabinet for storage. <br><br>\n\n<b>About the House:</b><br><br>\nSpacious and open, with plenty of room for the four people that will be living here. The atmosphere is relaxed and on the quiet side. We might have a small dinner party every now and then, or a game night, but other than that we tend to be pretty low-key. Most importantly, we are very clean and we like to keep the house the same.<br><br>\n\nThere is a very good vibe to the house right now and I would love to find someone that would compliment that. We all have our separate lives, but we usually spend a little time in the evenings chatting, catching up, or maybe watching the occasional movie. <br><br>\n\n- Location: Perfectly located one block off of Alberta and all the excitement that awaits there: Tin Shed, Alberta Co-op, Radio Room, last Thursday, art galleries, ice cream shops, boutiques, etc. Whole Foods and New Seasons are just down the street.<br>\n- Very spacious - Three fully-finished floors, 2800+ square feet of finished living space<br>\n- Three full bathrooms for four people total<br>\n- Three living rooms - one on each floor<br>\n- Fenced in front yard with patio and sitting area, fire pit and garden<br>\n- Veggie beds in the back yard for veggies<br>\n- New, insulated windows<br>\n- High-efficiency gas furnace<br>\n- Efficient Wood Pellet stove to keep warm with during the winter<br>\n- New Energy-Efficient appliances (washer, dryer, refrigerator, dishwasher)<br>\n- Finished basement with storage area<br>\n- Newly Remodeled in most areas<br>\n- Refinished Hardwood floors<br>\n- Low utility bills<br>\n- Updated, large, open kitchen with modern stainless-steel appliances<br>\n- Large two car garage<br>\n- High-speed wifi<br><br>\n\nI own the house and I live on the second floor. My name is Theo, I am 32 years old, male, and I am currently in school at NCNM studying naturopathic and Chinese medicine. In my free time I like to rock climb or spend time outside, which coincidentally is usually when I should be studying. Hannah is 26 and splits her time working for a food-based website and being a full time student. Amanda is 26(ish) and lives in the basement. She works for a bakery and is gearing toward going back to grad school.<br><br>\n\n<b>About You:</b><br><br>\n- Clean! This is important. We like a clean house and we are looking for someone that is more than the typical tidy person. Ideally you would be one who freely contributes to the regular cleaning, plant watering, etc that goes on in living in a house.<br>\n- Financially stable.<br>\n- Employed, or, at least having something regular to occupy your days away from the house.<br>  \n- I&apos;m sure that there&apos;s something else that i&apos;m missing. Maybe you&apos;ll think of it for me. <br><br>\n\n<b>The Details:</b><br><br>\n\n- Move in: January 15th. <br>\n- Rent: $660/month. <br>\n- Refundable deposit: $660 (due at move-in). <br>\n- Utilities: 1/4 of the utilities, which usually averages out to be around $85/month over the course of the year. <br><br>\n\n- No pets (Sorry!)<br>\n- No smokers (Cigarettes or 420). We have sensitivities to smoke.<br>\n- No couples. The space is just not set up well for a couple.<br><br>\n\nRental references are not required, they are certainly appreciated :) If you are interested, shoot me an email or give me a call at \n <a href=\"/fb/pdx/roo/4829857894\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nand let me know about yourself.<br><br>\n\nI will remove this ad when the room has been filled. Thank you for looking and good luck room hunting!<br><br>\n\n<b>Pictures:</b><br><br>\nHigher resolution images that craigslist won&apos;t allow me to post directly:<br><br>\nhttps://www.dropbox.com/sh/s6lmuaqcp5fatbm/AACX7vo5q--RcPLztYoO88Nua?dl=0<br><br>\n\n    "
    },
    {
        "title": "ROOM FOR RENT $500 a mo.",
        "href": "/mlt/roo/4816835199.html",
        "time": "2015-01-02 18:15",
        "price": "$500",
        "neighborhood": " (TROUTDALE)",
        "postBody": "\n         Room for rent available Feb 1st. Furnished or unfurnished, (bed, dresser, and tv) your choice. Room has a walk in closet. Your own bathroom.  Close to M.H.C.C. great for student. Nice quiet neighborhood. No pets. Basic cable and all utilities included. $500.oo per month plus a $100.oo non refundable deposit. If interested reply to CL mail\n    "
    },
    {
        "title": "Rec&#xE1;mara lista con biles incluidos",
        "href": "/mlt/roo/4829844210.html",
        "time": "2015-01-02 17:59",
        "price": "$420",
        "neighborhood": " (Se powell y 168av)",
        "postBody": "\n        Se renta una rec&#xE1;mara en casa $ 420 con biles incluidos en la &#xE1;rea de se portland ,esquina con powell blv y 168th va.<br>\na una persona responsable, honesta , limpia , con trabajo completo, libre de drogas etc. <br>\nRecamara esta lista para moverse este momento . Para m&#xE1;s informaci&#xF3;n comunicarse con Jaime \n <a href=\"/fb/pdx/roo/4829844210\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    "
    },
    {
        "title": "22nd/Hawthorne/Division private bedroom in Spacious Clean Home",
        "href": "/mlt/roo/4825425779.html",
        "time": "2015-01-02 17:55",
        "price": "$715",
        "neighborhood": " (Colonial Heights/Ladds Edition)",
        "postBody": "\n        Available for move in December 27th, 2014. <br>\n<br>\nThe available room is big enough to be a studio apartment.  It becomes available for move-in this December 27th 2014.  I will run this add until I fill the room, so if you&apos;re reading this then the room IS available.  This house is an elegant 1927 structure, the people who live here are wonderful and you couldn&apos;t ask for a better location.  This available room is the best in the house it&apos;s getting the hardwood floors refinished, new light fixture and new paint before the next move-in, so you will be moving into an incredibly pristine space. The bathroom with one other person  <br>\n<br>\nThe current renters: All women in their 20&apos;s, who are professionals or in school. They are all active, friendly and respectful of people&apos;s privacy. No drama. The owner: is a Male, Professional, in his 30&apos;s who manages house operations, house cleaning, repairs and etc. He lives in a separate part of the house. <br>\n<br>\nThe home is fully furnished with a comfortable dining room table for dinner guests, a TV room with 52&quot; TV and surround sound for movies, and BBQ and outside patio for grilling and out door dining.   The room for rent is a large room with plenty of closet space and a faint view of downtown Portland. The room has hardwood floors and shares a bathroom with 1 other roommate. This room is ideal for someone who wants to live in a large, spacious home in a fantastic location on a reasonable budget. :) <br>\n<br>\nNo pets.<br>\n<br>\nNo Smoking.<br>\n<br>\nRequired 9 month lease.  Bills are around $90(summer) -$145(winter) per month.  Note: The bills are less in the summer.<br>\n<br>\nIf you are looking for a sanctuary to call home, and open communication/drama free shared housing situation, we&apos;d love to hear more about you. Please respond to this email with more about you, your work schedule, what you do for fun and what you are looking for in a living environment. The room is available December 27th.  If you are interested you will be contacted by the home owner,<br>\nThank you!!<br>\n<br>\nMatthew<br>\n<br>\n<br>\n<br>\nKEY WORDS TO DESCRIBE THE HOUSE: <br>\nHawthorne/Division home, 22 streets from the river, close to restaurants, shops, groceries, public transit, shopping, wi-fi enabled coffee houses, High Speed wi-fi House, 4000 sqft home, 6 bed 3 bath, clean, kind, outgoing and respectful housemates.\n    "
    },
    {
        "title": "Bedroom and bath in newer home! Female Only",
        "href": "/mlt/roo/4817321913.html",
        "time": "2015-01-02 17:49",
        "price": "$550",
        "neighborhood": " (NW Portland)",
        "postBody": "\n        Our house was built in 2005 and is located in the prestigious NW Portland Forest Heights neighborhood near NW Miller Rd. and Cornell. This spacious home is a mere 15 minutes from downtown Portland! We now have one bedroom with a private full bathroom available! Sorry, no pets, men, couples or smokers please. The monthly rental rate is only $550 plus $75 to cover the cost of the utilities.\n    "
    },
    {
        "title": "Great Roommate Wanted - Private Bathroom $575 Inc Utilities",
        "href": "/mlt/roo/4820245888.html",
        "time": "2015-01-02 17:39",
        "price": "$575",
        "neighborhood": " (Mall 205/Gateway Area - 92nd and Burnside/Glisan)",
        "postBody": "\n        Hello!<br>\n<br>\nThank you for looking at my ad for a roommate!<br>\n<br>\n(For quickest reply, please send me your email address and I will send you an email about me and the apartment and what I am looking for in a roommate. This communication is going thru craigslist and my info/email won&apos;t go thru craigslist, so I need your email address please.)<br>\n<br>\nThoughtful, considerate roommate wanted. Clean, quiet, all the usual, right? LOL I am a FABULOUS roommate, sensitive to the needs of others, and I am looking for a roommate who is equally conscious and courteous.<br>\n<br>\nI have a 2 bedroom, 2 bath upstairs apartment to share. Bedroom is large with your own private full bathroom with tub and shower. Complex is small (about 30 units) and very quiet, in a residential neighborhood at 92nd between Burnside and Glisan.<br>\n<br>\nIn the pictures, I am showing you my bedroom and bathroom but yours looks the same.<br>\n<br>\nSorry, no pets of any kind.<br>\n<br>\nI am a self-employed female. Rent ($575 including utilities) is month-to-month and available now.<br>\n<br>\nEmail me for more information.<br>\n<br>\nRemember: For quickest reply, please send me your email address and I will send you an email about me and the apartment and what I am looking for in a roommate. This communication is going thru craigslist and my info/email won&apos;t go thru craigslist, so I need your email address please.<br>\n<br>\nThank you!<br>\n<br>\nVictoria<br>\n\n    "
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4823793954.html",
        "time": "2015-01-02 17:38",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY.  <br>\n <a href=\"/fb/pdx/roo/4823793954\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    "
    },
    {
        "title": "clean,simple,quite room avail now all utilities incl..500 a mo",
        "href": "/mlt/roo/4827254054.html",
        "time": "2015-01-02 17:33",
        "price": "$500",
        "neighborhood": " (se Portland)",
        "postBody": "\n        1100$ moves you in today,, move in cost covers 1st mo and 150$ deposit also utilities to get acclimated ..no guests and no drugs this is a quiet older workers type..,420 is ok....all utilities included .rent per month will be a special right now for only 500$ a mo<br>\n<br>\nIn the home my wife and i &quot;owners&quot;...,older construction type guy in the basement,..that&apos;s all at the moment someone is holding one of my rooms until the 11th...older computer type guy<br>\n<br>\nMax line only 5/10 min away &#x1F600;<br>\nBuses right out the door and on the corner 30 feet away &#x1F600;<br>\nRight next to Safeway &#x1F600;les then 500 feet<br>\nWasher and dryer in home!!&#x1F600;<br>\n<br>\nNo weirdos,No couples,...just a normal and quite individual looking for a room more on the short term side..can furnish the room for a little extra $...thanx for looking folks...<br>\n<br>\nEmail me and ill get right back to ya thanx!\n    "
    },
    {
        "title": "Large room near Williams &amp; Mississippi",
        "href": "/mlt/roo/4829777656.html",
        "time": "2015-01-02 17:29",
        "price": "$850",
        "neighborhood": null,
        "postBody": "\n        My current roommate is moving out of the house and in need of someone to take his place. <br>\n<br>\n3 bedroom (+ separated bar room, Laundry room, and finished basement) 2 bath 2700sq foot 1897 Victorian. In the heart of North Portland right behind Tasty N Sons, New Seasons Grocery, walking distance to Mississippi Ave and a short bike ride to downtown. The room for rent is large with a small closet and a huge open space apart from the bed space for extra storage or to make into a larger closet. It currently fits a king bed! The bathroom downstairs will belong to the renter of the room and is used as a guest bathroom as well. I posted pictures of the exact room and bathroom.<br>\n<br>\nExtras about the house:<br>\n&#x2022;\t2 fireplaces<br>\n&#x2022;\tFull size washer and dryer -- purchased 2 years ago<br>\n&#x2022;\tCable and High speed blast internet ready -- HBO and Showtime as well<br>\n&#x2022;\tLarge fenced in yard<br>\n<br>\nRent:<br>\n$850 plus Utilities. Utilities are Billed every 2 months<br>\n<br>\nWhy such a great price for this place and only 1 roommate? <br>\n&#x2022;\tLandlord is a co-worker of mine who now lives in SF. I have been renting from him for the past year and he is great to deal with. He uses the guest room sometimes when he is town -- 2 days a month at most. <br>\n<br>\nWho you will be living with?<br>\n    &#x2022; 27 year old female mobile project manager with a 2 year old Australian Shepard mix who spends her day sleeping and keeping guard. (The picture with the dog on the roof is her) . I spend my days at work and after work -- dog activities, dinner, workout. I am an extrovert who also enjoys her alone and quiet time. I build puzzles and lego sets in my spare time, but can also go out and enjoy the night out.<br>\n<br>\nYou:<br>\n&#x2022;\tEmployed and able to pay bills/Rent on time<br>\n&#x2022;\tDon&apos;t mind getting some love from a dog when you get home<br>\n&#x2022;\tKeeps common areas clean<br>\n&#x2022;\tWould be great to find someone who wants to hang out outside of the home or just chat here and there- not a requirement<br>\n&#x2022;\tEasy going and making their way in this world<br>\n<br>\nSo much more extras to mention- this really is a great home. Would like to chat with anyone interested in the place. Move in would be in February.\n    "
    },
    {
        "title": "Lovely funished room in cozy artist&apos;s bungalow",
        "href": "/mlt/roo/4829802840.html",
        "time": "2015-01-02 17:22",
        "price": "$475",
        "neighborhood": " (Gateway)",
        "postBody": "\n        Gateway near beautiful Glendoveer golf course walk trails, lovely  furnished room, wall to wall carpet, curtains, blinds, lamps, dresser, wifi, large walk in closet, full sized bed, available end January. Quiet friendly location near all transportation, complete with off street parking, big private fenced back yard with gardens, fruit trees, some storage.  Seek quiet, mature female preferred for long term commitment (6 mo-year) in artist&apos;s bungalow.  Rent: $475/mo, first, security deposit plus utilities. Car helpful. Please no smoking or addictions.  Cannot work with out of country deals---fyi.<br>\n<br>\n\n    "
    },
    {
        "title": "Roommate wanted",
        "href": "/mlt/roo/4829726613.html",
        "time": "2015-01-02 17:17",
        "price": "$450",
        "neighborhood": " (Gresham - near MHCC)",
        "postBody": "\n        The condominium is a two bedroom, one bathroom second story flat.  Everything is furnished except for your bedroom.  It is located just south of the Mt. Hood Community College campus.  Dogs are OK.  However, I have allergies to kitten dander.  It is located along three bus lines.  I am a college educated male who owns the unit.  Female roommate is preferred.  Rent includes utilities (water, garbage, sewer, electric and insurance).\n    "
    },
    {
        "title": "CUARTO DE RENTA",
        "href": "/mlt/roo/4827252609.html",
        "time": "2015-01-02 17:01",
        "price": "$475",
        "neighborhood": " (lombard and greeley)",
        "postBody": "\n        f&#xE1;cil acceso al freeway,tiendas y bancos,restaurantes<br>\n<br>\nincluye luz ,internet,agua y basura<br>\nse compartira la casa con 3 hombres.    deposit 475 refundable $50.00 NO REFUNDABLE cleaning fee.disponible ahora\n    "
    },
    {
        "title": "Room for Rent - Utilities &amp; Wifi FREE",
        "href": "/mlt/roo/4829747467.html",
        "time": "2015-01-02 16:54",
        "price": "$300",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        We are a bunch of easy-going, responsible, geeky guys and gals mostly in our 30&apos;s.  Our &quot;Lincoln Bedroom&quot; is currently move-in ready and features cool-looking wood walls with plenty of windows.  Here&apos;s everything our house has to offer:<br>\n<br>\nFree utilities and wifi<br>\nWasher and dryer in the basement<br>\nShared kitchen with 3 refrigerators, a stove, and plenty of cupboard space<br>\nSpacious, furnished living room and dining area<br>\nLocation is right next to the bus line that runs along Holgate<br>\n<br>\nJust fire off an E-mail if you&apos;re interested.  Thanks!<br>\n\n    "
    },
    {
        "title": "Potential room for rent (queer/trans friendly)",
        "href": "/mlt/roo/4829768213.html",
        "time": "2015-01-02 16:53",
        "price": "$964",
        "neighborhood": null,
        "postBody": "\n        Due to unfortunate circumstances, our current roommate situation isn&apos;t working out. We&apos;ve given our roommate until the middle of the month to either find employment or other means to make the rent for next month. We&apos;ve decided to start looking for other roommates now, just in case that doesn&apos;t happen. <br>\nWe live in a comfortable 2 bedroom apartment, 1 bath, washer, dryer and dishwasher included. Rent is $964 including w/s/g. We pay electricity and internet through PGE and Century Link respectively, and split the bills evenly among everyone. The lease lasts until July, but we&apos;re willing to negotiate time commitments. <br>\n<br>\nWe are Aspen and Ani, partners of 6 years, we&apos;re both 22 and Genderqueer. We have a cat, he&apos;s older and hella chill. We are respectful, radical, compassionate, understanding, and we value open communication and honesty. We would like a roommate who is respectful of others and shared spaces, who can pay bills on time and do agreed upon chores without being prompted, and who would be down to hang out occasionally. We&apos;re looking for someone Queer identified, or at the very least well educated on queer/trans issues. We&apos;re willing to negotiate accommodating a couple, but given this is a smaller apartment, one roommate is preferred. We&apos;re 420 friendly and partake often, so let us know if that will be an issue. <br>\n<br>\nIf this sounds like a good fit for you, shoot Aspen a text/email! We&apos;d love to meet and chat. Please do not call, as I don&apos;t normally answer calls from unknown numbers. Availability for move-in is flexible, just let us know what works best for you. We&apos;d rather not rush into anything, and would love to get to know you before settling everything.<br>\n<br>\nAni: I work part time at a boarding and grooming business in town, but I&apos;m perpetually looking for my next adventure. When I&apos;m not working I like to spend my time making art, hanging out with friends, listening to music, watching moves/shows and animal videos, and fighting the systems. I&apos;m pretty honest and forward. I like to clean and I keep a tidyish apartment. I&apos;m a pisces, introverted, and I have depression. I&apos;m seeing a therapist, and constantly working to be the best me that I can be. <br>\n<br>\nAspen: Genderqueer/Transfeminine, Gemini, INTP. I&apos;m currently going to school at PSU, and working as a event tech for PSU and UO Portland. I sing in PSU&apos;s A Cappella group, The Green Note, and sing all the time. I&apos;m also a huge tech head, so I play a lot of video games and spend a lot of time on my computer/phone/various devices. If you need some technological troubleshooting, I&apos;m all yours. I&apos;m friendly and love good conversation, whether about social issues, TV/movies, music, technology, and everything in between. I like to laugh, and do so often. I&apos;m also kinda forgetful, but I&apos;m working on it.\n    "
    },
    {
        "title": "Gay male looking for house mate",
        "href": "/mlt/roo/4829766068.html",
        "time": "2015-01-02 16:51",
        "price": "$525",
        "neighborhood": " (gresham)",
        "postBody": "\n        Gay male wants house mate for north Gresham Apt 2 bedroom ask for info $525 plus half on bills\n    "
    },
    {
        "title": "room &amp; semi-private bath",
        "href": "/mlt/roo/4820546232.html",
        "time": "2015-01-02 16:30",
        "price": "$425",
        "neighborhood": " (Hazelwood/Montavilla)",
        "postBody": "\n        I have a room to rent with a separate bath in my home near Ventura park. If you have a car there is lots room for street parking &amp; it is near Gateway Max train.  My requirements are the following - male or female makes no never mind however,....no pets....non-smoker.....and this is not a party place.  I am a respectful &amp; easy going person who has spent some time to make a nice clean home on a quiet neighborhood street &amp; hope to find a like-minded mature roommate.  All utilities will be split evenly between us.  <br>\n<br>\nI will request references &amp; proof of some longer terms of employment &amp; will do a credit check.  I also will need a $100 cleaning deposit. I look forward to meeting with you.\n    "
    },
    {
        "title": "$675 large room close-in North",
        "href": "/mlt/roo/4829738444.html",
        "time": "2015-01-02 16:29",
        "price": "$675",
        "neighborhood": " (N Gantenbein @ Skidmore)",
        "postBody": "\n        I have a master bedroom (13&apos;x14&apos;ish) in my side of a duplex available for rent. There is a large porch, an open living room, shared bath and kitchen. Bamboo Hardwood floors in main area. Washer and dryer on site.<br>\n<br>\nI have a cat, a wonderful rescue pit, and fowl (chickens, a quail, and a partridge). I teach at an elementary school in Hillsdale. I&apos;m not looking to be BFFs with whoever moves in. Polite and considerate, but it&apos;s not important that we kick it on the frequent. I&apos;ve been in this house for 7 years, you would sign a rental agreement with me not the property owner. house is surrounded by Trimet (4, 6, 24, 44, 72, yellow MAX) and is easily a 10-15 min bike to Powell&apos;s or PSU. Right off the Williams Ave strip mall, 6 blocks from Mississippi st, 3 blocks south of Alberta. New Season&apos;s is the closest grocery store. Rent is 675 and covers: rent, gas, electric, wifi, and garbage. The water bill will be monthly once this cycle is complete. <br>\n<br>\nYou: be chill and respectful. don&apos;t have more furniture than I do. Pay on or by the 1st of the month, have a job, don&apos;t smoke cigs inside, not a junkie. <br>\n<br>\nRoom is ready to move into now.\n    "
    },
    {
        "title": "Room for rent in 3BD house",
        "href": "/mlt/roo/4829715606.html",
        "time": "2015-01-02 16:25",
        "price": "$550",
        "neighborhood": " (Boise)",
        "postBody": "\n        ROOM<br>\n<br>\n10&apos;x17&apos; room for rent near N Haight &amp; Failing. 2 large windows and a ceiling fan. No closet, but I&apos;m willing to buy a wardrobe that stays with the house or you can bring your own.<br>\n<br>\nRent is $550, plus $120 monthly utilities. $550 deposit upfront plus a $35 background check.<br>\n<br>\nHOUSE<br>\n<br>\nThe house is a 3 bed/2 bath 1907 foursquare. Wood floors, dishwasher, and washer/dryer in the basement. Mississippi and Williams are a couple blocks away and have tons of restaurants and other fun places. 3 blocks to New Seasons. Easy bus service (4 or 44) and bike routes. Netflix but no cable. Sorry, no pets. No smoking. Gardening space if interested.<br>\n<br>\nSharing chores is a requirement, as is keeping common spaces reasonably neat.<br>\n<br>\nROOMMATES<br>\n<br>\nI&apos;m a male engineer in my late 20s and I own/live in the house. I enjoy playing board games, cooking vegetarian food, running, programming, watching British comedies and mysteries, keeping up on world events, and occasional pub trivia.<br>\n<br>\nThe other roommate is in his mid 20s and likes to cook and host themed TV/movie marathons and holiday parties. He&apos;s shy at first but very friendly and talkative after getting to know someone -- especially about films or television, Manchester United, the Oregon Ducks, nerd/pop culture, and screen printed art.<br>\n<br>\nWe&apos;re hoping for a new roommate who likes to join in on the fun or conversation!\n    "
    },
    {
        "title": "All util inc UofP PCC downtown 2story house nice area bus max",
        "href": "/mlt/roo/4829717342.html",
        "time": "2015-01-02 16:17",
        "price": "$425",
        "neighborhood": " (n portland)",
        "postBody": "\n        I have a room that has just become available for rent in a 2 story house lots of room with a few chill easy going roommates. The house is right up by the University Of Portland in N Portland. There is a bus a  block from the house that will take you just down the road to the max. Pcc is 3 miles PSU is 5 miles Swan Island is just a few blocks away. The rent for the first month is only $425 and each and every month after will be regular $495 If you would like to learn more about this living situation please call 503 2o nine 23 o four\n    "
    },
    {
        "title": "Room for rent in Hillsdale home.",
        "href": "/mlt/roo/4829719329.html",
        "time": "2015-01-02 16:14",
        "price": "$600",
        "neighborhood": " (sw portland, hillsdale)",
        "postBody": "\n        I have a room for rent in a house close to Hillsdale/Multnomah Village area. Easy access to PCC if you are a student. I am a 36 yr old male. I have 2 retrievers which are very friendly and loving. House is a 2 bed, 1 bath home. I have a washer and dryer in the garage, and has room for a little bit of storage if needed. Nice backyard with fire pit and garden. Quiet neighborhood and safe.<br>\nI am looking for a clean, drug free, drama free student or whomever. I prefer not having parties at the house but friends once and awhile is no problem. Female or male is fine, no preference. Although students or people that are busy and not sitting around the house all day are preferred.<br>\nI am active. Like to run and take the dogs to the park nearby. I eat healthy and would also prefer someone like minded as well, but not a deal breaker..<br>\n<br>\nEmail me for viewing or any questions you may have.<br>\n<br>\nThanks, and I look forward to hearing from you. :)\n    "
    },
    {
        "title": "Congenial Housemate - Female",
        "href": "/mlt/roo/4821044612.html",
        "time": "2015-01-02 16:04",
        "price": null,
        "neighborhood": " (Interstate Bridge)",
        "postBody": "\n        ONLY Long-Term Prospects (Over a year).<br>\nShare a townhouse centrally-located by the Interstate Bridge.  In an idyllic setting, with public transportation at the door and shopping, downtown Vancouver, Clark College, and many amenities within walking distance. . . the living quarters include a bedroom and adjacent full bath for you (your housemate has the 2nd bedroom and bath); washer/dryer upstairs; high ceilings, both floors; expansive front porch and rear patio; and ample common areas (kitchen, dining and living).  Townhouse is fully furnished EXCEPT for the bedroom; and deposit is in place (housemate has been residing here for several years).  Cleaning chores to be shared!<br>\nCost of lease, all utilities, cable and WIFI is approximately $1550 per month. . . but your share could be subsidized somewhat in exchange for some cooking/cleaning services or even editing services if you have the academic background (your housemate is a writer).  Your cost: $500-$750 range.<br>\nOther:  Prefer no pets but, if an otherwise great compatibility exists, an exception might be made -- it would require, however, a pet deposit.  Housemate offer is extended to intellectually and emotionally-mature female in good health; someone with a reasonable education-culture capable of carrying a conversation; a person financially-solvent, AND a spotless [criminal] background.<br>\nYour host-housemate: a scholarly, mature gentleman with a successful and long professional background in the community now dedicating the third stage of his life to writing.<br>\nIf interested, please reply in an extensive manner stating your preferences. . . and describing yourself.  If you are in a hurry &quot;to rent a place,&quot; your needs and mine are probably incompatible, since my search is for congeniality. . . and finding whether it might exist requires more than just a casual meeting.   <br>\n<br>\n  <br>\n<br>\n\n    "
    },
    {
        "title": "NE Portland Home",
        "href": "/mlt/roo/4824255188.html",
        "time": "2015-01-02 16:00",
        "price": "$1277",
        "neighborhood": " (Near Rock Butte)",
        "postBody": "\n        Available now<br>\n$1277 / 3br 1 bath- 1900ft - NE Portland  Home <br>\n<br>\n<br>\nGreat one level ranch<br>\noff  street <br>\n flag lot  private<br>\n<br>\n<br>\nAvailable: NOW<br>\n<br>\nThis GREAT home is almost 1900 sqft.<br>\n  front room - sunken living room.<br>\nBetween 102nd &amp; 122nd<br>\n <br>\n 3  private bedrooms,<br>\n1 full  private bath, <br>\na large kitchen <br>\nutility area  with washer/dryer. <br>\n2 car garage<br>\nPet Policy:1 cat<br>\n<br>\n Multnomah County<br>\n 9-12 month Lease<br>\nForced air, gas<br>\n<br>\n Tenant responsibilities: lawn care<br>\nAll utilities  in tenant&apos;s name except garbage <br>\nOwner will pay proportional utilities base on days of occupancy per month<br>\n<br>\nOWNER TO OCCUPY master bedroom &amp; bath with different lock but same entrance as tenant.<br>\n Owner will not be using kitchen or any appliances there or washer and dryer.<br>\n Owners few personal belongings will only be in locked master bedroom/bath area.<br>\n Owner does work and visit elderly mother out of town some.<br>\n Details to be included in tenant rental agreement contract.<br>\n<br>\nSchools:Sacramento Primary, Parkrose Middle, Parkrose High <br>\nSmoking outside only<br>\nVehicle Restrictions: Two vehicles in garage<br>\nQuite large asphalt front area &amp; driveway<br>\nProperty fenced on all sides\n    "
    },
    {
        "title": "Short term rental room",
        "href": "/mlt/roo/4829696325.html",
        "time": "2015-01-02 15:56",
        "price": "$600",
        "neighborhood": " (94th &amp; Glisan)",
        "postBody": "\n        Short term room available in our house.  The room is somewhat small but you would have the living room for hanging out as well.  Full kitchen access, share bathroom with one other person, washer/dryer available at no cost, cable TV, Wifi, off street parking.  <br>\n<br>\nThe house is located near Gateway Transit Center, bus lines, shopping, restaurants.  The room has a bed and some shelving, TV in the living room.  Perfect for a short stay in Portland, or a transition to a new house.  The rent is $150 per week and we ask for a 7 day notice that you are moving.  There is a $100 deposit that will be refunded in full if there is no damage and you have given 7 days notice.<br>\n<br>\nWe do allow pets but require you to clean up after them and keep them tidy.  If your pet is well behaved you will not need to keep them confined to your room.  We have no pets so there will be no problems with our animals liking yours.  We do like pets.<br>\n<br>\nWe eat and cook meat.  You are free to use the kitchen and our dishes, we ask that you clean up and respect our things.<br>\n<br>\nCall for more details. <br>\n\n    "
    },
    {
        "title": "SE RENTA CUARTO",
        "href": "/mlt/roo/4829677525.html",
        "time": "2015-01-02 15:42",
        "price": null,
        "neighborhood": null,
        "postBody": "\n        Rento uno de los cuartos de mi departamento a una mujer responsable,y sin vicios. Somos una familia de solo 3 personas,si desea mayor informacion llame al sig numero <br>\n <a href=\"/fb/pdx/roo/4829677525\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n Gracias\n    "
    },
    {
        "title": "The S.S. Midwest wants YOU! One bedroom close-in SE",
        "href": "/mlt/roo/4829663508.html",
        "time": "2015-01-02 15:32",
        "price": "$461",
        "neighborhood": " (Buckman)",
        "postBody": "\n        Howdy potential roommate! <br>\n<br>\nAre you looking for a clean, funky, convenient household with a googly-eyed cat? Search no more- this could be the winner! Our 4 bedroom 2 bath house is in need of 2 new roommates to move in FEBRUARY 1st. Two of the current roommates will be staying put and we are looking for roomies who want to help make a nice community to live in. Ya&apos; dig?<br>\n<br>\nAbout Us:<br>\nLady 1- age 28, has lived in the house for the past 4 years, is deeply passionate about glitter, and a graduate student at PSU. Between school, roller derby, work, and shenanigans, I tend to stay pretty busy. I&apos;m friendly with a sense of humor, put nutritional yeast on 95% of my food, and cried the first time I saw The Matrix.<br>\n<br>\nLady 2- age 20, has lived in the house since August, and a women&apos;s studies major at PSU. Outside of school she also works in a chocolate shop and stays busy. Has an awesome sense of funky style and passion for scrambled eggs. Owns multiple David Bowie posters and sews her own dresses!<br>\n<br>\nThe Cat- the best thing since sliced bread. Indoor cat, Captain of Snuggling, still mystified by the Laser Mouse, very cross-eyed, sometimes wears a tie. <br>\n<br>\nThe House: two-level old Portland house (upstairs and finished attic) with a bathroom on each floor. Lots of cupboards and counter space in the yellow kitchen, fully carpeted, washer and dryer fo&apos; free, large storage area in basement, close to Colonel Sumner park and all the tasty places on Belmont/ Hawthorne, and on the 15 bus line. The living room gets great sunlight and has an attached porch. This room will be fairly empty after 2 current roomies move out, so bonus points if you have a COUCH! We want to make this space a comfortable living spot for people to read, have a friend over, or hang out in- we&apos;re not a party house, but enjoy being social. We don&apos;t currently have a TV, but would be open to it! The hallways tend to be a bit chilly in the winter time, but electric heating keeps our rooms, kitchen, living room toasty. Also, no more pets please (unless its a fish or caged for you to take care of).<br>\n<br>\nThe Room- 10&apos; x 12&apos;, 8.5&apos; ceiling, 3 electric outlets, on first floor. Does not have a closet, but you will have ownership over the (close) back stairway landing area. You could easily set up a tension rod for hanging items here, put a chair with reading lamp, extra storage, painting easel, or something of the sort. There is one large ceiling to floor west facing window which keeps the room quiet and warm. <br>\n<br>\nThe Numbers- Feb 1st move-in, rent is $461 each and we share utilities (wifi and PGE) ranging from $15-30ish. It&apos;s safe to approximate $500 a month. Rent is currently month to month and the landlord will ask us to sign a 6 month lease together once we confirm we can all live well together :) He&apos;s a pretty great guy!<br>\n<br>\nYOU- are awesome! We know you&apos;re out there.....you can keep your room as messy as you please, but need to respect the communal spaces. Do your dishes, don&apos;t leave buckets of slugs laying around, enjoys high fives, be an adult. Pays rent and utilities on time, queer friendly, 420 friendly (very occasionally), and are just friendly in general. We&apos;d prefer a 1 person who is active with their own things in life, but cares about the folks they live with. The kitchen and living room have space for your items- remember, bonus points for that couch!<br>\n<br>\nSo what do you think? If you&apos;ve made it this far and we sound like a good match, let&apos;s set something up. Please respond to this email with the name of your favorite restaurant in the subject line so we know you&apos;re not a robot. Thanks!<br>\n\n    "
    },
    {
        "title": "Medium-sized room in Reed College area!",
        "href": "/mlt/roo/4829662059.html",
        "time": "2015-01-02 15:31",
        "price": "$600",
        "neighborhood": " (close-in SE)",
        "postBody": "\n        Hi craigslist! My current roommate is in the process of moving out/breaking the lease and I thought I&apos;d start trying to scout out a new roommate! <br>\nSo here&apos;s the scoop: Medium sized room, good natural light, built in closet and personal heater. <br>\n-Shared bathroom and kitchen.<br>\n-Big living room with lots of natural light <br>\n-Pet friendly (though I believe it&apos;s a $300 security deposit)<br>\n-$600 a month plus utilities (we only pay for electric, so utilities run about $40-60 depending on the season)<br>\n-Fantastic location! Right on Holgate, about five blocks from Starbucks and Trader Joe&apos;s. Near Woodstock, Sellwood and Reed College. <br>\n<br>\nAbout me:<br>\nI am a 19 year old female student/nanny/house sitter extraordinaire. I have been living in Portland for about a year and a half now and I am loving it! I go to PCC and am currently on an Oregon Transfer pathway (hopefully transferring to PSU to study psychology!)<br>\nI love to walk/explore new places, read, draw, knit (though I haven&apos;t in a while), hike, camp, eat ice cream and sleep. I have an awesome boyfriend who will probably spend a good amount of time at the house, but seriously he&apos;s awesome. My work schedule is kind of all over the place at the moment but that is subject to change in the near future. I&apos;m a bit of an introvert with an extroverted personality. It&apos;s pretty awful actually, haha. <br>\n<br>\n***Anyway, here&apos;s what I&apos;m looking for ***<br>\n-Female, around my age (18-23) <br>\n-Reliable source of income<br>\n-Willing to take over current lease and possibly stay for another round (if all goes well)<br>\n-Someone who loves cats (I will be cat sitting for my mom for a couple months. His name is Tuxedo and is such a love, I don&apos;t see how anyone could dislike him, cat person or not) so no pet allergies, please!<br>\n-Someone who loves to talk about astrology, philosophy and the human condition for hours and hours on end <br>\n-Someone to drink wine and watch Gilmore Girls or Criminal Minds with<br>\n<br>\nAnd that&apos;s about it!<br>\nReply to this if you think we&apos;d get along. Facebook link or something of the sort along with your message would be pretty cool. <br>\nHappy new year!<br>\n-Izzy <br>\n<br>\nPS - What&apos;s your sign? ;)\n    "
    },
    {
        "title": "Roommate to share with 3 $550 utilities included.",
        "href": "/mlt/roo/4829642311.html",
        "time": "2015-01-02 15:17",
        "price": "$550",
        "neighborhood": " (SE Portland (woodstock-reed))",
        "postBody": "\n        Looking for 1 person to share 4 bedroom 2 bath house with 3 others, (two males, one female) on a month to month basis, but open to longer terms. Room available is 8&apos;x14&apos; with a walk in closet &amp; 3 north facing windows. The house is conveniently located 1 block from Trader Joe&apos;s on 39th. Rent is $550.00, includes all utilities, &amp; wireless high speed internet. I am looking for someone with no pets, no kids, either a student or has a job. Someone who is neat and respectful of other roommates. Our preference is for absolutely no smoking inside, no drugs or heavy alcohol usage. If you do smoke there are two porches where you can hang out on and have a beer or a cup of coffee. We are 420 freindly, respectful, absolutely no drama.<br>\n<br>\nThe room will be available Feb 1, but it may be available sooner if that is necessary. Normal terms, first and last, plus $200.00 damage/security deposit. <br>\n<br>\n If you are interested call, text or email.<br>\n\n    "
    },
    {
        "title": "Top floor corner apartment room for rent",
        "href": "/mlt/roo/4829640541.html",
        "time": "2015-01-02 15:16",
        "price": "$775",
        "neighborhood": " (sw portland)",
        "postBody": "\n        I have a beautiful huge 1200+ sqf top floor corner apartment in SW Downtown Portland!!! A couple minutes walk to PSU with an amazing view and all hard wood floors spacious living room, dining room, and kitchen higher then high ceilings extra long tub *perfect for baths!<br>\nHuge windows in all the rooms <br>\nThe room for rent has it own private entry to the bedroom from the hallway <br>\nRent is 850 which includes Rent  water and trash WiFi and electricity<br>\n<br>\nMyself I&apos;m going on 25 next month, I&apos;m very into interior and fashion I am a very clean person, I like to keep my house that way as well I work retail and don&apos;t mind having a quite place sometimes. I love to cook &amp; bake I am looking for someone to fill in my roommate spot who&apos;s moving in a few weeks.<br>\n<br>\nIf interested please write me telling me about yourself and I can answer any questions as well\n    "
    },
    {
        "title": "Room for rent in lovely home with creative individual",
        "href": "/mlt/roo/4829632440.html",
        "time": "2015-01-02 15:10",
        "price": "$750",
        "neighborhood": " (se portland)",
        "postBody": "\n        Hey there house hunters! My name is Rachelle and I am looking for someone to share my home with. I am a florist and an artist that is spiritually connected with the earth and I&apos;m looking for someone who can foster open communication, enjoy living together as a household, and pay their bills on time. Here&apos;s some details: <br>\n<br>\nThe house:<br>\nIt&apos;s the upstairs unit of a duplex in SE portland on 41st and Holgate, pretty much super close to woodstock (an awesome up and coming neighborhood!) and easy to transit to Hawthorne, Belmont (about 10 minutes via the bus line two blocks away). It is also two blocks from Trader Joe&apos;s. The kitchen/living room are hardwoods and the rest is carpet. There is an awesome balcony overlooking OHSU and a rad city skyline that is great potential for summer hangs. There is a front yard and a fenced in backyard with raised garden beds. The downstairs tenant is a writer lady who loves to kayak and pretty much is really quiet and does her own thing. There is a basement for storage and has a washer/dryer that we share with the other lady (who rarely does laundry). I am halfway through a year long lease that i signed with my previous roommate who decided to move out. There is 6 months left on it. The landlord would be open (and probably stoked) to extend the lease although I do plan to travel this summer. There is plenty of shared space that I am open to redecorating/ideas/furniture (I have a bit, just not a couch). There is one bathroom that is pretty large and has a tub. I get ready in my room a lot so this would not be an issue. The kitchen is large and has LOTS of counterspace. The living room gets great natural lighting! The room is 12x12 with a spacious closet and a window. It would rent for 750, unless you are a couple then it would be 800.<br>\n<br>\nAbout me:<br>\nMe: I work at a local health food store called New Seasons Market as the Floral Department Manager, have a solid steady income, and always get free food! I&apos;m a vegan, not a crazy one (I eat eggs sometimes from super happy chickens from a friend&apos;s yard) and I love to cook and bake and am open to all eating habits. Things that make me happy include, but are not limited to, plants n flowers, cats, baby animals, good food and good cider, biking hiking and camping, as well as photography and different forms of art makin. I&apos;m originally from southern california, but have lived in portland for 5 years and love love LOVE it! I also snowboard and skateboard frequently so am pretty much always going on adventures of all sorts. I am clean and tidy, but not a neat freak or anything like that. I&apos;m not ultra social as in i keep my friends close but don&apos;t really party or anything like that. 420 friendly of course. Also, I like dancing, but who doesn&apos;t? <br>\n<br>\nYOU!: <br>\nAre employed full time, loving, kind hearted, open to new things, and can keep a clean house. I am by no means a neat freak, but clean the house once or twice a week to keep it tidy. I am open to couples especially, although I&apos;d charge an extra 50 dollars making the room $800 to make up for additional storage space throughout the house as well as sharing the bathroom with an extra person. I would love to have someone in the house who is around my age (in their late 20s or early 30s) who enjoys similar things as me. The house is too small to accommodate children or dogs unfortunately. <br>\n<br>\nFeel free to shoot me an email and we can see if it&apos;s a fit! Thanks for reading, and happy hunting!!\n    "
    },
    {
        "title": "Big bedroom in large house my Scott",
        "href": "/mlt/roo/4829606025.html",
        "time": "2015-01-02 15:08",
        "price": "$600",
        "neighborhood": " (Se foster)",
        "postBody": "\n        I have a room open in my house big house lookin for low key person room is very big with nice viewers three big windows first and last months rent down upon move in house has front load washer and dryer hot tub off street parking wireless internet cable ready in room fire pit 70 led tv in living room rent covers utilities cable box extra close to max and bus lines sorry no pets or partners one person room email or call <br>\n <a href=\"/fb/pdx/roo/4829606025\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nfor more info room 625 a month close to bus and max lines room open Now first and last down on move in\n    "
    },
    {
        "title": "Big bedroom in large house my Scott",
        "href": "/mlt/roo/4829611356.html",
        "time": "2015-01-02 15:05",
        "price": "$600",
        "neighborhood": " (Se foster)",
        "postBody": "\n        I have a room open in my house big house lookin for low key person room is very big with nice viewers three big windows first and last months rent down upon move in house has front load washer and dryer hot tub off street parking wireless internet cable ready in room fire pit 70 led tv in living room rent covers utilities cable box extra close to max and bus lines sorry no pets or partners one person room email or call <br>\n <a href=\"/fb/pdx/roo/4829611356\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nfor more info room 590 a month close to bus and max lines room open Now first and last down on move in\n    "
    },
    {
        "title": "rooms for rent bridlemile",
        "href": "/mlt/roo/4829608997.html",
        "time": "2015-01-02 15:04",
        "price": "$500",
        "neighborhood": null,
        "postBody": "\n        Renting two bedrooms $500 each close to downtown dus stop\n    "
    },
    {
        "title": "1br- Move-in ready furnished bungalow (Inner SE)",
        "href": "/mlt/roo/4829612914.html",
        "time": "2015-01-02 15:03",
        "price": "$525",
        "neighborhood": null,
        "postBody": "\n        Available Jan 8th: simple, furnished room in a wonderfully cozy, home :)<br>\n<br>\nHouse: My home was built in 1924 by a relative of Meriwether Lewis. . . beautiful Mahogany built-ins, hardwood floors and classic front porch. Fully updated kitchen and bathrooms, perfect entertaining patio with fire pit, BBQ and garden. I live on the main floor where there is one bedroom and bathroom. The rented rooms are upstairs with a shared, brand new bath.<br>\n<br>\nRoom: Upstairs 11&#xD7;12 with a walk-in closet. Furnished with IKEA Malm bed: full size, with matching night stand. (birch color) Floors are pine and walls are painted with Devine paint &quot;Filbert.&quot; (peaceful and neutral color) <br>\n<br>\nLocation: Between Powell and Holgate close-in. There is a coffee shop and pub on this street and all the shops and cafes you could hope for just north on clinton/division/hawthorne. This is a very walkable/bikable area: I LOVE it!! <br>\n<br>\nMe: I am a 35 year old professional living a happy, full life. I&apos;m friendly and social but not home much. I&apos;m chill about most things; keep a fairly clean house and would ask that common areas be kept this way. I believe in straight-forward (but kind) communication. I work in energy efficiency so would ask that you be mindful of energy. (we even have solar power! :) My other housemate is 30, she is a delightful and kind lady who works with children and is home more than me.<br>\n<br>\nThe new housemate: I&apos;m a straight shot to PSU and a half mile from Reed so if you are looking to get off campus but not too far, this might be ideal. . .everything is furnished. I want kind, responsible, relatively mature (emotionally) housemate. Having friends over is fine but definitely no crazy parties. No smoking in the house or drugs of any kind. I do not have pets and prefer it this way but if you have a fish, we can talk :) I want to live with nice courteous people, no drama just simple. <br>\n<br>\nUtilities $100<br>\n<br>\nLet me know if you have questions or would like to visit more.<br>\n<br>\nCheers, <br>\nHolly :)<br>\n<br>\nPS living room has more modern decor, that pic is a little old<br>\n<br>\n\n    "
    },
    {
        "title": "= Beautiful bedroom with private bathroom/Living room =",
        "href": "/mlt/roo/4829576125.html",
        "time": "2015-01-02 14:56",
        "price": "$530",
        "neighborhood": " (Portland)",
        "postBody": "\n        Beautiful bedroom with private bathroom/Living room <br>\nBeautiful bedroom with private bathroom/Living room <br>\nLarge fenced in back yard with fruit trees and enormous garden space. <br>\nOne room for rent in a beautiful four bedroom.<br>\nThere are ample shared space and laundry machines in the house. <br>\nThe rental includes a bedroom with a private living room and bathroom. <br>\nThe living room has giant windows that let in lots of sunlight. <br>\nBetween the bedroom, private bath &amp; living room, there is approximately 400 square feet of personal living space.<br>\nIt&apos;s a short walk to bus lines 48 and 50. Outside of rush hour, it&apos;s a fifteen minute drive to downtown.<br>\nSome social gatherings are known to happen on the main floor but it typically isn&apos;t a loud party house. <br>\nFeel to reach out and we can put together a day and time to see the place and meet the roommates.<br>\nWe have a great relationship with our landlord and management company. \n <a href=\"/fb/pdx/roo/4829576125\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    "
    },
    {
        "title": "Wanted housemate - 2 blocks from Mississippi Ave - 91 Walkscore",
        "href": "/mlt/roo/4829596692.html",
        "time": "2015-01-02 14:53",
        "price": "$782",
        "neighborhood": " (Mississippi &amp; Shaver)",
        "postBody": "\n        Looking for a third housemate for our abode two blocks from Mississippi ave.<br>\n<br>\nAbout the house:<br>\n- Two blocks from Mississippi ave<br>\n- Walkscore of 91<br>\n- 3 bedroom/1.5 bath<br>\n- Backyard with enough room for summer barbecues<br>\n- Rent is usually $810-$830 after utilities. Sometimes more in winter.<br>\n- No pets<br>\n<br>\nAbout the room:<br>\n- Small-medium sized room with closet<br>\n- Will update with pictures/dimensions when home<br>\n<br>\nAbout housemate #1:<br>\n- 27 year-old male<br>\n- Passions include music, people, travel, rock climbing<br>\n- Works making iOS apps for a startup<br>\n- Medium cleanly factor<br>\n- Possesses deep fondness for burritos<br>\n<br>\nAbout housemate #2:<br>\n- 27 year-old male<br>\n- Passions include internet, satisfying coffee table arrangements, making things<br>\n- Works making mobile phone software<br>\n- Medium cleanly factor<br>\n<br>\n<br>\nShoot me an email with as much info about yourself as possible. Extra points if you include a link to your Facebook or other online identity.<br>\n<br>\n-Dylan\n    "
    },
    {
        "title": "2 Rooms For Rent $500 each",
        "href": "/mlt/roo/4821438062.html",
        "time": "2015-01-02 14:47",
        "price": "$500",
        "neighborhood": " (99th Division)",
        "postBody": "\n        2 rooms for rent in SE Portland (99th Division). Conveniently located right next to bus stops, max line, freeway, shopping, and more. 3 bedroom house. Looking for a clean and courteous housemates. Available parking right on property. Quiet dead end street. $500 + $50 utilities per room per month.\n    "
    },
    {
        "title": "NE Alberta Arts",
        "href": "/mlt/roo/4824770085.html",
        "time": "2015-01-02 14:39",
        "price": "$700",
        "neighborhood": " (18th &amp; Alberta)",
        "postBody": "\n        Hello all, my name is Ray I am a single 33 year old male. I work as a commercial construction superintendent. I live here right off Alberta in a very comfortable home. Minute walk to groceries,bars, restaurants. Simply a great place to live. I have a room available and the house as a whole as it will just be me living here as well. I don&apos;t have a preference whether you are male or female. I just ask that you are clean and respect personal things. The rent includes wifi and utilities. Please contact me if you are interested.\n    "
    },
    {
        "title": "Roommate needed in NE! $550+utilities",
        "href": "/mlt/roo/4829582434.html",
        "time": "2015-01-02 14:38",
        "price": "$550",
        "neighborhood": " (1726 NE 66th Ave #98)",
        "postBody": "\n        Hi all! My name is Maija (pronounced Maya), I am 29, female, and in need of a new roommate.  I live in a 3bdr townhouse in NE Portland on the edge of the Hollywood district with my well behaved dog and two cats. The apartment is two stories, with the bedrooms and bathroom on the second floor. I have designated the third bedroom as the cat/catch all room :). Downstairs includes the living room, kitchen and dining room, which I would like to use as an art space as well. Rent is $550+utilities, which seem to run no more than $100 (water, gas, electric, internet).  I work nights, am friendly, outgoing, laid back, a bit ridiculous, and have a good sense of humor. I don&apos;t party much but do like going out; I like to keep home my calm, happy abode. I am looking for someone who is financially responsible, loves animals (you can have one cat, but I can&apos;t take on any more than that) and is willing to do a background check if need be. I have had some unfortunate roommate experiences in the past and would like to avoid a repeat. Email me and let me know if you are interested! The room is available now.\n    "
    },
    {
        "title": "Room in cozy St. John&apos;s home for Young professional/student",
        "href": "/mlt/roo/4829570481.html",
        "time": "2015-01-02 14:37",
        "price": "$525",
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Hey there!<br>\n<br>\nWe are looking for a female student/young professional to rent our spare bedroom starting in the month of December.  We are just a few blocks from downtown St. John&apos;s where you can find many restaurants, bars, coffee shops, and boutiques. We are really close to Columbia Blvd for easy access to I-5 or 84. You can go over the St. John&apos;s bridge and get on hwy 30 or head on Germantown road to get to Beaverton/Hillsboro. Todd and I both work in Vancouver and it&apos;s only a 15 min drive. If you&apos;d like to be close to the university of Portland we are just a 5min drive away. <br>\n<br>\n Here is a little about us! Todd is a school counselor and I&apos;m a teacher. (My name is Erin) Todd is 31 and I am 28(both of us are from the Midwest). We are both pretty active. We are just getting into white water kayakinpg which has been really fun.  Todd snowboards and I like to ski. We both love to drink beer :) We are friendly, fun loving people. We have a cuddle monster of a dog named Angus. Unfortunately Angus has hip dysplasia so we can&apos;t accept any more animals. We are clean people but we understand that life happens.  I have an extra bed that could be used for a bit if needed but we&apos;d like to eventually keep it in the other spare room for guests. Let me know if you&apos;re interested! <br>\n<br>\nWe are looking for just one person to occupy the room. We&apos;ve received several inquiries from couples. We feel that with the space we have, one person would be best.  <br>\n<br>\nGive me a call!<br>\n\n <a href=\"/fb/pdx/roo/4829570481\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nTake Care,<br>\nErin and Todd<br>\n\n    "
    },
    {
        "title": "Inner S.E. Room With Deck /Utilities Included",
        "href": "/mlt/roo/4789612800.html",
        "time": "2015-01-02 14:34",
        "price": "$475",
        "neighborhood": " (Inner S.E. Portland)",
        "postBody": "\n        Great room for the right person.(fun, creative, D.I.Y., bookish, communication, musicians, artists, students,writers,vegans, yogis, meditation, non-smokers, moderation, clean, respectful, employed, ) Older but warm house, garden space,10&apos; by 11&apos; single occupancy only, furnished, has an alcove closet, hardwoods, share updated bathroom, usually quiet, (not all the time!) low traffic household ,there is no storage available for you, there is wi-fi and a washer/dryer, close to bus stops, future Max stop, bike lanes and parks (Second daylight basement bedroom, may be available soon, 10&apos; by 11&apos; single occupancy only, carpet, has an alcove closet, two windows, funky)( Rent covers all utilities, but utilities may be included past a cost point ), (pets? lets talk), $150. move in deposit. We can exchange references.  Thanks!\n    "
    },
    {
        "title": "Furnished Room in great NE, quiet/clean-Concordia/Kaplan/PELA approved",
        "href": "/mlt/roo/4829572650.html",
        "time": "2015-01-02 14:32",
        "price": "$475",
        "neighborhood": null,
        "postBody": "\n        Furnished Room in great NE 21st &amp; Knott area <br>\nCurrently have female ESL student and she&apos;s moving<br>\nHome is me and my daughter <br>\nHave been Approved by Concordia/PELA/Kaplan <br>\n\n <a href=\"/fb/pdx/roo/4829572650\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\nNear Lloyd Center, walk everywhere <br>\nMany bus lines close by <br>\nNo pets and no couples at all\n    "
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4829545771.html",
        "time": "2015-01-02 14:22",
        "price": null,
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Looking for Responsible, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.\n    "
    },
    {
        "title": "room ready NOW! in my quiet home all utilities included &#x1F600;&#x1F600;",
        "href": "/mlt/roo/4816125173.html",
        "time": "2015-01-02 14:17",
        "price": "$500",
        "neighborhood": " (118th and Powell)",
        "postBody": "\n        1100$ moves you in today,, move in cost covers 1st mo and 150$ deposit also utilities to get acclimated ..no guests and no drugs this is a quiet older workers type..,420 is ok....all utilities included .rent per month will be a special right now for only 500$ a mo<br>\n<br>\nIn the home my wife and i &quot;owners&quot;...,older construction type guy in the basement,..that&apos;s all at the moment someone is holding one of my rooms until the 11th...older computer type guy<br>\n<br>\nMax line only 5/10 min away &#x1F600;<br>\nBuses right out the door and on the corner 30 feet away  &#x1F600;<br>\nRight next to Safeway &#x1F600;les then 500 feet<br>\nWasher and dryer in home!!&#x1F600;<br>\n<br>\nNo weirdos,No couples,...just a normal and quite individual looking for a room more on the short term side..can furnish the room for a little extra $...thanx for looking folks...<br>\n<br>\nEmail me and ill get right back to ya thanx!!!&#x1F637;..cats ok only ....!\n    "
    },
    {
        "title": "--//--Spacious studio newly built=Amenities=stainle- One BR --//--",
        "href": "/mlt/roo/4829396859.html",
        "time": "2015-01-02 14:15",
        "price": "$525",
        "neighborhood": " (portland)",
        "postBody": "\n        East twelve lofts is 1 of the newest urban developments in the buckman <br>\nneighborhood.All the things you love about se portland, but with <br>\neasy access to downtown. This state of the art building features <br>\ngorgeous views of the city out of the west facing apartments, <br>\nand a more secluded view of the neighborhood out of the east <br>\nfacing apartments. Each unit includes energy efficient <br>\nappliances as well as a washer/dryer. A community <br>\ncenter with fireplace and rooftop patio grill <br>\nmakes it an awesome entertainment area. <br>\nFitness facilities and garage <br>\nare available too.<br>\nIf you&apos;re interested please text only \n <a href=\"/fb/pdx/roo/4829396859\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\n<br>\n<br>\n\n    "
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4829544794.html",
        "time": "2015-01-02 14:14",
        "price": null,
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Looking for Responsible, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.\n    "
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4829541414.html",
        "time": "2015-01-02 14:12",
        "price": null,
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Looking for Responsible, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.\n    "
    },
    {
        "title": "St. John&apos;s $500 Utilities included",
        "href": "/mlt/roo/4829540466.html",
        "time": "2015-01-02 14:12",
        "price": null,
        "neighborhood": " (st. John&apos;s)",
        "postBody": "\n        Looking for Responsible,  Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.\n    "
    },
    {
        "title": "Room for Rent $500 includes Utilities",
        "href": "/mlt/roo/4829527230.html",
        "time": "2015-01-02 14:03",
        "price": null,
        "neighborhood": " (St. John&apos;s)",
        "postBody": "\n        Looking for Responsible, Male roommate to rent a room in 3 bedroom house. <br>\nNon-smoker, Non-drinker. No Pets. Room size: aprox. 8&apos;10&quot; x 10&apos;4&quot;(plus Closet). Close to bus line and downtown St. John&apos;s. $500 per month All Utilities are included.<br>\nPlease call Sam and leave message if interested.\n    "
    },
    {
        "title": "$350.00 Furnished ROOM FOR RENT",
        "href": "/mlt/roo/4829521280.html",
        "time": "2015-01-02 14:00",
        "price": "$350",
        "neighborhood": " (92nd &amp; NE Sandy)",
        "postBody": "\n        <br>\n <a href=\"/fb/pdx/roo/4829521280\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n   Parkrose neighborhood close to Parkrose Transit Center on NE Sandy. Share utilities and household responsibilities. Security deposit $400.00 Call Randy if interested. Ready now.\n    "
    },
    {
        "title": "Questions to ask when doing shared housing. . .",
        "href": "/mlt/roo/4825571861.html",
        "time": "2015-01-02 13:57",
        "price": "$498",
        "neighborhood": " (nw portland)",
        "postBody": "\n        As I have had more than my fair share of shared housing situations and have --almost- always had excellent luck, I&apos;ve been asked by several friends about renting a place and what they should ask the landlord, look for, talk about, etc. While I wrote this for them, I thought the craigslist community might find it useful as well.   <br>\n<br>\nWhen I first posted this a couple people wrote and said I should add a couple of things.  Those are also included.  Thanks for making the effort to write me.  <br>\n<br>\n1.\tHow long have they been doing this?  Did they just buy this house, rent the apartment (or have these hard times made them take on a renter) and they don&apos;t know the first thing about shared space and letting you do things your way in your own time?  Or have they been doing this for years and realize flexibility works wonders?  The people who&apos;re taking on a renter for the first time are going to be wishing you weren&apos;t there because they miss their privacy.  Exactly how welcome do you think you&apos;ll be?  Don&apos;t be their guinea pig.  Let someone else break them in.  <br>\n<br>\n2.\tAre they charging --you- to do a credit/background check or non-refundable fees?  I&apos;ve recently had people tell me there are people charging a $50 fee to do a &quot;credit and background check&quot;.  Then they call you up and say they rented the room to someone else. That&apos;s a scam -- and, oh, by the way, illegal under ORS 90.295 subsection 7. One guy told me someone tried to get a $100 fee out of him.  In the real world they call that larceny.  In --my- opinion, non-refundable fees, whether they&apos;re cleaning, background, credit check, pet, etc., etc., etc. are just plain crap. And, oh, by the way, cleaning fees paid in advance are also illegal as of 2010 in Oregon (ORS 90.302) Make sure you think about that before you give them any money. And realize if you move out in 3 months because these nickel and dime people are driving you crazy, those fees may be a significant increase in your rent over that time. There are others that charge you if you turn the thermostat above 66 in the winter, $50 extra for internet (Huh?  It only --costs- $40/month for the whole freakin&apos; house!), and one ad that tacked on $100/mo. to the $500 rent for kitchen privileges.  Um, what? Oh, you&apos;re trying to be a rooming house, not a shared living situation. I get it. For the same $$? Yeah, no. <br>\n<br>\n3.\tOther stuff, like basic compatibility -- you know, the born again vegans living with champion barbecuers from Kansas, bible thumpers w/ practicing priestesses of light, and Bush believers with Obama-nation people; that sort of thing. Someone posting a rental wanted you to be gone frequently, only do 2 loads of laundry per week (could you save them up for a couple of weeks and do several all at once?), &quot;be quiet&quot;, no visitors (let alone parties or overnight guests), require you tell them about you FIRST or they wouldn&apos;t respond, etc. Clearly reasonableness goes a looonnng way.  Look for that in the person you&apos;re renting from. You can tell a LOT from what they say and the tone their ad.  <br>\n<br>\n4.\tHow big is the house and room and how many people live there?  You think it doesn&apos;t matter?  There are people up here renting an 11x11 room in a 2,100 sq. ft. house with 2 other adults and no pets.  There are also people up here renting a 10x10 room (20+% smaller - they say it&apos;s large and include the --closet- in those dimensions!!!) with -3- adults one child (and another on the way!), 2 large dogs, and 2 MORE medium sized dogs in a 1,400 sq. ft. house they say is &apos;spacious&apos; (with 2 baths and one of those is the master. . .) in a neighborhood further away for the same $$.  Yeah, really.  Seriously, where would you rather live?  And, if the person who wrote that ad is reading; 1,400 sq. feet is &quot;large&quot; or &quot;spacious&quot; only in Hong Kong, not Portland.  All those &quot;high density&quot; cracker boxes slapped up in Couvtucky or Hillsboro with the 20-somethings buying them and looking for roommates -- if they didn&apos;t put the house size (and the room size) in the ad, do you think they&apos;re closer to 2,100 or 1,400 sq. ft.?  Yup, you&apos;re getting the hang of it now.  Also, condos, apartments, and townhouses are going to be inherently smaller everywhere (including no storage space for your skis and other gear/clothing) than a full-fledged house.  Ever hear of a 2,000+ sq. ft. condo?  Me either.  Not to mention little or no yard, common walls with your neighbors, etc.  So make sure you pay less to be cramped every hour you&apos;re home, bumping elbows with your fellow roommates, and hearing noises at all hours due to proximity with other people&apos;s snoring, music, dishes, conversations, and just plain living. . .  <br>\n<br>\n5.\tWhich brings me to: what&apos;s --in- their ad? I&apos;ve seen recent ads up here that say:  &quot;I have room for rent in Hillsboro close to TV Hwy &amp; Fred Meyer. If interested contact me.&quot;  That&apos;s it.  No rent amount, phone number, utility costs, room or house/apt. size, how many people in the place, cats, dogs, cable, internet, furnishings, if it&apos;s an apartment/house/shack, no nothin&apos;.  Nada.  The record for brevity is 52 CHARACTERS (with spaces) -- and that included the zip code.  WTF???  Do you really want to waste your time prying out the information from someone who&apos;s --that- lazy (or stupid)?  I mean, really.  I&apos;ve NEVER found these people know what they&apos;re doing, really understand shared living, and/or have the IQ points necessary to be good LANDLORDS.  But if you want to waste YOUR time, knock yourself out.  <br>\n<br>\n6.\tHow much are the utilities, really?  With electric and gas rates going up by 10-20% every year, have they accounted for that?  I&apos;m not saying people lie, but have they even been in the place long enough to know what the heat is going to be this winter or how hot your room will --really- get in the dog days of summer?  And if they do, why didn&apos;t they put this in their ad in the first place?  Are they merely morons or are they trying to hide something?  It&apos;s not like they&apos;re limited on the number of words (after all, look at this post. . ..) Easy way around that is to ask for a fixed price w/ utilities included for the length of whatever lease you&apos;re signing or a maximum $$ limit for the utilities. If they balk, consider. . .. <br>\n<br>\n7.\tDo they need you in order to pay the rent/mortgage because the payment went up or they lost their job?  If they do, you can be sure they&apos;re going to be a LOT more uptight about bills, who bought the last roll of toilet paper, and splitting everything --precisely- down the middle.  And getting that 5th person squeezed into the house in the &quot;spare&quot; room they said they weren&apos;t planning to rent out?  When push comes to shove, bet you can figure out what they&apos;ll do.    <br>\n<br>\n8.\tCentral A/C?  Sure, you don&apos;t need it --now-.  We had 21 days above 90 degrees in 2014 and 24 days in 2009; and slightly less in between those years. How well did you sleep?  Just remember, July, August, and September happen (not to mention hot days &amp; nights in between). . .and they&apos;re closer than you think. . ..  <br>\n<br>\n9.\tPictures posted with their ad?  C&apos;mon, digital and cell phone cameras are ubiquitous today.  They --could&apos;ve- put dozens of pictures of the place on Craigslist.  Heck, if it&apos;s an apartment complex, why didn&apos;t they put the URL: of the place in the ad?  Honestly, if they don&apos;t have pictures of the house/apartment, it seems to me they&apos;re either lazy, incompetent, have something to hide, or are stunningly incapable of managing the simplest thing.  Do you really want to bother with any of those FROM YOUR LANDLORD??  <br>\n<br>\n10.\tAre they --really- &quot;close&quot; to a location or a company?  There&apos;s some dweeb who claimed he&apos;s &quot;close&quot; to Nike and he&apos;s on 198th and Farmington road (~15 minutes away), which might be &quot;close&quot; in the Bay area; but not Portland.  Then again, that&apos;s the closest landmark they had because the place is in BFE. . .  ;-))  And while you want to be close to something, you don&apos;t want to be --too- close.  The screeching max train or bus stop diesel can really interfere with your quiet enjoyment after a hard day. . .  Craigslist allows you to put in map coordinates in an ad (and it&apos;s pretty easy and automatic to do). So if they didn&apos;t do it, again, do you really want to bother with any of this FROM YOUR LANDLORD??  <br>\n<br>\n11.\tWhy&apos;d the last person move out?  If you don&apos;t get a good answer, dig!  Did they leave to get married or because this goomba drove them nuts?  If it smells like a duck. . ..  <br>\n<br>\n12.\tWhich segues nicely into how stable are they?  C&apos;mon, most of us have had flakes for roommates at least once.  On top of that, 42% of sub-prime and 12% of all mortgages are delinquent.  If they move out of the place and leave you on the hook for the ENTIRE rent you get saddled with it.   Or they don&apos;t pay the mortgage; you just got unceremoniously evicted.  And if they have your last month&apos;s rent or a security deposit and they scamper off, where do you think your money goes???  Anyway, you know what to look for.  &apos;nuff said.  <br>\n<br>\n13.\tSomeone pointed out that if you move in with someone who has pets are you going to be expected to help (or entirely) take care of them? They also pointed out this could be the same scenario with children. One person wrote to say she&apos;d recently moved from a place who&apos;s landlord suddenly decided 5 kids under 10 years old should spend the summer. Um, wow. Now that&apos;s a change in living situation! <br>\n<br>\n14.\tDo you --really- want to sign a lease for a YEAR without knowing a person?  Why not 6 months or even less?  Sure they can raise the rent or kick you out.  But crazy people happen, too.  And that seems to happen much more often than getting the rent raised.  ;-0 <br>\n<br>\n15.\tDo they have real contact info.?  It&apos;s not hard to put in a phone number or even get a throwaway gmail account.  When someone is offering a room for rent it seems like &quot;unidentifiable&quot; is a flag.  Sure, sometimes you want to be anonymous, but when you&apos;re renting a room; ie selling something; and hiding behind a craigslist remailer with not even a first name, e-mail that&apos;s been e x p an d e d dot c.o.m so the spam bots don&apos;t catch it, or phone number in words and numbers, somethin&apos; seems either lazy or fishy to me.  And you kind of wonder about those same people telling the scammers not to write to them. Ah, guys, do you think the scammers actually read the post? OK, rant off. By the same token, you have some responsibility as well. Send them a real e-mail and some actual content; more than just &quot;is the room still available?&quot; and include your PHONE NUMBER. After all, if you have real interest, give them an easy way to verify you&apos;re not a spam bot (yeah, they&apos;re getting good) so they can get back to YOU!<br>\n<br>\n16.\tSomeone suggested I add: Has anyone ever died in the house?  Not sure I&apos;d want to know. . ..;-)  <br>\n<br>\n17.\tAnother someone suggested I add was you want to live some place where the bedrooms are on opposite ends of the house...if not, guess what you might be hearing all night; them tossing and turning on that crappy old mattress.  And you thought I was talking about something else, didn&apos;t you, pervert. . .  ;-)  Obviously, there&apos;s also alarm clocks, early morning or late night phone calls, TV, stereo, video games, etc. that can easily pierce those paper thin walls between rooms in an apartment complex.  Guess distance --does- make the heart grow fonder. . ..  <br>\n<br>\nThis certainly isn&apos;t the last word in what to consider when looking for shared housing.  But it&apos;s several of the big points I&apos;ve contended with when I was doing it.  <br>\n<br>\nEyes open and head up and you&apos;ll do fine.  <br>\n<br>\nSam\n    "
    },
    {
        "title": "Queer &amp; trans vegan family looking to create house: join us?",
        "href": "/mlt/roo/4816887140.html",
        "time": "2015-01-02 13:41",
        "price": null,
        "neighborhood": " (NE/ SE Portland)",
        "postBody": "\n        Hello, all~<br>\n<br>\nWe are a queer/trans couple with a 16-month-old baby, a boxer-mix dog, and two cats, looking to create an intentional house.  Care to join us?<br>\n<br>\nWe are in need of someone(s) who is lgbtq friendly, vegan/vegetarian, and is comfortable living with children.  If you have kids or a family of your own, that&apos;s cool too.  Other animals are certainly welcome and we would just want to insure beforehand that all get along.  Our pup has a trauma history and can be reactive to other dogs, but also loves to play with them once she feels safe.  We would like to maintain a vegetarian kitchen, and hope you consider this a bonus.  We also like to use hippie cleaners and keep the common spaces TV free (we are considering getting a projector for movies and archive binges, though!).  Banjos and guitars will be played, but not well; other instruments (and talent) welcome.  We like to ride bikes, but also use our cars.  Gardens are awesome.  Sharing/ co-cooking some meals together would also be awesome.  We like to drink tea and coffee and will likely host geeky things like board game night!  In regards to substances, we can negotiate an arrangement of either a completely sober space or light drinking and private/outside smoking, depending on what you need or prefer.  For work, one of us is a midwife/massage therapist/nanny and the other is in landscaping and construction.<br>\n<br>\nWe are hoping to find our future housemate(s) and then find a house together.  We would love this to be in a walkable neighborhood somewhere in SE or NE, with a fenced backyard for the dog.  Our price range is up to 800 for our room (the baby shares our room).  We&apos;d prefer the master bedroom if there is one, but that&apos;s negotiable.<br>\n<br>\nAlternately, if you already have a space and think we might be a good fit, we&apos;re also open to moving into an established space.  <br>\n<br>\nThanks! ~J &amp; K\n    "
    },
    {
        "title": "Townhouse Share in NE Portland",
        "href": "/mlt/roo/4829478681.html",
        "time": "2015-01-02 13:34",
        "price": "$750",
        "neighborhood": " (Alberta Arts)",
        "postBody": "\n        Hi! <br>\nI am looking for a roommate (singular, no couples) to share my town house in NE Portland. I am a 30-something professional, I work from home, am generally neat &amp; quiet and am looking for the same (clean, quiet, responsible, pays bills on time, etc).  After reading this, if you are interested, please reply with a bit about yourself and what interests you about sharing my townhouse. Thanks!<br>\n<br>\nThe room: 1 bedroom, walk-in closet &amp; en suite bathroom (it&apos;s the master bedroom of the house so it&apos;s pretty decent sized). It&apos;s at the back of the house so you don&apos;t hear much street noise, it has west facing windows that look out onto backyards. The bedrooms are on opposite ends of the house, so no shared walls.<br>\n<br>\nThe house: 3 beds, 2.5 baths. (as mentioned) in NE Portland, Just off Killingsworth &amp; 3 blocks to Alberta and all its delicious offerings. It was built in 2008 so things are new, insulated and well protected from the elements. There are TONS of windows and all the main areas are flooded with light...when we have sun. Washer/Dryer, dishwasher, central air, a/c (!!) are all present and accounted for. The main floor is bamboo/tile, the upstairs is carpet. There is a 2-car tandem garage, no room for another car in there (there is never a problem parking on the street on the block), but ample room for bicycle, motorcycle  and other sundry item storage.  There is a small deck &amp; yard, complete with a grill.  <br>\n<br>\nThe rest of the house is shared, except my bedroom/bathroom and the office on the main floor (I work from home). Me and the potential roommate would be the only two living here, the 3rd bedroom is a tv/hangout/guest room.<br>\n<br>\nI have a cat who is super friendly with people &amp; other cats, but isn&apos;t so fond of dogs (yet). I&apos;d prefer no more pets, but am flexible based on the person &amp; the pet.  <br>\n<br>\nNo smoking or drugs in the house. Smoking outside is fine, so long as it&apos;s legal.<br>\n<br>\nDeposit is $1,500 (last months rent + refundable security of $750 - this can be split up over a few months to make it easier, we can discuss if it gets that far). Rent is $750 month and includes garbage and internet, all other utilities (electric, water, gas) will be split 50/50 as they are billed (monthly, except water which is quarterly).  <br>\n\n    "
    },
    {
        "title": "clean sober roomate wanted",
        "href": "/mlt/roo/4824043967.html",
        "time": "2015-01-02 13:31",
        "price": "$450",
        "neighborhood": " (vancouver wa)",
        "postBody": "\n        I have a 3 bedroom house I&apos;m looking 2 rent out one of my spare rooms for $450 that&apos;s utilitys included INTERNET HOME PHONE HD TV ELECTRIC GAS WATER AND GARBAGE a $100 non refundable deposit is required. MUST B PET FRIENDLY.  <br>\n <a href=\"/fb/pdx/roo/4824043967\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    "
    }
]