[
    {
        "title": "Room for rent, Happy Valley",
        "href": "/mlt/roo/4942942708.html",
        "time": "2015-03-21 14:15",
        "price": "$400",
        "neighborhood": " (14094 SE Rolling Meadows ctrl happy vall)",
        "postBody": "\n        Room for rent in four bedroom happy valley house. $400. Share bathroom. Call Michael for questions. Male owner and his GF, currently study engineering at Portland State University fulltime. Please email information or text\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942942708.html"
    },
    {
        "title": "Wanted: Gay or Gay Friendly Male to Share 3 BR House",
        "href": "/mlt/roo/4942931794.html",
        "time": "2015-03-21 14:07",
        "price": "$500",
        "neighborhood": " (Near NE Killingsworth &amp; 55th)",
        "postBody": "\n        Fully furnished room available in house near NE Killingsworth &amp; 55th, in the Cully Neighborhood.  We are close to PCC Cascadia campus.  There are two regular bedrooms, and a private room in the garage.  We are seeking to rent out the main bedroom, which is available now.  It&apos;s roughly 12x12 with windows facing south, 2 large closets, a double bed, dressers, wall-mounted TV, computer desk, night stands, etc.   There are 3 others living here, one in the main part of the house (me), and a young couple in the private garage room.  We have a small dog and three harmless cats that wander around.    A PCC student would get along well here.  We have storage area in garage if you have extra things or don&apos;t want to use our BR furniture.<br>\nWe&apos;d like to rent to a gay guy, or at least gay/bi friendly.  We are 420 friendly, but tobacco must be smoked outside.  You&apos;ll have your own private room, cabinet spaces, drawers and room in the fridge.  A desktop computer is available for your private use in room.  We hang out together, or we go to our separate rooms, depending on moods.  Please have reliable, steady income. <br>\nRent is $500 per month, and first and last month&apos;s rent are required prior to move-in.  Other than that, there are no deposits required, but we&apos;ll need $200 toward your last month&apos;s rent to hold the room after you see it and we get together on the details.  Utilities are included as is wifi/ethernet, but we don&apos;t do cable or satellite at this moment.  <br>\nIf you think you might be a match for us, please email with a picture/selfie if you have it, and something about yourself.  Please mention if you are okay with the rental arrangements described above and that you can meet the financials without difficulty.<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00C0C_iUrht6YAIWL_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942931794.html"
    },
    {
        "title": "Private room for rent",
        "href": "/mlt/roo/4936376023.html",
        "time": "2015-03-21 14:01",
        "price": "$500",
        "neighborhood": " (Powell)",
        "postBody": "\n        looking for mature women to share my house, must be drug free and clean and tighty. you will have your own private room, my house is very nice up todate. there is a$45 application fee. i am a young single mother raising my two young daughters who mind very well if you have any questions please feel free to call. must be drug free. washer and dryer, No pets <br>\n <a href=\"/fb/pdx/roo/4936376023\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "image": "http://images.craigslist.org/00606_8JsowmvBKVw_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4936376023.html"
    },
    {
        "title": "1BD - Close-in SE - Chill Roommates - Eco-Friendly",
        "href": "/mlt/roo/4942919446.html",
        "time": "2015-03-21 13:59",
        "price": "$680",
        "neighborhood": " (Brooklyn)",
        "postBody": "\n        Hey there! My roommate and I have a bedroom available immediately in our home for a single occupant. Our house is located in the Brooklyn neighborhood close-in SE Portland at Milwaukie Avenue and Mall Street. Easy access to entertainment, food, and public transportation. <br>\n<br>\nTHE HOUSE:<br>\n<br>\nBeautiful, bright, spacious eco-friendly home. Bamboo floors. On site washer/dryer.<br>\nBrand new everything (no joke). Energy efficient. Lots of natural night<br>\n3-bedroom house, 2.5 bath. <br>\n<br>\nBedrooms on the top floor. <br>\nTwo living rooms, dining room, fireplace and kitchen in the middle. <br>\nLarge finished basement, bonus room, and garage downstairs. <br>\n<br>\nThree stories. Lots of common space. Recreation room. Check out the picture of the living room with raised ceilings! Large back patio, planter boxes and a porch outside.<br>\n<br>\nTHE RENT/ROOM:<br>\n<br>\nRent is $680, due on the first of each month. Additional $1000 security deposit at move-in, refundable. <br>\nShared utilities. No pets (NOTE: WE HAVE PARAKEETS).<br>\nRoom is 10&apos;x10&apos; with a closet. North facing windows. Carpeted. Shared bath with one other male roommate.<br>\n<br>\nTHE ROOMMATES:<br>\n<br>\nTwo chill guys, both in their mid 20&apos;s. Open-minded. Work hard, play hard (okay, here and there!). <br>\n<br>\nNate: Environmentalist. College graduate. Outdoors. Gardening. Fitness. Hip-hop. Natural/organic everything.<br>\n<br>\nJohnny: Creative. Explorer. Yoga. Film. Comics. Almost natural/organic everything.<br>\n<br>\nYOU:<br>\n<br>\nIdeally, we are looking for a person in their 20&apos;s. No criminal history.<br>\nDependable income. Long term tenant. <br>\n<br>\nWe want you to be a reliable, straightforward adult with a full life and things to do. And, we want to be able to VIBE with you! As in hangout with you and catch up on our days... You know, roommate stuff like that. <br>\nWe like to think of our house as a place where we can learn, encourage, and grow from each other. <br>\n<br>\n**An application and background check is required by our rental property manager- $42 non-refundable. You can move in as soon as your application is approved by our property manager, which can take a few days (we will prorate you of course!).<br>\n<br>\nWe&apos;ve made this place our home and inspiration. If this space sounds like a place where you can continue developing yourself and positively vibing with us then shoot us an email! Tell us what YOU&apos;RE looking for in a home and a bit about yourself! Thanks.  <br>\n<br>\n**Note: We currently have two ads going for our available room. Please reply to one!\n    ",
        "image": "http://images.craigslist.org/00t0t_jnOIxnBO3Lw_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942919446.html"
    },
    {
        "title": "Lewis &amp; Clark students/others for home close to campus!",
        "href": "/mlt/roo/4931074145.html",
        "time": "2015-03-21 13:52",
        "price": "$650",
        "neighborhood": " (SW Portland)",
        "postBody": "\n        Newly remodeled, up-scale home in terrific, professional neighborhood with two bedrooms available. I live downstairs in a separate apartment. I would like to share my upstairs home with serious, honest, thoughtful, communicative, quiet types. Non smoker or anybody who uses non-prescriptive drugs, please! This house is not &quot;420 friendly.&quot; It&apos;s important that we all are neat, tidy, responsible, respectful, organized, able and willing to pay rent on time every month, and have no pets. I prefer to live with women. Candles are not permitted.<br>\n<br>\nThe monthly rent is $650.00 for the smaller room and $750.00 for the larger room. Both are  furnished with a bed, desk, dresser, bookshelf and night stand; the bathroom is shared between two people. The rooms are for single occupancy. A lease is required; if your academic program is less than one year we can discuss this. <br>\n<br>\nHousing includes a washer and a dryer near the bedrooms, use of the kitchen with dishwasher, natural gas-powered kitchen stove, basic kitchen dishes and cooking items, and lots of peace and quiet. I prefer somebody who is interested in recycling and energy conservation. There is Comcast WIFI. <br>\n<br>\nThis is an excellent residence for a serious, responsible student or somebody who prefers peace and quiet; it is not suitable for a &quot;partier&quot; or somebody who is loud and noisy. It&apos;s perfect for someone interested in starting a vegetable garden in the back yard or a container garden on the deck. The yard care is handled by a professional landscaping company. Please email with any questions and to schedule an appointment for viewing.<br>\n<br>\nSpecifics on Location:  The house is .2 mile to Lewis &amp; Clark College. PSU is 20 downhill minutes away by bicycle. PCC Sylvania nearby. OHSU and VAMC are an easy drive down Terwilliger Blvd.. The nearest bus stop is at the corner of Terwilliger and Primrose. The Lewis &amp; Clark bus is also available very nearby for L&amp;C students. <br>\n<br>\nPlease email and tell me about yourself. The home is available now.\n    ",
        "image": "http://images.craigslist.org/00y0y_3JbG9E2g31v_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4931074145.html"
    },
    {
        "title": "Intentional Community, Yoga, Gardening",
        "href": "/mlt/roo/4937034778.html",
        "time": "2015-03-21 13:42",
        "price": "$486",
        "neighborhood": " (NE 22nd &amp; Alberta)",
        "postBody": "\n        The Vision &amp; Sustainability Community seeks a housemate who wants to live your vision of sustainability, wellness, community, &amp; fun.<br>\n<br>\nBeautiful, affordable, sustainable housing &amp; community in the heart of Alberta<br>\n<br>\nAvailable April 15.<br>\n<br>\n* $486 for medium size room w/ south window<br>\n<br>\n* Low utilities (Solar panels, fully insulated house, efficient gas furnace, compact fluorescents &amp; LEDs)<br>\n* ENERGY-EFFICIENT appliances (washer, dryer, 2 refrigerators, dishwasher);<br>\n* cool INTERGENERATIONAL housemates committed to supporting one another&apos;s visions<br>\n* locked BIKE SHED<br>\n* CHEAP YOGA, meditation, &amp; wellness classes on site<br>\n* Large STUDIO space w/ hardwood floor<br>\n* Gas stove &amp; great kitchen<br>\n* Big GARDEN<br>\n* OFF-STREET PARKING (limited to one additional vehicle)<br>\n* Attic Storage Space<br>\n* HI-SPEED INTERNET connections in every room &amp; wireless internet throughout,<br>\n* opportunity to buy-in to the co-op (BECOME an OWNER) after 6 months<br>\n<br>\n<br>\nWe&apos;re a cooperatively-owned house that encourages residents to become co-owners if they vibe with the house for 6 months.<br>\n<br>\nWe are mainly looking for someone who already has or is genuinely interested in a daily yoga practice. It&apos;s a big plus if you also love gardening, vegetarian cooking, yoga, music, meditation &amp;/or being the change you want.<br>\n<br>\nYou don&apos;t have to be a vegetarian to live in the house, although shared meals are vegetarian (you can cook &amp; add meat). To encourage diversity in our community we especially welcome applications from women, people of color, and trans-identified people; and we will not discriminate against any qualified applicant.<br>\n<br>\nNo pets, smoking, or illegal drugs in house.<br>\n<br>\nCALL:  Bart at \n <a href=\"/fb/pdx/roo/4937034778\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n ext. 2<br>\nPlease call rather than e-mail for fastest response.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4937034778.html"
    },
    {
        "title": "Charming Bungalow - 2br 1100ft&#xB2; - Seeking Housemate",
        "href": "/mlt/roo/4923299079.html",
        "time": "2015-03-21 13:39",
        "price": "$825",
        "neighborhood": " (Alberta)",
        "postBody": "\n        Looking to fill the larger bedroom of a cozy 2 bedroom house just off of Alberta. This house has 8 rooms: 2 bedrooms (one is occupied by me), bathroom, living room, dining room, kitchen, laundry room, and large covered front porch. Also featured: wood flooring, functioning fireplace, and a washer and dryer on-site. The front yard is usable for lawn games, while the back yard is quieter with a vegetable garden and storage shed. The open room is approx. 180ft&#xB2;, with three windows and three closets.<br>\n<br>\nRent is $825. Utilities average around $90 in the summer, and can be over double in the winter. Heat is provided by electric wall cadets, which are fairly efficient and can be zoned. The common rooms are currently furnished, but I&apos;m open to compromise as this would be our house, not my house.<br>\n<br>\nAbout myself: I am a 32 year old architect who like to fish. Most weekends I&apos;m out of town enjoying the outdoors. I aspire to home cooked meals and a clean environment.<br>\n<br>\nAbout you: Fully employed. Knows how to live with others and cleans up after yourself. Social gatherings are encouraged, but frequent parties are not. Stability is a big plus as well, of course. There is plenty of gardening potential in the back yard, so green thumbs are most welcome.<br>\n<br>\nAdditionally:<br>\nMove-in date is April 1st. <br>\nDeposit equivalent to first month&apos;s rent is required.<br>\nMonth-to-month lease.<br>\nDogs are not allowed. I like dogs, but they make me itchy and are not permitted on the lease anyway. Cats are negotiable.\n    ",
        "image": "http://images.craigslist.org/01515_51SdgyiUYA5_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4923299079.html"
    },
    {
        "title": "Charming Bungalow - 1100ft&#xB2; - Seeking a couple to share house with",
        "href": "/mlt/roo/4923321009.html",
        "time": "2015-03-21 13:39",
        "price": "$483",
        "neighborhood": " (Alberta)",
        "postBody": "\n        Looking to fill the larger bedroom of a cozy 2 bedroom house just off of Alberta. This house has 8 rooms: 2 bedrooms (one is occupied by me), bathroom, living room, dining room, kitchen, laundry room, and large covered front porch. Also featured: wood flooring, functioning fireplace, and a washer and dryer on-site. The front yard is usable for lawn games, while the back yard is quieter with a vegetable garden and storage shed. The open room is approx. 180ft&#xB2;, with three windows and three closets.<br>\n<br>\nRent is $483 per person ($966 total for the room). Utilities average around $70 in the summer, and can be over double in the winter. Heat is provided by electric wall cadets, which are fairly efficient and can be zoned. The common rooms are currently furnished, but I&apos;m open to compromise as this would be our house, not my house.<br>\n<br>\nAbout myself: I am a 32 year old architect who enjoys the outdoors. On weeknights I&apos;ll frequently have commitments, but also enjoy relaxing at home. I aspire to home cooked meals and a clean environment.<br>\n<br>\nAbout the two of you: Stable and gainfully employed. I&apos;m looking for seasoned and respectful house sharers who play well with others and don&apos;t dominate spaces. Social gatherings are encouraged, but frequent parties are not. There is plenty of gardening potential in the back yard, so green thumbs are most welcome.<br>\n<br>\nAdditionally:<br>\nMove-in date is April 1st. <br>\nDeposit equivalent to first month&apos;s rent is required.<br>\nMonth-to-month lease.<br>\nDogs are not allowed. I like dogs, but they make me itchy and are not permitted on the lease anyway. Cats are negotiable.\n    ",
        "image": "http://images.craigslist.org/01515_51SdgyiUYA5_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4923321009.html"
    },
    {
        "title": "wheelchair. accessible room",
        "href": "/mlt/roo/4942884161.html",
        "time": "2015-03-21 13:37",
        "price": "$675",
        "neighborhood": " (8715 Lambert. se)",
        "postBody": "\n        Room for rent.overlooking. creek. Garden. Pasture. Horse. Stalls. 1930. Full Bathroom and tub skylight. Covered large. Patio with rwo barbecues.wood cooking range.2500 square feet. Of off street parking. Very large walkin. Closest.large. full bath.skylights, contact David seperate. Shower and bath rooms\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942884161.html"
    },
    {
        "title": "Room with private entry $500 plus utilities",
        "href": "/mlt/roo/4942867676.html",
        "time": "2015-03-21 13:26",
        "price": "$500",
        "neighborhood": null,
        "postBody": "\n        Hello there !!! <br>\nWe have a bedroom opening in our awesome house April 1st! $500 per month, deposit $600, $20 application fee. NOTE- the application fee we only be charged to the person we select: <br>\n<br>\nAbout the house: <br>\n<br>\nLocated off Fremont and 50th in North east Portland. The house is a very short walk (blocks) to restaurants, bars, and shops on Fremont. Two MAX stations, Safeway, and Trader Joes are all about a mile away. Also just over a mile to the heart of Alberta St. <br>\n<br>\nThe room is a mid sized room with private entry way that is located on the ground floor next to the kitchen. It does not have an enclosed closet but there is a space to hang clothes. <br>\n<br>\nThe house has a decent sized entry room and dining area, large kitchen, large backyard, and large basement we use for movie nights and as a craft/ art space. The basement has a late TV that is hooked up to Netdlix. We also have a jacuzzi although we don&apos;t use it too too much at this time. <br>\n<br>\nYou will have your own cupboard and shelf or drawer in the fridge for your own food. Only one bathroom so we try to keep shower time to under 20-30 min per day <br>\nAbout us: <br>\n<br>\nOne is in his late 20&apos;s and works full time Monday-Friday as a sales rep for a outdoor/sports company. <br>\n<br>\nAnother in her early 30&apos;s and works at nearby cafe. She likes to craft and resell vintage items.<br>\n<br>\nThe other is in his early 40&apos;s and works as a full time artist with a focus on visionary art. <br>\n<br>\nWhat we are looking for: <br>\n<br>\nSomeone with their shit together. We aren&apos;t interested in someone that is struggling financially. We need to feel secure you can pay $500 for rent plus another $100 or so for utilities. ( that includes internet, electricity, trash, and water) <br>\n<br>\nSomeone that doesn&apos;t party too hard... And defiantly doesn&apos;t bring the party home... Most the time we are in bed before midnight. <br>\n<br>\nSmoking is alright on the front patio or back but never in the house. We don&apos;t mind a beer or so to unwind for the night but no raging alcoholics please. Must be 420 friendly as one of us is a medicinal patient. <br>\n<br>\nYOUR TURN:<br>\n<br>\nTell us about yourself and why you think you would be a great fit. We will only meet with people that we think are right for our place. Must mention out lease is up mid September. It looks like the home owners are planning to renew our lease but just something to keep on mind. We will only accept people that are committed to staying through mid September. <br>\n<br>\nNo pets please or children please <br>\n<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942867676.html"
    },
    {
        "title": "500$ a month to live in a clean relaxed fun loving home",
        "href": "/mlt/roo/4942829222.html",
        "time": "2015-03-21 13:25",
        "price": "$450",
        "neighborhood": " (130th holgate)",
        "postBody": "\n        I am a relaxed funny young woman .recently divorced with 2 kids. I have a nice spare room that I am looking to fill. I am strong minded, simple ,and happy all the time. I&apos;m a positive person. and I mind my own business.<br>\nI&apos;m looking for someone who cleans up after themselves. that has an even consistant emotional attitude. who is posotive respectful. and whose not too opinionated or  judgemental. preferably a woman with a love for children. I am very serious about mannerism. and my children behave the best of any iv ever witnessed.  I&apos;m simplistic. and minimalist .when it comes to clutter. and my house is very kept and functional.<br>\nI do listen to loud music all through the day and through most of the night. if that&apos;s something you can get used to. I promise there&apos;s no place more compfterble than my home. App fee 40$ . no pets\n    ",
        "image": "http://images.craigslist.org/00s0s_k7tBCIDR7cs_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942829222.html"
    },
    {
        "title": "Utils included - New Room in 3 Bedroom Home",
        "href": "/mlt/roo/4923111596.html",
        "time": "2015-03-21 13:24",
        "price": "$565",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        I am 67 and run a shared housing off Stark and 141st.  In the side yard, we enjoy a little bit of forest heaven, a large deck , hot tub.  It&apos;s a very pleasant place to hang out for meals, etc. I am looking for people who want security, quiet, and are looking for a moderate to long term place to live. (Please, non-smoker &quot;Does not smoke anywhere&quot;, no heavy drinking, no drugs.)  <br>\n<br>\n<br>\nBedroom is in a remodeled unit share bath, kitchen/dining area, and laundry. Composite and tiled flooring throughout. It has it&apos;s own exterior entrance.  Rent $565 includes utilities, internet, and cable.  Security Deposit is $282.50.   The security deposit will be refunded when you move out, provided the place is clean and you are up to date with your rent. <br>\n<br>\nLet&apos;s talk,<br>\n<br>\nCall  me at: (c)\n <a href=\"/fb/pdx/roo/4923111596\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\n<br>\nThanks,<br>\n<br>\nTom McGill<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nS.E. Portland, SE Portland<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00y0y_67tlgbUvNAj_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4923111596.html"
    },
    {
        "title": "beware! alberta arts house",
        "href": "/mlt/roo/4942854287.html",
        "time": "2015-03-21 13:18",
        "price": null,
        "neighborhood": " (515 ne. sumner)",
        "postBody": "\n        be very careful of renting from this man it is a constant revolving door with people he wants you to stay in your room constantly you are not to have friends or family over. you cant use the kitchen and the basement contantly has a rat problem. honestly just a terrible land lord and when you move out he will do any childish thing to keep your deposit.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942854287.html"
    },
    {
        "title": "Room for Rent",
        "href": "/mlt/roo/4942824900.html",
        "time": "2015-03-21 13:14",
        "price": null,
        "neighborhood": " (1023 ne Killingsworth)",
        "postBody": "\n        We have a room for rent in a 3 bedroom, 1 bathroom, 2 story (and basement), house.<br>\nWe have a small front yard that is open for gardening, if your into that. We have a washer and dryer in the basement that is perfect for storage/ artist space. We are looking for someone to move in as soon as possible.<br>\nAbout Us: <br>\nOwen: 31yrs old. Loves riding bikes and works at Chris King. He really loves bikes.<br>\nChris: 35yrs old. Works in the food industry, likes bikes, photography, and sipping on beers.<br>\nIf this sounds good to you, just send us a little bit about your self. <br>\nAlso, must have good rental history, as the rental agency does check.<br>\nThanks<br>\n\n    ",
        "image": "http://images.craigslist.org/00S0S_7Dhk3xTs3fn_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942824900.html"
    },
    {
        "title": "House share",
        "href": "/mlt/roo/4926521041.html",
        "time": "2015-03-21 13:14",
        "price": "$700",
        "neighborhood": " (Wood Village)",
        "postBody": "\n        Room for rent in 1 level , 3 bedroom 2 bathroom home in quiet upscale neighborhood. <br>\nFully furnished. <br>\n<br>\nShare with one other professional person. <br>\nMust like cat&apos;s ***Sorry, no additional pets permitted***<br>\n<br>\nThis is a month to month rental agreement <br>\n<br>\nUtilities split 3 ways.<br>\n<br>\nBackground check is required <br>\n<br>\nPlease respond to this email for additional information<br>\n<br>\nSerious enquiries only please!<br>\n<br>\n<br>\n<br>\nThank you <br>\n<br>\nKeith\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4926521041.html"
    },
    {
        "title": "Cozy. Quiet room for rent. 14 by 10 sqft",
        "href": "/mlt/roo/4942833855.html",
        "time": "2015-03-21 13:10",
        "price": "$375",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Chill out home. Quiet private room. $375.00 per. Small deposit to hold room. Gal preferred. Room ready on 7th of April. Non smoker. 420 ok with card. (a must). No dog. No couples. Just not enouph room. Basic  back ground check. Free. Help clean common areas. Get along with others. Good size back yard for garden. Small green house. Close to shopping and park. Public transportation. Come by and check it out. Its free.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942833855.html"
    },
    {
        "title": "Looking for a reliable person to share",
        "href": "/mlt/roo/4942781848.html",
        "time": "2015-03-21 13:01",
        "price": "$495",
        "neighborhood": " (Lower Boonesferry &amp; Jean)",
        "postBody": "\n        Large furnished room in a quiet house.  You have access to all amenities. Rent includes utilities, cable, and internet. Walking distance to buses and stores in a quiet residential area in Lake  Grove.  Ten minutes to PCC Sylvania and fifteen minutes to PSU by car.   We are looking for a non-smoking, non-drinking, clean working person or student. No pets.  Reference would be helpful. Call evenings or weekends.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942781848.html"
    },
    {
        "title": "Room for rent in a great location",
        "href": "/mlt/roo/4939442444.html",
        "time": "2015-03-21 12:49",
        "price": "$500",
        "neighborhood": " (sw portland)",
        "postBody": "\n        Hi there,<br>\n<br>\nMy wife and I are offering a room for rent.<br>\n<br>\nThe house:<br>\nSmaller home, 1200 SF, 3 bed/2 bath, granite kitchen tops, wireless internet, NO cable tv. carpet, nice size yard, overall decent home in great neighborhood. House is close to Lewis and Clark College and on bus lines. Not much for storage, we can put a couple boxes in the garage for you but that is about it. And last but not least, parking for you will be on the street.  <br>\n<br>\nThe room:<br>\nIt is approximately 10x12 feet with an oversized closet. Room is currently furnished but if you have your own things we can make arrangements. 1 bathroom will be designated to you but will be used occasionally by us as it is the main bathroom in the home.  <br>\n<br>\nUs:<br>\nCool laid back married couple, both professionals, work throughout the week. The whole rental thing is new to us so I hope you can respect that or be in the same position as we are. <br>\n<br>\nYou: <br>\nWe have a little dog, so you either must like/love dogs or be okay with them. And we don&apos;t want any more animals in the house. (sorry)<br>\nYou don&apos;t smoke cigarettes. <br>\nYou&apos;re clean, respectful, and pick up after yourself as we will do the same<br>\nYou&apos;re a busy professional too or just out and about a lot and only really need a room and bath with little use of the kitchen and/or living room.<br>\n<br>\n<br>\nRent is $500/mo - includes all the utilities and internet. <br>\nTo move in $200 deposit (refundable) and first month of rent. Total: $700. <br>\n<br>\nPlease reply by email telling us about yourself if interested. <br>\n<br>\nThank you<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4939442444.html"
    },
    {
        "title": "$435 Room For Rent Near PCC Sylvania",
        "href": "/mlt/roo/4939593263.html",
        "time": "2015-03-21 12:42",
        "price": null,
        "neighborhood": " (SW Portland)",
        "postBody": "\n        Hey there, I&apos;ve got a room for rent in SW Portland now available, looking to rent by April 1st(or as soon as possible). It&apos;s less than a mile from PCC Sylvania and just down the street from the Barbur transit center(near the corner of SW Huber and Barbur). I&apos;m looking for someone who is drug and drama free, has no felonies, can pass a background check, and can commit to a minimum 6 month lease. I don&apos;t mind male or female, or possibly a couple, but I would prefer no one under 25, and you should also have steady income. Rent is $435 with around $70 or less in utilities(there&apos;s no deposit, so total move-in cost is only about $500). Nice, clean and safe complex and neighborhood(first pic was taken from my balcony). If interested, call or text Nick at <br>\n <a href=\"/fb/pdx/roo/4939593263\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n thanks.\n    ",
        "image": "http://images.craigslist.org/00k0k_6QR73VlJteb_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4939593263.html"
    },
    {
        "title": "$435 Room For Rent Near PCC Sylvania",
        "href": "/mlt/roo/4939579743.html",
        "time": "2015-03-21 12:41",
        "price": null,
        "neighborhood": " (SW Portland)",
        "postBody": "\n        Hey there, I&apos;ve got a room for rent in SW Portland now available,looking to rent it by April 1st(or as soon as possible). It&apos;s less than a mile from PCC Sylvania and just down the street from the Barbur transit center(near the corner of SW Huber and Barbur). I&apos;m looking for someone who is drug and drama free, has no felonies, can pass a background check, and can commit to a minimum 6 month lease. I don&apos;t mind male or female, or possibly a couple, but I would prefer no one under 25, and you should also have steady income. Rent is $435 with around $70 or less in utilities(there&apos;s no deposit, so total move-in cost is only about $500). If interested, call or text Nick at <br>\n <a href=\"/fb/pdx/roo/4939579743\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n thanks.\n    ",
        "image": "http://images.craigslist.org/00k0k_6QR73VlJteb_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4939579743.html"
    },
    {
        "title": "Master Room near MHCC",
        "href": "/mlt/roo/4935444104.html",
        "time": "2015-03-21 12:40",
        "price": "$475",
        "neighborhood": " (29th and Hale)",
        "postBody": "\n        Looking for a roommate to share my two bedroom apartment with at the Rivercrest Apartments near Mt. Hood Community College. <br>\n<br>\nPLEASE, if you decide to respond, read the entire ad AND do not ask if it&apos;s still available. I will take the ad down when it isn&apos;t. I promise.<br>\n<br>\nThe apartment is mostly furnished and the available room is clean and empty. The only common items I&apos;m missing from my apartment are a TV and some wall decorations. The kitchen is basically complete, plus I have couches and tables. The apartment also come with new carpet, a cement balcony (including attached storage), vaulted ceiling, dishwasher and garbage disposal. The apartment complex provides plenty of street and guest parking as well as the covered spot, a small gym, sauna, outdoors hot tub as well as friendly management. <br>\n<br>\n<br>\nAbout me,<br>\nIm 23, born and raised in Portland. I currently take care of people with disabilities for a living, I have my own car and financially support myself (as i hope you do too, but neither are a deal breaker). I don&apos;t drink alcohol very often or do hard drugs but I am an OMMP patient, so keep that in mind. I clean up after myself and I don&apos;t leave messes. I&apos;m also a very thoughtful, reasonable and respectful person who is mainly looking for someone responsible and reasonable to pay bills on time as well as a person I can trust.<br>\n<br>\n-Couples are welcome but it&apos;s also $50 more per month for rent and PGE split 3 ways.<br>\n-Refundable $150 deposit negotiable but preferred<br>\n<br>\nAnd just to be clear, $475 is the cost of the room. All other monthly bills are separate<br>\n<br>\nSo, if this sounds like a good fit then please email or call at a reasonable time and leave a message letting me know about you&apos;re current living situation, what you can afford for bills per month and any other questions about myself or the room that you may have. Other than that, good luck on your search and enjoy the nice weather while it lasts!<br>\n<br>\nPS,<br>\nIf you text or email, a picture would be great and I will send one in return<br>\n\n    ",
        "image": "http://images.craigslist.org/00n0n_jwQBBveHz0W_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4935444104.html"
    },
    {
        "title": "Room For Rent Near PCC Sylvania",
        "href": "/mlt/roo/4939573418.html",
        "time": "2015-03-21 12:39",
        "price": "$435",
        "neighborhood": " (SW Portland)",
        "postBody": "\n        Hey there, I&apos;ve got a room for rent in SW Portland now available, looking to rent by April 1st(or as soon as possible). It&apos;s less than a mile from PCC Sylvania and just down the street from the Barbur transit center(near the corner of SW Huber and Barbur). I&apos;m looking for someone who is drug and drama free, has no felonies, can pass a background check, and can commit to a minimum 6 month lease. I don&apos;t mind male or female, or possibly a couple, but I would prefer no one under 25, and you should also have steady income. Rent is $435 with around $70 or less in utilities(there&apos;s no deposit, so the total move in cost is only about $500). If interested, call or text Nick at <br>\n <a href=\"/fb/pdx/roo/4939573418\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n thanks.\n    ",
        "image": "http://images.craigslist.org/00k0k_6QR73VlJteb_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4939573418.html"
    },
    {
        "title": "****BBuilt in 2010 Excellent Location Beautiful Community Apartment***",
        "href": "/mlt/roo/4928696906.html",
        "time": "2015-03-21 12:38",
        "price": "$465",
        "neighborhood": " (Portland)",
        "postBody": "\n        ****BBuilt in 2010 Excellent Location Beautiful Community Apartment****<br>\n<br>\n2 bedroom 2 bath over 2000 square foor home.   <br>\nEnter into a huge great room with bright lighting an plenty of windows.   <br>\nThe kitchen features a fridge, dishwasher, microwave and stove.   <br>\nOn the main floor there also is a dining area,   <br>\ntwo large bedrooms with hardwood floors and a full bathroom.   <br>\nIn the basement is a famiy room, two more non-legal bedrooms and another full bathroom.   <br>\nThe basement also features a second fridge, washer dryer and cabinets.   <br>\nOther features of the home are large shop/garage, tall ceilings, water sewer and trash included.  <br>\n<br>\n<b>Contact Now :::&gt;&gt;        Room.picture.at.vu/<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</b>\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4928696906.html"
    },
    {
        "title": "Bright 1-bedroom, close-in SE! 83 Walk/Bikescore! VIDEO WALKTHROUGH",
        "href": "/mlt/roo/4927412793.html",
        "time": "2015-03-21 12:29",
        "price": "$895",
        "neighborhood": " (United States)",
        "postBody": "\n        This cute, bright 1-bedroom, 1-bathroom is now available at SE 54th and Foster!<br>\n*600 square feet<br>\n*New carpets<br>\n*New paint<br>\n*Gas range<br>\n*Secure storage room in basement (5 feet x 10 feet)<br>\n*Vintage molding throughout<br>\n<br>\n*Walkscore of 83: most errands can be completed on foot<br>\n*Bikescore of 82: flat as a pancake, and the city is adding bikelanes all along Foster Blvd<br>\n*Your choice of the 14, 17, and 10 bus lines<br>\n*Only 4.4 miles to downtown<br>\n<br>\nVIDEO WALKTHROUGH: https://www.youtube.com/watch?v=QcvjoE3JaDQ <br>\n<br>\nThis cute, vintage building is both smoke-free and pet-free.  <br>\n<br>\nWe require a refundable security deposit of $850, but we do NOT require &apos;last month&apos; rent at move-in.  All rental applicants will be screened for tenant, credit, and criminal history.  There is a $35 application fee, which will be deducted from your first month&apos;s rent.<br>\n<br>\nWater, sewer, garbage, and recycling are provided.  You are only responsible for electricity and gas!<br>\n<br>\nLike us on Facebook to see all openings:  www.facebook.com/BootstrapInvestments<br>\n<br>\nCall Barry at \n <a href=\"/fb/pdx/roo/4927412793\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "image": "http://images.craigslist.org/00Y0Y_cNKl4wEF9Nk_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4927412793.html"
    },
    {
        "title": "Great room in nice bungalo close in April-June $400.00",
        "href": "/mlt/roo/4942771906.html",
        "time": "2015-03-21 12:28",
        "price": "$410",
        "neighborhood": " (No Po close in)",
        "postBody": "\n        Hi thanks for taking a look at the post,   <br>\n<br>\nI have a room available April  through June,   $400 plus $ 75 utilities due on 4th , with $300 deposit<br>\n<br>\nDetails  <br>\n<br>\nLarge room on Main floor of 1920&apos;s bungalow,  hardwood floors , classic charm<br>\n<br>\nYou would share main bathroom with one other person only,<br>\n<br>\nIt can be partially furnished if you like, Desk and dresser, just let me know.<br>\n<br>\nHouse is located a few blocks from New Season, yellow line and a 10 minute walk to PCC,<br>\n<br>\nWe have a nice BBQ area your welcome to use,  share kitchen <br>\n<br>\nLooking for a really chill person, grown up cleans after themselves, no drama <br>\n<br>\nI work 7-5 M_F    <br>\n<br>\ncurrent resident s are Mid 30 s <br>\n<br>\nHappy room hunting,<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942771906.html"
    },
    {
        "title": "Rent front half of my house April 1st, May 1st",
        "href": "/mlt/roo/4935444513.html",
        "time": "2015-03-21 12:26",
        "price": "$640",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        Hi my name is April and I am a single working girl in my late 30&apos;s looking for a working professional with stable income 30 or older working one single mellow girl/guy to share half of my one story home. April 1st anytime in April, or May 1st! <br>\n<br>\nKids here would not be good full time as it is only a one bedroom, small closet, and they would not have their own room to sleep and as well as a yard even.<br>\n<br>\nPets may consider 1 small dog or 1 or 2 indoor cat if they are to do no damage to my home, and you pick up after your pet, Litter box extra, but no pets might be best. I have a rabbit and a cat, and they both live on my side of the house, will not go to your side of the house.<br>\n<br>\nClose to SE 52nd and Woodstock area with your own front door entry. I prefer someone who already lives in Oregon, or at least I am able to meet you to know if this would work out or not. I live in the back of the house, where I have my own entry and we both share the middle kitchen and laundry would be on site. <br>\n<br>\nYou would get one bedroom 10x12 with small closet fit for one person, your own bathroom with a tub, and the front living room of the home to yourself with a door that would lead to you going to the kitchen in the middle of the house. The area you will be renting isn&apos;t a small area; it is like renting a 1 bedroom apartment without kitchen. This area has hardwood floors, your bedroom has carpet and the bathroom has nice big tiles. Lots of windows in the living room space.<br>\n<br>\nWould like someone who is clean, honest, trustworthy person who won&apos;t cause no damage to the home/things in the home, is respectful, will be able to communicate to me. As well someone who will pay rent on time as this goes towards my mortgage and this is very important to me. Prefer none cigarette smoker, if you smoke it is to be outside off the property but 420 friendly, (no other drugs) OMMP friendly can&apos;t grow here due to old electricity at this time, and there is street parking.<br>\n<br>\nRent 640.00, 320.00 refundable damage deposits, do to any damage that could be, or it can go towards the last months bills that you will have before you move. I rent every six months with a lease that when u sign it will state; if you brake the lease, you pay 320.00 plus I keep ur 320 deposit, and you pay the last months rent with bills. If things work we can renew the lease for the next 6 months. I require at least 2 months notice in advance if you decide you want to leave so I am able to get a new renter, as this will be in the lease too. Rent will be increased a little after every year of being here.<br>\n<br>\n1\\2 utilities Internet WIFI Comcast 33.00 a month, Gas, Water, Electricity, Garbage. Water is every three months and is around $269 to $365. Garbage is every two months $30.00. Gas and Electricity very on summer to winter months and how often the Gas heat is on in the winter months since the bills is affected by both, summer is the cheapest time for gas and electricity. Bills for the home can be very reasonable as long as you be self conscious about them with gas and electric and water. Bills come at the end of each month so paying rent with bills in the beginning of each month is how this would work. No TV service in the home as I only pay for internet and watch my shows online.<br>\n<br>\nI can meet Tue-Fri after 4pm or so, then the weekends too. If you are interested please email me, or text me with your name and a little about yourself, age extra. I can show you the side you be living in when meeting, and the kitchen too.<br>\n<br>\nThank you. April\n    ",
        "image": "http://images.craigslist.org/00F0F_8IXK90eCJzL_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4935444513.html"
    },
    {
        "title": "- - House Share - - Furnished Home",
        "href": "/mlt/roo/4942757047.html",
        "time": "2015-03-21 12:19",
        "price": "$695",
        "neighborhood": " (West Moreland/ Sellwood)",
        "postBody": "\n        Greetings. <br>\n<br>\nCurrently we are looking for a housemate to rent on a 6 month lease. The bedroom available is located on the main floor of the home. The home is a three bedroom, two bath with a basement and garage. There are two bedrooms upstairs and one downstairs. In the downstairs bedroom/ bath, the current occupant is a student who attends Reed College. The monthly payment of $695 is inclusive of rent, electric, gas, water and garbage services.  <br>\n<br>\n<br>\nBlurbs about the home:<br>\n- Located near SE 23rd and Bybee<br>\n- Hardwood floors <br>\n- Easy and reliable street parking &amp; storage for your bike<br>\n- Central heat and cooling (great for the upcoming summer!)<br>\n- Washer &amp; dryer in unit<br>\n- Gas furnace and stove<br>\n- Covered porch and patio <br>\n- Wood-burning fireplace<br>\n- Planter boxes and gardening area available in backyard, fully fenced<br>\n- No pets allowed <br>\n- Bi-weekly yard service included<br>\n- All utilities are included in the price of the rent<br>\n<br>\n<br>\nHere are some details about the neighborhood:<br>\n- Sellwood/ Westmoreland is a very family-oriented <br>\n- Easy access to the Spring Water Corridor for those who commute via bicycle<br>\n- Near the 19 and 70 bus line - blocks away!<br>\n- Orange MAX line will be opening in January and will be blocks away as well<br>\n- Centrally located to restaurants, shops, grocery stores, cafes and a park all in walking distance <br>\n- Close to Reed College &amp; Portland State University<br>\n<br>\n<br>\nWe welcome LGBTQ individuals, patrons of Farmer&apos;s Markets, cyclists, 420, co-op supporters and down-to-earth housemates! My name is Devin, please email or text me with the address listed above if you are interested and would like to view the home. Please include a description about yourself. Please, serious inquiries only. <br>\n<br>\nGood luck on your search.\n    ",
        "image": "http://images.craigslist.org/00r0r_k3cgGO0C37Q_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942757047.html"
    },
    {
        "title": "Room for rent in Private home in Northeast Portland",
        "href": "/mlt/roo/4942632924.html",
        "time": "2015-03-21 12:14",
        "price": "$480",
        "neighborhood": " (Portland/Woodvillage area)",
        "postBody": "\n        I have for rent on a month to month basis a bedroom in a private residence in Northeast Portland you would have your own bedroom and bath with access to the entire house and yard. You should be a older female 18+ no children small dog only non smoker and no sleepovers. The home is located close to the bus line, College/University, freeway access, Parks and Recreation and Shopping Malls. The home is located in the area of 194th. Ave. and Glisan. This is a 3 bedroom 2 bath home that has Air conditioning, Alarm system, Balcony/patio, Cable/satellite, Dishwasher, Fireplace, High speed Internet, Laundry facility, Washer/dryer in unit, Microwave, Parking, Yard. <br>\n<br>\nIf this sounds like a good fit for you, please email me a little bit about yourself(Name ,Job ,Contact Number)  and we&apos;ll set up an appointment for you to come see the room and meet us! <br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942632924.html"
    },
    {
        "title": "Room mate needed for down town apartment!",
        "href": "/mlt/roo/4942723917.html",
        "time": "2015-03-21 12:00",
        "price": "$750",
        "neighborhood": " (United States)",
        "postBody": "\n        Hi!  Does the room share hunt have you in the dumps?  Fret no more!<br>\n<br>\nI&apos;m looking for someone who wants to find an apartment in downtown/Pearl/Southwest/northwest part of Portland. Finding that perfect room mate situation in the perfect place can be a game of blind luck.  I don&apos;t know about you, but I don&apos;t like to settle for less than I want.  So lets shake things up and find the perfect room mate, then find the perfect place in a killer part of town.  <br>\n<br>\n<br>\nAbout Me:<br>\n<br>\nI&apos;m a 30 year old professional male presently working for an environmental non-profit.  I&apos;m an avid snowboarder, runner, camper, sports fan (I&apos;ll watch anything with a ball), and enjoy going to shows.  I try to maintain a healthy life style, but still allow myself to enjoy the finer points of greasy foods and beer.  I&apos;m a pretty laid back guy who appreciates a clean and tidy space.  <br>\n<br>\nI&apos;m pretty open to who my new house mate will be.  I prefer a 25-35 clean and responsible individual who has ambition and is focused on what they want in life.  Preferably, someone who communicates well, wants to socialize on occasion, but also has their own circle of friends.<br>\n<br>\nIf you&apos;re also an amazing person who is just wanting to live in a great space in Portland, shoot me a text.  We can grab a coffee and see if we&apos;d make great house mates.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942723917.html"
    },
    {
        "title": "COUNTRY LIVING ON NW PORTLAND FARM",
        "href": "/mlt/roo/4935451201.html",
        "time": "2015-03-21 11:52",
        "price": "$600",
        "neighborhood": " (NW PORTLAND)",
        "postBody": "\n        We are looking for a single renter that is animal wise or willing to learn to be able to tend to our sheep and horses when we occasionally take a trip for $$ off their rent.  The bedroom is 12 X 14 feet with a large closet fully furnished,  we provide all linen and towels and all cooking pots, pans and dishes.  Approximately 11 miles from Intel, DT Portland and Scappoose .  Kitchen, laundry, bath and all utilities included.  Very private home in the country.  Hiking, biking area next to the new metro Forest Park.  We plant a large garden each Spring and have laying hens that can help with your food expense if you are willing to help tend to them.  All 4 of our horses are in their twenties and our sheep are easy care.  We also will deduct from rent any additional labor you might want to help with like; fencing, firewood, landscaping, etc..  A long term renter would be good but 6 months is also OK.  No smoking in house or outbuildings, no dogs as we have 3 of our own, no overnight guests or day guests without our permission and NO DRUGS!!!  For further information please call or email us and we can set up an appointment\n    ",
        "image": "http://images.craigslist.org/01212_leQTHOwNuBw_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4935451201.html"
    },
    {
        "title": "Room Available in NE Portland",
        "href": "/mlt/roo/4937848869.html",
        "time": "2015-03-21 11:51",
        "price": "$600",
        "neighborhood": " (5334 NE Wygant St)",
        "postBody": "\n        Looking for a couple to move in and share a room in the Cully Neighborhood. I need a couple to maintain affordable rent. I would take the smaller of the house&apos;s two rooms. <br>\n<br>\nThe house is cozy, and fairly modest as far as size goes. It is a 2 Bedroom/1 Bath house in a secluded little section of 6 identical homes. There&apos;s a yard with a garden and a composting area. There are solar panels on the roof and a garage that is mostly used for storage at the moment. The laundry room, which has a brand new washer and dryer, is also attached to the garage. The kitchen has a brand new gas stove and dishwasher. The bedroom for rent has a couple big windows which let in plenty of natural lighting. <br>\n<br>\nThere are no pets here currently but dogs and cats are both welcome!<br>\n<br>\nDETAILS: <br>\nRent is usually around $600/person give or take. (This means a total of about $1200/month for the couple.)<br>\nThe total rent is $1,595/month not including utilities. <br>\nPet Rent of $25/month.<br>\nUtilities range from $40-$70/person depending on usage. <br>\nThere is a $500 deposit per person before moving in.<br>\n<br>\nAbout you: <br>\nDrama free couple <br>\nCleanliness/General Courtesy<br>\nRelaxed and stress free<br>\nRespectful of space and other people&apos;s belongings <br>\n<br>\nAbout Your Roommate:<br>\nBen is 25. He studied literature and history and loves to read. He works at Ikea while waiting to find a job in editing. He is often at home making food, playing video games, and just relaxing. <br>\n<br>\nSend an email or text Ben if you&apos;re interested and include a little bit about yourself.\n    ",
        "image": "http://images.craigslist.org/00k0k_bunzO0J8DND_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4937848869.html"
    },
    {
        "title": "and utilities. Share our friendly, clean, mature and dog-loving home.",
        "href": "/mlt/roo/4942693136.html",
        "time": "2015-03-21 11:47",
        "price": "$385",
        "neighborhood": " (Erroll Heights)",
        "postBody": "\n        I have an unfurnished bedroom to rent to a single individual in our friendly and comfortable home. (Please do not contact me if you are more than one person or if you wish to bring your cat or pets other than dogs). We currently have a mix of genders and an age range of 50 - 75 but are open to any aged housemate. We pick up after ourselves and always treat each other with respect. Good communication and plenty of laughter abound here.<br>\n<br>\nSince I always get phishing responses to these ads,  I will not reply if you send me a message that only asks me to contact you, or only asks if the room is still available. Please tell me a little about yourself and your work schedule/home lifestyles when you reply. <br>\n<br>\nWe have 4 bedrooms, 2 full bathrooms, and no more than 4 of us live here at any time. There is plenty of room for both private time and shared activities.<br>\n<br>\nThe house is no smoking (of any substance) and no one does more than light drinking. Our professions are varied - business manager, landscape architect/arborist, and hospice social worker. Our hobbies /interests include cooking, bicycling, frisbee golf, boat building, gardening, herbology, watching movies, spinning, weaving and sewing. All food preferences are welcome. But you do have to like dogs, even if you do not own one. You also have to be willing to live fragrance-free -- more on that follows<br>\n<br>\nThe available bedroom is on the main floor of the house and is 10 x 10. It will comfortably hold a Full or Queen size bed and a dresser and desk. It has a small walk-in close as well as its own hallway closet. It has windows on two walls and bright afternoon light. You will share a full bath with one other person and have your own off-street parking space and extra basement storage.<br>\n<br>\nThe room rents for $ 385/month. Per person, utilities average $115- $135/month. This includes EVERYTHING - water and sewer, trash, cable TV (only basic channels), high speed internet, gas, electric, and yard maintenance. The $50 screening fee pulls a public records report and summary of your credit standing (not a full credit report, none of your accounts are revealed). The security and pet deposits are fully refundable. I ask for a $500 security deposit and if you have a dog, a $100 pet deposit. I am open to spreading out the deposits over a couple of months and I do not ask for last month&apos;s rent unless a person has very bad credit or rent payment history.<br>\n<br>\nTwo dogs will live here when you move in and we can easily handle one more. The two current pooches spends most of their time with their person and are 10 years old fairly docile. All furry friends must be non-aggressive, peaceably share space with others, be well mannered, and be kept clean and flea treated with Frontline, Advantix or Comfortis.  &quot;Yappers&quot; or even large dogs that bark a lot will not work well here.  We all like and know dogs, and every dog owner that has ever lived here has told me how good they felt about having their dog stay with us. We often help each other with occasional pet sitting, or putting someone else&apos;s dog outside or feeding, when s/he has to work long hours, etc. <br>\n<br>\nThis is a 1900 sq ft older home in the Errol Heights neighborhood. We occupy a pocket of Portland, that while not too far from most &quot;happenings&quot;, is loaded with old growth trees, green spaces, wild peacocks and occasional coyotes. We are surrounded by large lots and friendly neighbors. Away from any main thoroughfare, the primary noises here are a beautiful symphony of birdcalls when in season and rustling trees. <br>\n<br>\nThe home has central gas heat and A/C; washer/dryer, and dishwasher. All floors are wood --(although old and somewhat marred). We have high speed wireless internet in every room and on the deck. There is a large deck, fenced in vary large yard, and a community garden one block away. If you wish you can begin a garden on the grounds.<br>\n<br>\nWe maintain a &quot;clean air&quot; home - avoiding products that off-gas fragrances and other fumes. I can explain this better when we speak with each other - but the simple explanation is that things like our soaps, lotions, shampoos and laundry products are all fragrance free (I provide up to $35 in refunds for the cost of replacing your current items.) Items that off-gas fumes, such as hair gels and nail polish cannot be used.  <br>\n<br>\nCommuting times: We are a 5-minute walk to the 75 bus line and a slightly longer walk to the 72. We are very close to Johnson Creek and the Spring Water Corridor and bike paths. Driving times in good traffic: to Reed College, 7 minutes; to inner SE, 10 minutes; to downtown 15 - 20 minutes; to Clackamas Town Center or the Home Depot on SE 82nd about 15 minutes. <br>\n<br>\nIf all of this sounds like what you are looking for, please reply and tell me a little about yourself and your lifestyle, and tell me how I should contact you. <br>\n<br>\nGood luck in your home hunting-\n    ",
        "image": "http://images.craigslist.org/00T0T_biVt2mEdUN5_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942693136.html"
    },
    {
        "title": "looking for 420 friendly female roommate",
        "href": "/mlt/roo/4942669439.html",
        "time": "2015-03-21 11:47",
        "price": "$300",
        "neighborhood": " (fairview)",
        "postBody": "\n        looking for self  employed or one a fixed income female to live with. Companionship needed<br>\n<br>\n3 bedroom 2 bath house<br>\n<br>\n1 cat door<br>\n420 friendly<br>\nbackyard<br>\nstorage<br>\n300 month all inclusive<br>\n<br>\nlike to cook<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942669439.html"
    },
    {
        "title": "* Spacious room is prepared for rent ! Internet available *",
        "href": "/mlt/roo/4933237388.html",
        "time": "2015-03-21 11:36",
        "price": "$550",
        "neighborhood": " (Portland)",
        "postBody": "\n        I have nice rooms for rent which is close to everything.<br>\nThere is cable TV and internet in each room. I furnish all bedding, towels and toilet paper.<br>\nIt is like staying at a nice bed and breakfast. There is a pool and hot tub.<br>\nThere is a park with walking trails and work out area across the street.<br>\nI have two rooms available at this time.<br>\nTotal cost with utilities electricity, water, and gas is 550.00 a month.<br>\nYou will love living here with happy, positive people.<br>\nDrugs are not permitted inside the house.<br>\nSmoking outdoors is OK. This is a very nice area.<br>\nDeposit Required. Pets are not allowed.\n    ",
        "image": "http://images.craigslist.org/00505_9cfbUjWeAzM_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4933237388.html"
    },
    {
        "title": "Cute Room in Clean and Relaxed Belmont/Hawthorne Home $650 + Util",
        "href": "/mlt/roo/4935639291.html",
        "time": "2015-03-21 11:35",
        "price": "$650",
        "neighborhood": " (Belmont)",
        "postBody": "\n        ####<br>\nQuick note: To save ourselves time and hence get back to people faster we&apos;re having people apply using a simple form rather than having emails drop into one person&apos;s inbox. It&apos;s super easy we promise! (We still take email but the form is much preferred.)<br>\n<br>\nHere&apos;s the super fast and easy form for applying:<br>\n<br>\nhttps://docs.google.com/forms/d/1tmhHa_pc8gKz_K7_0wwAzEU6iakkKYfMDsPwi_PhQAw/viewform?usp=send_form<br>\n####<br>\n<br>\nHello There,<br>\n<br>\nWe&apos;re currently a house of 3 looking to fill an empty room here in SE.  Ideal candidate is mid 20s through 30s, who&apos;s easy to get along with, picks up after themselves, is working towards things in their life (work or otherwise), enjoys being sociable with the roomies on occasion, and is OK living in a house with generally busy people.<br>\n<br>\nThe house is really nice and has an amazing location; we&apos;re centrally located near 29th between Belmont and Hawthorne. Groceries, multiples bus lines, bike paths, coffee shops, music venues, bars, restaurants, movie theaters, and the like are all a 3-10 minute walk.<br>\n<br>\nRoom in questions is $650/month + utilities which vary from about $38/mo summer to $70/mo winter. Room is available April 4th (though we may be able to push it to the first if needed). Lease is 6 months, then month to month.<br>\n<br>\nWe know that looking for housing on Craigslist is no fun so we&apos;ve got some basic requirements to save us both some time.<br>\n<br>\n-6 Months stable employment or in school with a demonstrable income.<br>\n<br>\n-No pets (Charlie who&apos;s in the pics below got grandfathered in, but he&apos;s on his way out)<br>\n<br>\n-Before we can offer the room we&apos;ll need 2 references from former roommates (though you don&apos;t have to provide them to see the house and meet us).<br>\n<br>\n-The room is for one person only. Apologies to couples.<br>\n<br>\n<br>\nThe room is really one and a half rooms, one ~ 9&apos;x12&apos; spot where you&apos;ll probably put your bed and the like, but connected to that is your own windowed sun room that looks out over the back yard ( ~ 6&apos;x12&apos; ).  It&apos;d be a great spot for a desk or a lounging chair; it&apos;s small but very awesome.<br>\n<br>\nOtherwise the house has a great big downstairs with a nice kitchen and a decent sized very private back yard.<br>\n<br>\nAs stated above there&apos;s currently 3 people in the house. S has a landscape architecture degree on top of being in graduate school; B works at a local university doing video, and D works at a tech recruiting firm when he isn&apos;t putting his years of kitchen experience to use.<br>\n<br>\nThe pics of the room below aren&apos;t the room in question but its twin across the hall. (The room in question currently has a bunch of stuff in it and is hence not photogenic) The room that&apos;s up has a smaller closet but more square footage.<br>\n<br>\nWe&apos;ll be setting up meet and greats with people the evenings of the 22nd and 23rd (Sun and Mon). If those dates don&apos;t work for you we can try and set something else up as well. We prefer to interview everyone before making any kind of decisions so there&apos;s no benefit to showing up Sunday rather than Monday.<br>\n<br>\n(Also, I have no idea what CL means by &quot;Private Room&quot;; it doesn&apos;t have its own entrance to the outside, but it does have a door and people don&apos;t walk through it to get to the kitchen or anything like that.)\n    ",
        "image": "http://images.craigslist.org/00h0h_jrwhKvnfSzR_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4935639291.html"
    },
    {
        "title": "Private Furnished Upstairs ~ Conscientious Clean Shared House ~ $500",
        "href": "/mlt/roo/4929293146.html",
        "time": "2015-03-21 11:35",
        "price": "$500",
        "neighborhood": " (Lents)",
        "postBody": "\n        *Our 4 bedroom home already houses 3 working adults and 2 delightful canines with room to spare.    The upstairs consists of a bedroom and small office.  It is available now.  Will be month to month, refundable $500 deposit, and $500 monthly fee due the beginning of each month (includes utilities). We are right off Foster, 82nd Ave, I-205, Glenwood Park, Clackamas Town Center, Woodstock neighborhood, Reed College, and major bus/max lines and bicycle route (Spring Water Corridor) which all go directly to downtown Portland and elsewhere for easy commuting.  If you own a vehicle there is plenty of street parking.  <br>\n<br>\n*We are not taking any couples, additional pets, children, etc.  However we do not discriminate based on race, gender, age, sexual orientation, food preference, etc. <br>\n            <br>\n                         ~ RESPONSIBLE - We ask that you lock the house when nobody&apos;s home.  Latch the gates behind you and make sure the dogs didn&apos;t slip out in the process.  Don&apos;t leave dishes for more than a day or two in the sink.  Fill the dog bowl if it happens to be out of water.  Have a job or reliable income.  Give 30 days notice before moving out.  Only invite over trusted loved ones who will also uphold the ambiance of our home.  <br>\n<br>\n                        ~ CONSCIENTIOUS - Show an eagerness to add to the positivity and comfort of the overall energy and atmosphere in our home with simple actions such as picking up after yourself, sharing basic chores for the communal areas, having basic manners.  We make an effort to keep noise down when anyone&apos;s sleeping (dogs bark occasionally), but since each bedroom is on it&apos;s own floor the noise doesn&apos;t travel as much.<br>\n                      <br>\n                       ~ COMPASSIONATE - We all love animals, nature, truth, art, science, and people from many walks of life.  I am partial to Buddhism, yoga, meditation, The Grateful Dead, hot springs, and relaxation.  I strive to be straight forward and direct but still very considerate and empathetic.  I don&apos;t like cynicism and sarcasm.  If you have something to say just say it respectfully.  I will consider suggestions or requests from all house members to keep life peaceful and comfortable for everybody.  You will not need to join the house lease.  We are mostly vegetarians but ok with meat in the house.<br>\n  <br>\n                      ~ COMMUNITY - Have you ever lived in a communal setting before?  What types of communities are you already an active member of?  Do you have a boyfriend/girlfriend and how often do you plan to have company over?  Do you identify with any religious orientation?  These are the things we want to know that will enable us to tell you whether or not we will a good fit.<br>\n<br>\nA LITTLE ABOUT OURSELVES:<br>\n<br>\nJessica - I&apos;m 26 years old.  Bartender and full time student at PCC&amp;PSU.  I love my boyfriend and our dogs.  The house and bills here are solely in my name and will remain so.  The owner is a lovely lady who lives in Kansas so you will deal directly with me.  I grew up on a farm near Silverton where I spent most of my first 18 years getting to know nature, growing/cooking food, and riding/training horses.  Most of the time I am busy with work, school, and taking care of the house/dogs.  In my free time I like to get out as much as possible - hiking, swimming, beach, hot springs, mountains, desert, gatherings/festivals/events. I am always friendly, but sometimes quiet.  <br>\n<br>\nJsun - My partner of 2 years.  39 years old.  Jsun has worked for OCF and BRC and a variety of other jobs.  He is from New York and tells it like it is.  Jsun is good with people and problem solving.   <br>\n<br>\nBandit and Tela - Our 2 awesome lovable dogs.  You must love and have a good general understanding for dogs.  These are both very sweet and special spirits of our home.  Bandit is my dog and stays with me always.  He is a  4 year old Blue Heeler.  He is calm in the home and a maniac for fetch when he is outside.  He gets 2 to 3 trips to the park across the street for fetch every day due to his need to run run chase chase. He doesn&apos;t bark often, but when he does ocassionally see a critter or intruder of some kind in the yard he can get a little loud, but settles down quickly.  I sometimes offer our roommates/friends money or trade in exchange for dog sitting for a weekend or more now and then.  If that is something that interests you then that&apos;s a big plus.   Tela is Jsun&apos;s puppy, she is a super sensitive and silly 6 month old Olde English Bulldogge.  If you know anything about them she is a big couch potato.  She is usually cuddling on the couch with us or her blanket and watching TV or listening to the local radio jazz station or Grateful Dead shows.  She is strong and does like to rough house and play tug of war, usually with bandit. Their growling and chasing can get a little loud sometimes but they settle down pretty quickly.  Neither one has a mean bone in their body.  <br>\n<br>\nChad - this is our other tenant who rents half of our basement which includes a bedroom, bathroom and den.  He is an easy going 30 something bachelor that works nights, sleeps days, and so is rarely seen.  The basement also contains the laundry which is shared, as well as a small 4th bedroom which will be used as storage.<br>\n<br>\nWe will be subleasing our upstairs by the end of the month.  It is about 14&apos;x10&apos;.  Keep in mind the ceiling is only about 7&apos; high and slanted on the sides so a lot of normal furniture will not fit. The room thus far has served as a guest room and is already semi - furnished, as you can see from the pictures which aren&apos;t very good it has some junk accumulated in it that will be gone before you move in. If you want to use the coffee table, futon, chairs, closet, table, and other items already in the room you are welcome to them.  At the bottom of the stairs to the right is my office and library.  To the left is the living room.  Through this is the kitchen with lots of cabinet space.  Then there is a hall where the bathroom is located and next to that is my bedroom.  In the kitchen you will have space for food, but we already have dishes and utensils to spare.  The bathroom has a small clawfoot bathtub/shower, toilet, and sink, but is somewhat limited on space.  <br>\n\n    ",
        "image": "http://images.craigslist.org/01515_6jEY89NDsh2_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4929293146.html"
    },
    {
        "title": "APRIL 1st! Room in unique house available",
        "href": "/mlt/roo/4942623124.html",
        "time": "2015-03-21 11:19",
        "price": "$400",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        We will have a room available on the upper level of our 6 Bedroom / 3 Bathroom tri-level house by APRIL 1st. It&apos;s a smaller room that would be a great transitional space for someone just moving to Portland, best suited for someone with a busy life, someone who travels or works a lot, or maybe someone who reads, sleeps, or is on the computer a lot when they&apos;re home, and doesn&apos;t have a lot of stuff. <br>\nWe are seeking a kind, fun, considerate, friendly person - really, someone who would fit in comfortably here, and appreciate being a part of our unique household with all that it has to offer. <br>\nWe are an interesting blend of men &amp; women of various ages - an eclectic mix of the kind of people that make Portland such a great place to live - artists, students, baristas, skateboarders, bike riders, hikers, internet entrepreneurs, musicians. We are all fairly introverted and share a variety of common interests. We are all kind, respectful, creative, art-oriented, comedy, literature, music &amp; movie loving liberals, with widely varied schedules, and active lives. <br>\nWe also have 2 cute, small, nice dogs, and a friendly (mostly outdoor) cat. <br>\nThe addition we are seeking will be considerate, friendly, and responsible; have a great sense of humor and be easy to talk to; like animals, but preferably have none of their own; have stable finances and an active life; not be a big drinker; not need to have overnight guests; and willing to do the majority of their socializing away from the house. <br>\nThis is a very respectfully 420-friendly household, but no smoking or open flames in the house.<br>\nWe are mostly meat-eaters, but we do welcome tolerant vegetarians/vegans.<br>\nThe house has a nice fenced backyard with fountains, and some gardening space is available. <br>\nWe&apos;re located within a short walking distance to several buses and MAX lines (#15 Belmont, #20 Burnside,  #4 Division, the MAX Greenline and Blueline).<br>\nThe house is in a quiet, safe, residential neighborhood within easy walking distance to many useful amenities. We are very close to Mall 205 (Please ~ be sure to mapquest zip 97216 or look up Trimet stops #11027 or #11411 before responding to determine if the location will work for you). Near a Dollar Store, Big Lots, Target, Home Depot, and many other useful shops, businesses, and restaurants. The Eastside Community Center is only three blocks away, and it offers lots of great classes, an awesome new pool, a weight room, and outdoor track. Adventist Hospital (where there is a vegan bistro) and the East Portland police station are also very close to our house. Powell Butte and Mt. Tabor are nearby for spontaneous hiking and biking. We are very centrally located with a freeway exit to I-205 only a couple minutes away. Bike riders - we are close to bike paths AND we have our own in-house bike mechanic!<br>\nIt&apos;s $400/month, which includes utilities. Furnished, possibly.<br>\nApplicants offering First + Last are preferred (possibly negotiable).<br>\nInterested? We hope to hear from you!\n    ",
        "image": "http://images.craigslist.org/00808_5Vr8KtsuOwS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942623124.html"
    },
    {
        "title": "Share large house with 1 others person near Alberta",
        "href": "/mlt/roo/4902949835.html",
        "time": "2015-03-21 11:14",
        "price": "$500",
        "neighborhood": " (35th and Killingsworth)",
        "postBody": "\n        I&apos;m renting out the room on the top floor with a private bathroom to 1 person . The bathroom has a claw foot tub but no shower . There is a shower downstairs that is shared. This room is huge ! Big walk in closet , large windows and sky lights . There is a landing area perfect for an office, all carpeted, and with tons of storage space. The shared spaces in the house are the living room ,kitchen, and shower. There&apos;s a beautiful yard with a garden and side porch area. <br>\nThe downstairs is all hard wood floor, washer and dryer in the house , storage shed available and an amazing kitchen with gas range! The house is located in the Concordia neighborhood. Just a short walk away from Alberta, Killingsworth, and the Concordia New Seasons/Walgreens/Hot Lips etc . <br>\n<br>\nThe house also comes with Mahjong an old lady Husky Corgi mix who captures the hearts of many. Im open to a well behaved and charming cat :) <br>\n<br>\nMe: Professional , works full time as a Social Worker, I am 34 years old. Queer. I have lived here for 2 years. I keep busy and enjoy cooking up a storm in the kitchen and relaxing in the living room. I have friends over for meals and am also out a lot. <br>\nYou: It&apos;s important to have a housemate that is compatible on important things like respect, communication, general cleanliness, and can be quiet at night. If you are similarly described, &amp; would enjoy a tidy home to re charge, enjoy and have a sense of humor please email me!<br>\n<br>\n-The room 500$ a month + utilities . Total move in costs are first+last rent +375 security deposit . Utilities are electric, gas, water (every 3 months) and internet. <br>\n<br>\nMisc:<br>\nThere are fruit trees (plum, cherry, asian pear, kiwi berries and a grapes) And some yard work to do ( weeding, mowing etc) There are 3 raise beds to plant in.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4902949835.html"
    },
    {
        "title": "Room for Rent",
        "href": "/mlt/roo/4934833039.html",
        "time": "2015-03-21 11:11",
        "price": "$500",
        "neighborhood": " (Gresham, OR)",
        "postBody": "\n        We have a room available in our large 5 Bedroom, 2.5 Bath house in the Gresham area, just off of Powell Valley and 282nd. This house is in a quiet, newer subdivision that is only a couple miles from downtown Gresham &amp; Mt Hood CC. <br>\n<br>\nIn the house:<br>\nHome security center<br>\n*5 shared living areas or rooms<br>\n*A full kitchen with all stainless steal appliances<br>\n*2 refrigerators with lots of kitchen space<br>\n*8 TVs with Direct TV DVRS<br>\n*Full Direct TV package with sports packages<br>\n*High speed internet<br>\n*A Gym which includes: bench press, apex machine, free wieghts (dumbells and barbells), speed bag, punching bags, treadmills and mounted TV<br>\n*Pool Table<br>\n*Hot tub <br>\n*Dart Board<br>\n*Large back deck with tables and chairs<br>\n*The back yard is fully fenced<br>\n<br>\nThere are currently 4 people living here, we are all in our 20&apos;s or early 30&apos;s and would like to have another roommate around the same age that is goal/work oriented and not into using or parties. We all have different work schedules so the house is quiet for the most part and always kept clean. Male or female, just no couples. Thanks!<br>\n<br>\nFor consideration please provide a short summary of your story and expectations for living in our home. Things to also mention:<br>\n<br>\n*Your current Job?<br>\n*How you wind down your evenings?<br>\n*What you do for fun?<br>\n*Any children or animals?<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00b0b_cFycrYOwh6g_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4934833039.html"
    },
    {
        "title": "Roommate wanted, Large house w/ 3 others",
        "href": "/mlt/roo/4942637085.html",
        "time": "2015-03-21 11:10",
        "price": "$600",
        "neighborhood": " (Raleigh Hills)",
        "postBody": "\n        Greetings!<br>\n<br>\nWe&apos;re looking for a fourth roommate to help fill in our house. We live in a four bedroom, three bathroom house in the Raleigh Hills/Beaverton area. Rent plus utilities is around 550-600 a month.<br>\nWe are three young men in our twenties, all with full time jobs. If you&apos;d like more information or pictures send me an e-mail, we&apos;re hoping to get someone in here quickly.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942637085.html"
    },
    {
        "title": "furnished room, includes utilities/wi-fi",
        "href": "/mlt/roo/4914454183.html",
        "time": "2015-03-21 11:08",
        "price": "$525",
        "neighborhood": " (SW PDX/OHSU)",
        "postBody": "\n        Furnished guest room for ONE person. Female preferred (1 1/2 shared bathrooms with two female housemates).<br>\n<br>\nAvailable JUNE 1, 2015, Month/month.<br>\n<br>\nThis is in a large West Hills private home, near OHSU/VA. Beautiful, quiet neighborhood and within walking distance of many amenities:<br>\n<br>\ngrocery store, farmer&apos;s market, bakery, library, banks, post office, restaurants, pubs, coffee shop, and more. <br>\n<br>\nNearby bus stop: #43, 44, 54, 55, 56, 65x, 39. Fifteen minutes from downtown.<br>\n<br>\nPlease<br>\nNo smoking inside or out<br>\nNo pets<br>\nNo drugs (incl. 420)<br>\nNo overnight visitors<br>\n<br>\nPlease give your background and employment  information and your phone # in your response.<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4914454183.html"
    },
    {
        "title": "APRIL 1! Room available in unique house for friendly introvert",
        "href": "/mlt/roo/4937184955.html",
        "time": "2015-03-21 10:57",
        "price": "$400",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        We will have a room available in our 6 Bedroom / 3 Bathroom tri-level house by APRIL 1st.  It is a smaller room that would be a good transitional space for someone just moving to Portland, it would be best suited for someone with a busy life, someone who travels or works a lot, or maybe someone who reads, sleeps, or is on the computer a lot when they&apos;re home, and doesn&apos;t have a whole bunch of stuff. <br>\nWe are seeking a kind, fun, considerate, friendly person - really, someone who would fit in comfortably here, and appreciate being a part of our unique household with all that it has to offer. <br>\nWe are an interesting blend of men &amp; women of various ages - an eclectic mix of the kind of people that make Portland such a great place to live - artists, students, baristas, skateboarders, bike riders, hikers, internet entrepreneurs, musicians. We are all fairly introverted and share a variety of common interests. We are all kind, respectful, creative, art-oriented, comedy, literature, music &amp; movie loving liberals, with widely varied schedules, and active lives. <br>\nWe also have 2 cute, small, nice dogs, and a friendly (mostly outdoor) cat. <br>\nThe addition we are seeking will be considerate, friendly, and responsible; have a great sense of humor and be easy to talk to; like animals, but preferably have none of their own; have stable finances and an active life; not be a big drinker; not need to have overnight guests; and willing to do the majority of their socializing away from the house. <br>\nThis is a very respectfully 420-friendly household, but no smoking in the house.<br>\nWe are mostly meat-eaters, but we do welcome tolerant vegetarians/vegans.<br>\nThe house has a nice fenced backyard with fountains, and some gardening space is available. <br>\nWe&apos;re located within a short walking distance to several buses and MAX lines (the #15 Belmont, #20 Burnside, #4 Division, the Greenline MAX and Blueline MAX).<br>\nThe house is in a quiet, safe, residential neighborhood within easy walking distance to many useful amenities. We are very close to Mall 205 (Please ~ be sure to mapquest zip 97216 or look up Trimet stops #11027 or #11411 before responding to determine if the location will work for you). Near a Dollar Store, Big Lots, Target, Home Depot, and many other useful shops, businesses, and restaurants. The Eastside Community Center is only three blocks away, and it offers lots of great classes, an awesome new pool, a weight room, and outdoor track. Adventist Hospital (where there is a vegan bistro) and the East Portland police station are also very close to our house. Powell Butte and Mt. Tabor are nearby for spontaneous hiking and biking. We are very centrally located with a freeway exit to I-205 only a couple minutes away. Bike riders - we are close to bike paths AND we have our own in-house bike mechanic!<br>\nIt&apos;s $400/month, which includes utilities. Furnished, possibly.<br>\nApplicants offering First + Last are preferred (possibly negotiable).<br>\nInterested? We hope to hear from you!\n    ",
        "image": "http://images.craigslist.org/00808_5Vr8KtsuOwS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4937184955.html"
    },
    {
        "title": "Easygoing/musician/responsible 35yr old male",
        "href": "/mlt/roo/4942589534.html",
        "time": "2015-03-21 10:45",
        "price": null,
        "neighborhood": " (United States)",
        "postBody": "\n        Hi, I&apos;m looking for a steady place starting around April 1st (or May 1st). Looking to spend around $350 to $450 utilities included. <br>\n<br>\nI am a musician/artist/creator. I&apos;m originally from North Carolina &amp; have lived in PDX for almost 4 years. I work as a dishwasher at Intel &amp; will be looking for work closer to where I move.  My preference would be NE or SE, but I&apos;m open to other locations. <br>\n<br>\nMy band is Stellamorphic www.facebook.com/Stellamorphosis  I also create meditation music: ascensionbootcamp222.bandcamp.com  Currently I&apos;m focused on what I&apos;m doing with Stellamorphic  &amp; we are also looking to collaborate with others to create music. <br>\n<br>\nI practice Kundalini Yoga, meditate &amp; am mindful of what I eat &amp; my impact on the environment.. Environmental activism &amp; human rights issues are very important to me. <br>\n <br>\nI enjoy my personal space &amp; am very considerate of others as well. I&apos;m pretty introverted but down to have a drink, create something or work on house projects with housemates.<br>\n <br>\nI clean up after myself, pay my rent on time &amp; am super easy going, open minded &amp; hoping to find the same. <br>\n<br>\nPlease send me a msg if you think we could try this out. Good hunting to you &amp; thanks for your time!<br>\nJustin\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942589534.html"
    },
    {
        "title": "Room for rent in house. Single dad with 2 kids",
        "href": "/mlt/roo/4942567458.html",
        "time": "2015-03-21 10:33",
        "price": "$500",
        "neighborhood": " (52nd and Malden st.)",
        "postBody": "\n        Room for rent in a cool house. The house was just recently renovated a few months ago right before I moved in. Freshly painted inside and out! I&apos;m a single dad raising 2 boys on my own (they&apos;re 8 &amp; 10, I&apos;m 33). We&apos;re really laid back nice people looking for the same. The room is $500 a month plus 1/3 utilities, no deposit or any of that crap. The room measures 17ft by 8.5ft with windows on 2 sides and plenty of natural light! I work mornings and the kids go to school during the week so during the weekdays were not home till after 3 so it&apos;s pretty quiet during the day times here. I&apos;m willing to rent the room to another single parent with one kid because it&apos;s a pretty big room and I know how it is to be on your own raising a little one. Plus maybe we could trade on babysitting or something. <br>\nA little about me: I&apos;m an ex punk drummer, was in a several bands at a time devoting my life to music until I got full custody of my two little boys when they were 1yr and the other one was 1 week old. So I had to change my life obviously and become the responsible adult I resisted for so long. Now I&apos;m a server in a breakfast joint going back to school in the fall. I don&apos;t really know what else to write so just give me a call and we&apos;ll talk and stuff. My iPhone for some reason doesn&apos;t ring all the time so just leave me a message and I&apos;ll get back to ya if I don&apos;t pick up. Thanks! Dru<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00K0K_aRXFYlhzZwz_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942567458.html"
    },
    {
        "title": "College Student looking for Roommate - Furnished",
        "href": "/mlt/roo/4908538500.html",
        "time": "2015-03-21 10:31",
        "price": "$750",
        "neighborhood": " (SE 92nd and Powell)",
        "postBody": "\n        College Student looking for Roommate.<br>\n<br>\nOne bedroom with private bathroom<br>\nin a Shared 2 Bedroom and 2 Bathroom Deluxe Apartment<br>\n<br>\nTotal Rent - $750 a month<br>\n<br>\n\n <a href=\"/fb/pdx/roo/4908538500\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nFurnished Apartment<br>\n     Bed, Dresser, Bookcase, Couch, and flat-screen TV<br>\n     Shared Rent<br>\n     All Utilities Paid (Water/Sewer/Garbage/Internet/Cable)<br>\n     Shared Internet - Wi Fi<br>\n     Private Bedroom with Private Bathroom<br>\n     Shared Kitchen &amp; eating area<br>\n          All Pots, Pans and Utensils included<br>\n     Room lockable with key<br>\n     Laundry Room on Site also Washer/Dryer hookups inside unit<br>\n     Extra Storage<br>\n     Covered Patio<br>\n     <br>\n<br>\nClose to Max (Greenline)<br>\n15 minutes to Downtown<br>\n10 minutes to Airport<br>\nBanks close by<br>\nLot&apos;s of Restaurants<br>\n<br>\n*Smoking only allowed outside on patio<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4908538500.html"
    },
    {
        "title": "Master Bedroom - All Util. Incl.",
        "href": "/mlt/roo/4942526727.html",
        "time": "2015-03-21 10:18",
        "price": null,
        "neighborhood": " (Sabin/NE)",
        "postBody": "\n        Well, hello there. Could you be the roommate we&apos;ve been hoping for? Okay- I hate writing these things. Here are the facts and ramblings about the room/house/expectations/roommates:<br>\n<br>\nSecond floor master bedroom available in April<br>\n    - Softwood pine floors<br>\n    - 2 closets, built-ins and a sunny nook for a desk/chaise lounge/mini couch<br>\n    - North and West facing windows (looks out to backyard)<br>\n    - I can&apos;t remember square footage off the top of my head, but the room is large (and not &apos;large&apos; in a &apos;cozy&apos; way- it&apos;s a legit big room)<br>\n<br>\nHouse is a remodeled 1909 Craftsman in the heart of the Sabin neighborhood. <br>\n    - softwood, pine floors throughout<br>\n    - one 1st floor bedroom, 2 upstairs<br>\n    - 1st floor full-bath features clawfoot tub<br>\n    - 2nd floor bath features a 2-person shower<br>\n    - oil heat on main floor, electric heat in upstairs bedrooms<br>\n    - detached garage, unfinished basement (laundry), backyard and quiet street with the greatest neighbors ever (not to brag)<br>\n    - 1st floor is an open floorplan with great kitchen for cooking equipped with dishwasher, a living room and a weird small room at the base of the stairs that I still can&apos;t figure out what to do with. <br>\n    - Large front porch that captures all the morning sunlight <br>\n    - 2 small garden plots that are in dire need of attention<br>\n    - House comes equipped with an 8 year old indoor/outdoor cat <br>\n<br>\nRoommate expectations<br>\n    - participate in keeping the house in order (like, cleaning with a sponge!)<br>\n    - be respectful/considerate/mindful/(insert other adjective) of the house, roommates, cat<br>\n    - scent-free (please please please no incense, perfumes/colognes, heavily fragranced shower products like Axe, room sprays, febreeze or other things of the sort) <br>\n    - pay rent in-full and on-time<br>\n    - keep the partying at locations other than the house (great alternatives to this house include: the bar and other people&apos;s houses) <br>\n    - It would be ideal if you&apos;d be willing to take an active role in the home environment and speak up if something isn&apos;t working for you. We&apos;re open to criticism and communication (we both majored in art, we can take it). We really just want someone (or a couple) who can be communicative and respectful. And I&apos;m poaching this line off of someone else&apos;s posting because it is well-put:We&apos;re looking for someone who understands and values a sense of community, privacy and accountability.<br>\n<br>\nAbout the two people you&apos;d be living with:<br>\n    - We&apos;re both named Emily- though we spell our names differently<br>\n    - Emily 2 (shhhh don&apos;t tell her I said that) is in her early 30s, a full-time engineering student at PSU and is a hilarious and all-around wonderful human being. Due to her crazy schedule she is out of the house most days for long hours and needs a quiet place to come home to. You&apos;ll rarely see her. <br>\n    - I am also in my early 30s, work for a national non-profit as their data-nerd, boulder (indoor and outdoor), pretend like I&apos;m going to run a marathon, obsess over jigsaw puzzles and love playing strategy board games. I keep myself pretty busy with lots of other projects outside of work, so I also like to have a quiet home to decompress at. <br>\n    - Neither of us tends to have out-of-town visitors, but the occasional person may come and stay (with all-house approval first).<br>\n   - Emily and I are both easy-going people and love to socialize when we actually have the time to do so. We both tend to limit our in-house socializing to activities like small dinner/brunch gatherings, game nights and other low-key affairs. <br>\n    - Neither of us owns a tv and we&apos;d ask that if you bring one you&apos;d refrain from putting it in the common space. <br>\n    -We also don&apos;t care what your diet is just so long as you clean up after yourself in the kitchen.<br>\n<br>\nOther things about things:<br>\nRent is $875/mo for a single person, $1,000/mo for a couple. All utilities are included in rent (water/sewer, electric, heat, garbage, internet). Lease is month-to-month, but it would be great if you plan to stay at minimum 6 months. You can have the driveway parking space if you want it. <br>\n<br>\nWe are a few blocks from Whole Foods and within a short walk to Alberta and Williams. <br>\n<br>\nEmail me if you want to come by and see the space. Looking forward to meeting you!<br>\n<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00l0l_93sru7EXkW7_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942526727.html"
    },
    {
        "title": "Room for Rent in SE Apartment",
        "href": "/mlt/roo/4942526162.html",
        "time": "2015-03-21 10:10",
        "price": null,
        "neighborhood": null,
        "postBody": "\n        My partner and I will have a room for rent in our SE Portland Apartment, available April 5. The rent is 400 which will be all inclusive of electric, water, etc. I currently do not have cable or internet hooked up, if you want to, its fine, we can split it or whatever. We are a gay couple, iam 44, he is 25. We would prefer a gay male, but are open to other possibilities. It is a two bedroom, 1 bath apartment and we both work full time. Please no pets, drugs, drama. I don&apos;t care about drinking, its fine. 420 outside is fine too. Please do not be offended by some mess, nudity, we are pretty open when it comes to being home. email for further details and we can go from there. The lease is up at the end of the year and we likely will not renew, so know going in this is temporary. <br>\n.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942526162.html"
    },
    {
        "title": "$500 bedroom for rent/ all utilities included",
        "href": "/mlt/roo/4942525586.html",
        "time": "2015-03-21 10:10",
        "price": "$500",
        "neighborhood": " (NE 148th &amp; Flanders)",
        "postBody": "\n        Hi I&apos;m Andy Im wanting to share m.    townhome which is a 3 bedroom 2.5 bath with a private patio. It is 2 blocks away from the max station on 148th and one block away from Glendoveer<br>\npark/golf course which has a 2 mile run/jog/walking trail. I&apos;m looking for a mature financially secure roommate who is open to sharing a house with other mature housemates. The room available is the the northern facing bedroom which has good closet space and stays nice and cool in the summers. All utilities are included Cable, internet, water, sewer, garbage,natural gas, power, air conditioning this place has it all. It is an end unit so your surroundings are relatively quiet and secluded compared to some of the other units. I would prefer someone that generally picks up after themselves. Your roommates will be from the age 29-55 that are mature and environmentally concious. We do recycle however I wouldn&apos;t classify us as tree huggers just yet! I think so far i have the perfect roommates who pretty much keep to themselves,non-partiers,trustworthy,respectful and enjoy the clean environment! I cannot stress the words Cleanliness and Respectful enough! It only takes one person to screw it all up and we are not looking for that person :). We are not looking for buddies,craigslist friends, or to gain any social advantages, we are simply looking for a roommate to share a house. You are preferably someone who has lived in a shared housing situation and has the common sense to figure out how to co-exist with others! <br>\nAlso if you are energy concient that would be nice!<br>\n Alot of times i literally feel as though i live here alone as everyone either works full time or keeps busy with their personal lives that you hardly notice them living here. They are all mature,laid back and respectful of each others belongings.  I have a 5 yr old miniature  labradoodle name Sam so you must like dogs as he will try to cuddle with you. No drugs will be tolerated on the premises. Social drinking is fine, and id prefer it if you didn&apos;t have too many people coming and going from the house.I&apos;m asking for first months rent plus $250 security deposit prior to move in. Please be employed or have a source of income, as I will not chase anyone around for rent.  Single occupancy only. Please be able to pass a background check and have a good rental history,verifiable references as i am a master screener and will do my research! Please call Andy for a possible viewing \n <a href=\"/fb/pdx/roo/4942525586\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n I will NOT respond to email as I cannot distinguish whether it is a spam.<br>\nAgain place is available March 12, 2015 on a month agreement but would prefer someone with intentions of staying at least 6 months. Goodluck! P.S We do have furniture :) !\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942525586.html"
    },
    {
        "title": "Beautiful house with finished basement",
        "href": "/mlt/roo/4929233106.html",
        "time": "2015-03-21 10:10",
        "price": "$850",
        "neighborhood": " (North Portland)",
        "postBody": "\n        Available immediately near University of Portland in St. Johns - A finished basement with private entrance in a house with a backyard and garage for storate.<br>\n<br>\nAbout me: 35 years young, professional consultant. I&apos;m clean, I run my own business and work from home (http://www.mrwindupbird.com), have two boxer puppies (14 weeks old), well traveled, went to university in Japan, speaks Japanese, musician, avid reader, competitive ice hockey player and fitness enthusiast, mostly gluten-free health-conscious omnivore. <br>\n<br>\nAbout you: Like me, you are balanced, mature, clean and tidy, drama-free, non-smoking, not a night owl.<br>\n<br>\nAmenities: living room, bedroom, walk-in closet, kitchen with fridge and sink and space for a dining table (no stove), bathroom with shower, 15 minute walk from University of Portland (they allow the general public to use their library and internet!), 30 minute walk to downtown St. John, 15 minute walk from N Lombard and Burr food cart pod (so good!!) and daily farmer&apos;s market. Fred Meyer&apos;s a few minutes walking distance, Safeway and New Seasons are also close by.<br>\n<br>\nCharges: $850/month plus split internet, electric, and water. First and last month&apos;s rent to move in.<br>\n<br>\nTell me what your favorite food is when you email me so I know you&apos;re not a robot. ;)\n    ",
        "image": "http://images.craigslist.org/01010_gG5gKRhIDCk_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4929233106.html"
    },
    {
        "title": "BR w/private bath &amp; LR in 2BR apartment",
        "href": "/mlt/roo/4931063139.html",
        "time": "2015-03-21 10:03",
        "price": "$500",
        "neighborhood": " (between Hollywood &amp; Gateway)",
        "postBody": "\n        My wonderful housemate is joining a house with a garden &amp; other musicians, so I&apos;m looking for someone new to share our 975sf, ground floor, 2BR apartment. I&apos;m looking to share with just one other person, for at least 9 months and preferably indefinitely, and will respond to everyone who responds in full accordance with this ad. Everything is 50/50, averaging just under $500/mo.: Rent ($437.50), electric &amp; broadband internet. No cable TV or land line.<br>\n<br>\nI&apos;m subletting one bedroom (10&apos;x13&apos;, counting the closet), it&apos;s accompanying full bath (40sf) and the living room &amp; adjoining closets (300sf), available Saturday, April 11th (unless the carpet cleaning is delayed - to be confirmed very soon). So this could work well for someone with more furniture than could fit in the bedroom. My room has its own bath, and I&apos;m generally there, in the kitchen or in the breakfast nook, which I use as a home office. I have no pets but love them, so yours are possible with a nonrefundable pet fee to the landlord ($300 + $150 per additional up to 3 total), though it would be important to stay on top of any shedding, for me to meet them, not to be noisy or smelly, etc.<br>\n<br>\nThe unit was completely renovated 2-3 years ago, with new kitchen appliances, W/D in unit and large and fenced patio in back. We&apos;re off a dead-end street, 50 yards from a natural area in a low traffic neighborhood halfway between Hollywood &amp; Gateway, walking distance to Fred&apos;s, a 5 minute walk from two bus lines, a 10 minute walk to three max lines, and 1-5 minutes from I-84. If you have a car, you would use a visitor slot; I did this for 4 months, almost always had my favorite slot and had to park on the street on only 1 occasion. I&apos;m very bike friendly, but you&apos;d probably have to park just inside, on a rug to spare the carpet.  (My bikes hang in a closet off the patio.)<br>\n<br>\nThe room has off-white paint on sheet rock walls, one 3&apos; x 6&apos; window facing north into the parking court, vertical slat blinds, a closet 2&apos; deep x 7&apos; wide with white sliding doors, a single frosted glass light fixture in the middle of the ceiling, and a brown carpet.<br>\n<br>\nThe owner will need $50 to run a background check before we can sign.  To hold the room, I&apos;ll also need a $500 security deposit along with first month&apos;s rent, which can be pro-rated, and a simple, month-to-month homeshare agreement, to keep us in sync about the basics:<br>\nhttp://blog.oregonlive.com/hg_impact/2009/05/RENT%20AGMNT%203.pdf <br>\n<br>\nI&apos;m a 52 year old man and long term experienced housemate, not looking for anything except a mature, considerate, responsible and fairly quiet person to share costs, although common interests are always nice and I&apos;m friendly enough when the boundaries are secure. I have plenty of good housemate references when we get to that point, and might ask for a couple from you as well. I&apos;ve been more comfortable with most of my past housemates 28 or older than younger. I&apos;m fine with all sexes, genders &amp; views, but prefer not to live with anyone who uses drugs, smokes, drinks much alcohol, depends heavily on caffeine, or entertains a lot or indiscreetly. I&apos;m stable, reliable, considerate and manage my own needs, and need the same in my housemate. I&apos;m self-employed working with adults with developmental disabilities, having left high tech to free up time for community organizing around local food systems and sustainable economy. I&apos;m deeply into nature, lived abroad for a long time, have a graduate degree, am divorced with no kids, and do no illegal drugs or marijuana, but do use plant tinctures and might smudge a little. I drink two beers or glasses of wine once every 1-3 months. I rest a lot, usually in my room, because recovering from a long term health issue, but am again riding, swimming &amp; hiking, and thinking about picking up yoga or going back to qi gong. My own possessions are pretty minimal. I was car free for several years, but had to get a car for my clients&apos; sake, though I don&apos;t drive it much compared to most. Very involved with spirituality, but private about it and accustomed to not sharing that with house mates. I have respect for healing and service. I&apos;m home a lot, but usually quiet &amp; private and am very considerate, though lately not as clean as neat for lack of time. But I keep pretty on top of dishes, fridge &amp; counters and would need you to as well: after security &amp; quiet, the single most important part of sharing space. I watch a few internet videos, mostly quietly in my room, but no TV or loud music and few hollywood movies. I can be pretty frumpy at home in my sweats, slippers &amp; down vest. I usually socialize while I&apos;m out &amp; about, and entertain here only quietly and very occasionally, and would prefer a house mate who&apos;s visitors are also considerate and fairly quiet. Night time quiet is important.<br>\n<br>\nIf interested, please tell me about yourself in relation to what I&apos;ve written here, your experience with homesharing and anything else that comes up for you.  Thanks &amp; best of luck in your search for a good place to live!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4931063139.html"
    },
    {
        "title": "Near Mt Hood Community College",
        "href": "/mlt/roo/4942485661.html",
        "time": "2015-03-21 10:00",
        "price": "$375",
        "neighborhood": " (Troutdale)",
        "postBody": "\n        STUDENT SPECIAL: furnished room in large, three-bathroom, two-story house in tree-lined neighborhood near Mt. Hood Community College.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942485661.html"
    },
    {
        "title": "Giant Room for Rent In Beautiful Old-World Home (Dog Friendly)",
        "href": "/mlt/roo/4942502863.html",
        "time": "2015-03-21 09:58",
        "price": "$600",
        "neighborhood": " (North Tabor, NE)",
        "postBody": "\n        Hello Portland,<br>\n<br>\nWe are looking for an individual to join us in our old-world styled home.  The room is available now, but we&apos;re not in a hurry to fill it.  We&apos;ll hold the space for a good fit.<br>\n<br>\nIt&apos;s located in Northeast Portland a little west of the Montavilla neighborhood and slightly south of Mt. Tabor.  We&apos;re near the Seven Virtues Caf&#xE9;, The A.N.D. Caf&#xE9;, The Tannery, The Tabor Tavern, Portland Yoga Arts, A Fred Meyer, and a QFC.  Just up the way is The Academy Theatre and all that good stuff. <br>\n<br>\nThe house is a wooded wonder.  Our space has 4 bedrooms and 1.5 bathrooms.  It&apos;s quite spacious (the room for rent is approximately 20&apos; by 10&apos;), with hardwood floors throughout.  The kitchen has quality carpentry, marble/wood counters, updated stainless-steel appliances, and a warm red linoleum floor.  The living room has a gas fireplace, a decent speaker/record player set-up, and a healthy amount of foliage.  We have double pained windows that keep the heat in and the cold out. There is a 2-tiered balcony, which overlooks an unfenced yard we aptly refer to as &apos;the forest&apos;.  We have a couple of garden beds that are empty as of the writing of this add.  As well as an untested irrigation system connected to each.  Put simply: it&apos;s a nice home.<br>\n<br>\nUs:<br>\n<br>\nWe are two men and two women in our mid twenties to early thirties.  A sweet baby puppy dog who just turned one! <br>\n<br>\nAll of us are more than the sum of our parts, not bound by nutshells and are kings and queens of infinite space. <br>\n<br>\nWe are raw feelers.  Deep thinkers.  Wild believers. Tea drinkers. Morning contemplaters. We are quiet at night (shhh). We are vegan.  We are not vegan. Each of us is an artist in our own right. We are trying to own all of ourselves even our contradictions.  We read Hindu and Buddhist texts, and we watch Netflix.  We practice many types of yoga, and we own a PS4. We love Leo Tolstoy, Jack Gilbert, Milan Kundera, Daniel Quinn, Aldous Huxley, and we think Star Trek Deep Space Nine is a masterpiece. <br>\n<br>\nIn the kingdom of homogeneity we are your monsters.<br>\n<br>\nWe are yogic, rock collecting, meditating, star children. . .with a dog named after a character from star trek.<br>\n<br>\nIf you&apos;re still reading, we&apos;re thrilled!  We want you to know that this is a come as you are space, but we are looking for a functional community vibe.  We don&apos;t need to share food or have dinners together. We don&apos;t care if your diet matches ours.  You don&apos;t have to like the things we like. We are unconcerned about your gender.  We do need you to be respectful and clean.  Perhaps even exceptionally clean, as the house feels nice when it is well cared for and we feel that taking care of one&apos;s home is both rewarding and necessary.  <br>\nWe like to talk with each other about our thoughts and feelings.  As clear, thoughtful communication is already a feat unto itself, it would be nice to live with another person who isn&apos;t hiding from the way they feel or too passive to let it be known to others.  <br>\n<br>\nThe Nitty-Gritty: <br>\n<br>\nWe pay for gas, electricity, and Wi-Fi; the owner, who is attentive to our needs, covers all other utilities.  This includes yard maintenance.   The rent for the space is going to be $600 for an individual.  Dogs are welcome.  Your space is a finished room in a partially-un earthed basement.  It&apos;s a recent addition with good light and hardwood floors.  Two closet spaces with your own entrance.  However!  Your room would be adjacent to the laundry room and garage which are considered shared spaces.  Bikes come through that entry way as well.  The room isn&apos;t intended for the sun shy isolationist or the career musician.  Sound travels too well throughout the house and we want to know ya!<br>\n<br>\nPlease email us about yourself.  Be thorough.  Indicate you read the add in its entirety.  <br>\n<br>\nBe well.\n    ",
        "image": "http://images.craigslist.org/00U0U_iz9OCzK5bKR_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942502863.html"
    },
    {
        "title": "&#x1F33C;&#x2776;&#x1F33A;1bath 1bad only a walkable Center for Art and Design&amp;#",
        "href": "/mlt/roo/4942342990.html",
        "time": "2015-03-21 09:55",
        "price": "$540",
        "neighborhood": " (portland)",
        "postBody": "\n        Amenities Community Amenities ArtHouse <br>\nis just a 5-minute walk from the future <br>\nArlene and Harold Schnitzer Center for Art <br>\nand Design and the Museum of Contemporary Craft. <br>\nThe close proximity of a new arts-centered apartment <br>\nbuilding near the Pacific Northwest College of Art PNCA <br>\nprovides not only a walkable, sustainable urban campus, <br>\nbut also highlights the arts as a unifying value of the Pearl <br>\nDistrict community. Study &amp; Community Lounge Elevator Guest Suite OnSite <br>\nManagement Package Receiving Gallery Space Outdoor Sun Deck &amp; Rain Garden <br>\nCovered Bike Parking Key Fob Access.If you&apos;re interested please text me \n <a href=\"/fb/pdx/roo/4942342990\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00A0A_657BKQUKw1O_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942342990.html"
    },
    {
        "title": "ROOMS+STUDIOS 1 BLOCK FROM GRESHAM CENTRAL STATION BUS AND MAX DEPOT",
        "href": "/mlt/roo/4931580739.html",
        "time": "2015-03-21 09:53",
        "price": "$588",
        "neighborhood": " (Gresham)",
        "postBody": "\n        \n <a href=\"/fb/pdx/roo/4931580739\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nWe have rooms and studios available 1 block from the Gresham bus and max depot. Rooms are $588 per month.<br>\nStudios are $788 per month.<br>\nMonth to month.<br>\nFully furnished.<br>\nOnsite laundry.<br>\nCall for details and availability.<br>\n<br>\n\n <a href=\"/fb/pdx/roo/4931580739\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nThanks!\n    ",
        "image": "http://images.craigslist.org/00c0c_74WvZ3AYove_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4931580739.html"
    },
    {
        "title": "Large, Light Filled Room in Mature Household",
        "href": "/mlt/roo/4942461222.html",
        "time": "2015-03-21 09:35",
        "price": "$525",
        "neighborhood": " (Alberta/Beaumont)",
        "postBody": "\n        This is not the usual shared housing situation. If this is the right fit for you, you&apos;ll absolutely love it because. . . <br>\n<br>\n&#x2022; It is a very stable, harmonious household of mature singles. Most people stay a long time and leave because of life changes (marriage, buying own house, moving out of state, etc.) <br>\n<br>\n&#x2022; It&apos;s in a highly desirable neighborhood, literally footsteps from Whilshire Park, between Alberta Arts and Beaumont shopping/restaurant districts.<br>\n<br>\n&#x2022; The house is very large, and natural light streams through multiple windows in every room <br>\n<br>\n&#x2022; Your room measures about 14 X 15 -- much bigger than most, with ample closet space <br>\n<br>\n&#x2022; A clean, generous sized bathroom is located just outside your bedroom door (shared with one other person) <br>\n<br>\n&#x2022; Your room has phone, internet and TV cable hookups, plus the house has WIFI <br>\n<br>\n&#x2022; The kitchen is large, and has two refrigerators -- plenty of space for your food <br>\n<br>\n&#x2022; Free laundry <br>\n<br>\n&#x2022; Garage parking for your bike <br>\n<br>\n&#x2022; We recycle almost everything, think green and do our best to stay aware and be earth friendly <br>\n<br>\n&#x2022; We are close to two bus routes (70, 24), plus routes 75 &amp; 17 less than &#xBD; mile <br>\n<br>\n&#x2022; New Seasons Grocery, the Alberta and Beaumont shopping districts, and the Kennedy School are all within walking / biking distance. <br>\n<br>\n<br>\nBut, lovely and inviting as it is, it&apos;s not for everyone. <br>\n<br>\nHere are some details that will either be a turn off for you or make this household even more attractive! <br>\n<br>\n* Current housemates are all mature (youngest 28, oldest 63), all very healthy and active. <br>\n<br>\n* Seeking only one house mate  (sorry, no couples or parent/child)<br>\n<br>\n* Please work outside the home (not available for home office or business) <br>\n<br>\n* No pets. No smoking, no drugs or excessive drinking. <br>\n<br>\n* Though we each eat quite healthily, meat / fish/ chicken are cooked in the kitchen. If you find that offensive, it&apos;s not a good match. <br>\n<br>\n$525 rent plus $100 utilities = $625/month <br>\n<br>\nWe&apos;re a lively, harmonious, progressively minded household and would enjoy hearing from you if you&apos;re interested. Please mention that you caught the part about our ages.  <br>\n<br>\nE-mail for more information or call 503-two 8 two-0115.<br>\n\n    ",
        "image": "http://images.craigslist.org/00G0G_knhJ4SMl3va_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942461222.html"
    },
    {
        "title": "***** April 1st Move In Date For SW Portland / Downtown Lair Hill Room",
        "href": "/mlt/roo/4942335041.html",
        "time": "2015-03-21 09:29",
        "price": "$450",
        "neighborhood": " (SW Portland / Downtown)",
        "postBody": "\n        Hey there! We will have a room available in our SW 2nd and Hooker St. home (the hooker house) on April 1st. Room size is 10x12 feet. We live in a really beautiful 1800&apos;s house with great views of the things. <br>\n<br>\n**Side note, we are trying to get a commitment for filling the room by the end of this weekend so if you are going to shoot an email do it now :)<br>\n<br>\nAbout us:<br>\n<br>\nRaul, 23- Coolest one/best one. <br>\n<br>\nLorena, 19- Has a cat, loves the oil, goes to college and is a girl. <br>\n<br>\nRyland, 20- Probably has a huge penis. <br>\n<br>\nSeth, 19- Likes to bang his girlfriend and play video games. <br>\n<br>\nYou- tell us about yourself! The more we know about you in your reply, the more likely we are going to respond and want to meet you! What are your interests, hobbies, goals, favorite cereal, favorite bands/musicians. Linking us to your facebook/social media site(s) also gives a better idea of who you are. <br>\n<br>\nHouse dynamics: we all get along very well. If there is an issue we all discuss it and come to an agreement. We are 420 friendly, but if you are going to smoke make sure it&apos;s either outside-not in the common areas. It can be loud at times but we always are respectful of each others schedules. <br>\n<br>\nWe wouldn&apos;t consider ourselves a &apos;party house&apos; (we don&apos;t want to see your drunk ass friends passed out on the couch every night) but your drunk ass friends can totally pass out on the couch infrequently. We sometimes have get togethers (we&apos;ve done some house shows, general parties, art nights etc.), so we like to have a good time, just with keeping everyone elses well being in mind at the same time. <br>\n<br>\nRoom Specifics- rent will be $450 a month. Utilities (water, gas, electric, internet) range anywhere between $30-$60 depending on which month of the year (winter months tend to cost more). There will be a mandatory $350 deposit that is refundable when you move out. <br>\n<br>\nWe&apos;re looking for someone who can commit to at least 6 months. <br>\n<br>\n<br>\n<br>\ntags: close-in close in downtown sw lair hill ncnm lewis &amp; clark psu pcc sylvania\n    ",
        "image": "http://images.craigslist.org/00k0k_eyDb0jggbXS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942335041.html"
    },
    {
        "title": "Furnished, utilities included",
        "href": "/mlt/roo/4942449733.html",
        "time": "2015-03-21 09:29",
        "price": "$700",
        "neighborhood": " (Beaumont, NE Portland, 47th Fremont)",
        "postBody": "\n        The house is very big, with a beautiful yard, and very comfortable.  Enough space for all.<br>\n<br>\nAll Utilities included, Internet.  Large Main floor  Master bedrom, furnished.                            bathroom is shared with only 1 other room on the main floor.  <br>\n<br>\nUse of the kitchen and laundry room is included.<br>\n<br>\nUpstairs I have my own bedroom, bathroom, and sitting room. <br>\nEasy access to bus. Max station,  I-84, Concordia, PCC, Portland State University, Downtown. <br>\n<br>\nWalking to shops, grocery stores, restaurants, movie theatre. Beautiful neighborhood.                                            <br>\n                                                                                                                                                                <br>\nNo smoking in the house.  Drug free. Single occupancy.  No pets please.<br>\nFemales, students, ESL are encouraged to respond.  Looking for someone who is responsible, employed and/or in school.  Able to painlessly make the rent on time.<br>\n<br>\n Atmosphere is comfortable and relaxed,  clean.  Call \n <a href=\"/fb/pdx/roo/4942449733\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n(Please leave a message if I am unable to answer, no e-mails will be returned.)    Thank you.<br>\n<br>\nBeaumont, Alameda, Hollywood, NE Portland furnished.\n    ",
        "image": "http://images.craigslist.org/00m0m_eWhwyiHlMm2_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942449733.html"
    },
    {
        "title": "One bedroom for rent in 950 sq/ft Condo",
        "href": "/mlt/roo/4942447714.html",
        "time": "2015-03-21 09:28",
        "price": "$600",
        "neighborhood": " (3461 SW Barbur Blvd)",
        "postBody": "\n        Hello craigslisters,<br>\n<br>\nI am looking for a roommate to rent the second bedroom in my two story condo starting April 1st. The condo has two bedrooms and full bath upstairs that we would share, as well as a kitchen/living room/bathroom and laundry room on the lower floor. The carpet in the photos has been replaced with hardwood. Rent is $600 a month plus utilities. Move in costs would be $1000 for deposit/last month, and a $30 credit check fee.  Sorry, but no couples and no dogs, it&apos;s a small place! Cats are possible if its a good fit with my cat.<br>\n<br>\nI am Luke, a guy in my early 20&apos;s (he/his or they/them pronouns), who is currently living alone with just my cat, but will be moving in to my new place around the same time as my future roommate. I am in my last year at PSU studying architecture, and I tutor CS students also at PSU for work. I tend to be fairly quiet when I am home, and am very considerate of those I am living with. However I do have friends over on occasion. I am 420 friendly, queer friendly and just generally friendly and low drama.<br>\n<br>\nI am interested in a roommate who is relaxed and reliable. Preferably around my age, and employed/going to school. Basically, I don&apos;t spend all my time at home, and would like to live with someone who is likewise busy and occupied.<br>\n<br>\nIf you are interested, send me an email with any questions you may have and some information about yourself (This part is important, I would like to know about any hobbies/interests, job, etc.), and we can arrange to meet up and see if we are a good fit!<br>\n<br>\n<br>\n(P.S. If you have seen this ad before, its because I posted it, and lacked time to follow up with all the moving and such. I&apos;m all moved in now though)\n    ",
        "image": "http://images.craigslist.org/00u0u_iVjwnIkoPdp_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942447714.html"
    },
    {
        "title": "14 by 10. Private room for rent in April.",
        "href": "/mlt/roo/4942409859.html",
        "time": "2015-03-21 09:26",
        "price": "$375",
        "neighborhood": " (gresham)",
        "postBody": "\n        Cozy and quiet room for rent. $375.00 per month. Small deposit to hold the room. 30 yrs and up. Gals preferred.  420 ok. (medical card. A must). No dogs. Cats are cool. No couples. Just not enouph room. Non smoker. Help keep common areas clean. Get along with others(that&apos;s a good thing). Good size yard for garden. Small green house. Close to park and shopping. Public transportation. Come see the house. Its free.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942409859.html"
    },
    {
        "title": "Alberta Art District, close to coffee shops",
        "href": "/mlt/roo/4930742009.html",
        "time": "2015-03-21 09:19",
        "price": "$525",
        "neighborhood": " (515 ne sumner st)",
        "postBody": "\n        Available ~March 22ndst, or sooner. Big house, 2 baths, 3 bed rooms (+basement). 1/4 utilities (about ~$75). medium size, walkin closet, on 2nd floor. Gay friendly, sharing with 3 other guys ( gay &amp; straight guys). We&apos;re all working full/part time, O:pen-minded and quiet. Ideal for student/part-time working looking for quiet person who can be communicative , friendly and yet respects others&apos; space and privacy. However, if you have a bf or gf who is around the hiuse a lot, sorry er are NOT interested! Big backyard, vegetable garden, chickens , fish pond. Looking for WORKING, quiet, clean, respectful, responsible,&amp; open-minded GUY over 25 yrs old. semi-furnished with queen bed, leather sofa, tv stand.<br>\nPlease no couples, smokers, and pets. only be shown from 5pm to 6pm and after 8:00pm to 10pm weekdays. just swing by and check out the house at those times. the post will be removed as soon as the room is rented out. <br>\nPlease call \n <a href=\"/fb/pdx/roo/4930742009\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nif you&apos;re close by. Thanks <br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00S0S_fkiR3v1y2aj_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4930742009.html"
    },
    {
        "title": "Large Nice Tri Level Town-House***Seeking Roommate",
        "href": "/mlt/roo/4942277270.html",
        "time": "2015-03-21 09:14",
        "price": "$475",
        "neighborhood": " (Portland)",
        "postBody": "\n        Available Now . Tri level End Unit Townhouse w/ 2 full bath and 1/2 bath. Located in a newly build, very nice and quiet neighborhood. Clean, safe, professional environment with parking on the street. We are few minutes to three INTEL campuses, Genentech and other big companies. Close to local shops as well like Cosco, 24 Hrs fitness, Walgreens, Movie Theater, Gas stations, Fred Myers and minutes to downtown Hillsboro<br>\n<br>\nLocated in Hillsboro and TV Hwy 8 min from 26, off Brookwood.<br>\n<br>\nWe are not a party house, however having a beer or smoke outback is not against the rules by any means. Perfect for Intel employees or students attending Pacific University. Have an open room for someone that&apos;s interested preferably to stay long-term.<br>\n<br>\nThere are cleaning supplies and all household goods available to tenants.<br>\n<br>\nMonth-to-month rent, with a 30 days move out notice, $300.00 refundable security deposit. $20 application fee to process credit report.<br>\n<br>\n3rd Bedroom with shared bath $475 a month includes utilities (9x12) /Available<br>\n++++++ NO COUPLES, NO PETS++++++++NO COUPLES, NO PETS++++++++<br>\n<br>\nIf you have any additional questions or require further information about the room, please, do not hesitate to email me and I&apos;ll be more than happy to answer your questions and please provide your phone number.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942277270.html"
    },
    {
        "title": "14 by 10. Private room for rent in April.",
        "href": "/mlt/roo/4942385444.html",
        "time": "2015-03-21 09:09",
        "price": "$375",
        "neighborhood": " (gresham)",
        "postBody": "\n        Cozy and quiet room for rent. $375.00 per month. Small back ground check. Free. Room will be ready on April 7th. Middle aged preferred. 30 yrs up. Gals preferred. Non smoker. 420 ok. Medical card(a must). No dogs. Cats are cool. No couples. Just not enouph room. Get along with others. Help clean common areas. Close to shopping.Great yard for garden. Small green house. Park. Call. Check out the room. Its free.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942385444.html"
    },
    {
        "title": "Room for Rent just outside Woodstock",
        "href": "/mlt/roo/4924815316.html",
        "time": "2015-03-21 09:06",
        "price": null,
        "neighborhood": " (Portland, OR)",
        "postBody": "\n        Just moved into a 2bd, 1bth house in the middle of February.  I&apos;m a 32 m originally from the Seattle area.  I have a very sweet and mellow collie/ blue heeler female dog who gets along with everyone. The house is located just outside the woodstock area. Just got out of a relationship, we had shared furniture, etc.. needless to say i&apos;m kind of starting from scratch. Anyways, I work full time at a great job and make decent money. Rent is somewhat negotiable looking at around 400-500 dollars and perhaps have utilities included but again all is negotiable. The house has a big backyard and street parking. Plenty of room for storage. Also as a warning.. The house is pretty old, and the best I describe it to friends is a &quot;frat house&quot; not in the party atmosphere just in the old school piece of it.  Drawstring room lights, old windows, etc. I&apos;m slowly painting walls, putting in new light fixtures... W&amp;D next month... I&apos;m pretty clean and pick up after myself as I go and expect the same. When i&apos;m not working my 9-5 job I enjoy watching movies, going out to new restaurants, bars, taking my dog to the park, camping, and going to live shows. When replying back please send a picture, description of your self, facebook link, anything to help me learn who you are and if it would be a good fit. The room is available immediately. Thanks!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4924815316.html"
    },
    {
        "title": "Upstairs suite available in 3bd/2ba house off Alberta!",
        "href": "/mlt/roo/4942383552.html",
        "time": "2015-03-21 08:53",
        "price": "$600",
        "neighborhood": " (NE 15th at NE Alberta)",
        "postBody": "\n        Hello potential roommates! We&apos;ve got a large, unfurnished room opening up April 1 in a lovely 3bd/2ba duplex off NE Alberta St. It&apos;s the largest room in the house, and comes with your own bathroom! The house has a great front porch, a garden area in the back, and a covered patio area off the side. The open room is upstairs, and there is also a guest room/project room upstairs. Friendly and quiet street. Rent is $600 (or $850 for a couple) plus shared water/power/internet.<br>\n<br>\nAbout the housemates: a mid-20s straight couple, and 1 stripey orange cat named Oliver. We both have work/school during the day, so we need someone who can respect that sleep schedule. I am a grant writer for a nonprofit and I enjoy hiking, playing piano and tending the garden. My partner is a student at PSU and a professional trumpet player. We have had great success living with housemates here and are very conscious about not being &quot;that couple&quot; that takes over the house. We want you to make this place your home!<br>\n<br>\nWhat we&apos;re looking for: A fellow 20-something person or couple, responsible, and able to pay rent/bills on time. Hopefully you will have your own life and interests, but also enjoy catching up with roommates when we&apos;re home together. Willing to help keep common areas clean, ok with trumpet/piano playing during reasonable hours, and no smoking in the house. Willing to take on a bill, and looking to stay at least 6 months (lease is month to month).<br>\n<br>\nIf this sounds like a good place to live, please respond via email with a bit about yourself and what you&apos;re looking for in a housing situation. We are available to show the place tomorrow, Sunday 4/22 after noon, or weeknights after 6, so please include your availability and your phone number so we can schedule you in. Move-in costs will be first month&apos;s rent plus a $500 deposit.<br>\n<br>\nLooking forward to hearing from you, and happy house hunting!<br>\n\n    ",
        "image": "http://images.craigslist.org/00D0D_k1HoPHfNph6_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942383552.html"
    },
    {
        "title": "Rooms April 1st",
        "href": "/mlt/roo/4919475129.html",
        "time": "2015-03-21 08:41",
        "price": "$420",
        "neighborhood": " (N.E. Portland)",
        "postBody": "\n        Hey! <br>\nCraigslist Land!<br>\n<br>\n*edit*<br>\nOk, looks like we need to clarify the age of the house.<br>\nWe range from 26 to 51. Also if you set a time to come over and meet us and don&apos;t show up that says volumes about you. 1. Look at the zip code 97211, Google it, if that area is too far out or you don&apos;t like it then don&apos;t waste our time. Really, we had way to many flakes this weekend.<br>\n*edit*<br>\n<br>\nLooks like it&apos;s time to find a few more roommates as we&apos;ve just had two of ours hook up and they&apos;re getting a place of their own. Yep. It&apos;s dreaded &quot;find some new roommates&quot; time.<br>\n<br>\nWe have an old funky place in N.E. PDX on a decent chunk of yardage/land/dirt/grass, cats, dogs and some chickens from time to time. We have central AC (Ha! Suckers!) Laundry room, kitchen, bathroom. Living rooms, your own room, 17 large trees, 4.7 million blades of grass and a partridge in a pear tree. . . If you grow a pear tree and supply the Partridge. . .. <br>\n<br>\nIt saves us on trash and even cooking and cleaning up if we just all pitch in. I&apos;ll buy food for one week, we all make and grub it (and clean it all up) then the next guy or couple does the next. So yeah, you shouldn&apos;t be an uptight paranoid bean counter or leach either (you know who you are). It&apos;s our home not a motel. Do you want a home or motel? We have no maid service but I&apos;m available for hire at $25.00 an hour so we can work something out. . .<br>\n<br>\nThe rent is $420 and yeah it&apos;s like that and if you&apos;re not move and down the high way, get on down the. . .. Oh. Wait. Right.<br>\nAnyway.<br>\nThe rent is $420 due on the freakin 1st and if you can&apos;t cough up the cash you must communicate/talk.speak/e-mail/knock on door before the end of the next full moon or snow. Ok? There is a refundable deposit. As long as you&apos;re not a freak, turn into a vampire (well. . .) or enjoy sneaking into people&apos;s room to fart when they&apos;re not home. Basically the deposit is to cover your last month&apos;s utility bills. You know. The one your last roommates got after you were 15000 miles away, the e-mails you ignore. . ... Yeah, we know. . . <br>\n<br>\nWe split the utilities evenly between all residents. If you are a couple that means you pay an even split and your partner pays an even split. 1+1 does not equal 1. comprende? If you have a cat, fish, gerbil, meercat, fuzzy, snake, lizard they are off the hook on utilities. <br>\nWe have a few dogs here. Dogs are always good people but people can be bad dogs. That said, we&apos;re full up on doggies here.<br>\n<br>\nSpeaking of such ridiculous things as being responsible and living with people. . ..<br>\nThere is not a very fine line between OCD being anal and taking out the trash when it&apos;s getting full. Nope. That line is loud and smugly. Kind of smelly too. Thing is you need to be the kind of person that doesn&apos;t put food on the stove, run back to your room while your spaghetti sauce is splattering a texture all over the stove only to run back out slop your slop on a plate to run back to your room to do whatever it was that&apos;s important enough to screw over your roommates. . .. Sigh. Don&apos;t be a jerk or jerkette. We are not a residential treatment care facility<br>\n<br>\nWe like happy positive people because we are happy positive people that wouldn&apos;t mind making the place theirs. Well. . . As long as &quot;yours&apos; doesn&apos;t mean we have to clean you dishes to cook our food. Oh, yeah. We do have a few rules, like how the garbage is done. These are more like guidelines as we know what works here but we&apos;ve had people that felt a great need to change the guidelines so we had to make them rules. <br>\n<br>\nOtherwise the place is really nice in the summer. You can have gardens and there&apos;s lots of room we are 420 friendly but not alcohol and hard drugs especially meth will be reported to the fuzz.  Contact us if you are a regular human that animals don&apos;t run away from or growl at that enjoys being around others and don&apos;t have sinister agendas.<br>\nThanks.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4919475129.html"
    },
    {
        "title": "Shared Garden Bungalow",
        "href": "/mlt/roo/4942342572.html",
        "time": "2015-03-21 08:30",
        "price": "$750",
        "neighborhood": " (north portland)",
        "postBody": "\n        Private 150 sq. foot detached bedroom/living space overlooking lush backyard garden and pond. Shared bath and kitchen and additional living space in main house shared with one adult and sweet Lab/Norwegian Elkhound. Main house is approx. 700 sq. ft with full unfinished basement and sits approx. 15 ft from bedroom space. <br>\n<br>\n&#x2022; Partially furnished (if needed)<br>\n&#x2022; Closet space (both in the studio and storage in main house)<br>\n&#x2022; Washer/dryer (in main house)<br>\n&#x2022; No pets or smoking<br>\n&#x2022; Private patio and use of yard<br>\n&#x2022; garden space available<br>\n&#x2022; backyard fire pit<br>\n&#x2022; Street parking<br>\n&#x2022; Utilities (wireless, cable/HBO, electric, gas, water, garbage) included for flat rate of $150/mo.<br>\n<br>\nEZ access to Max and I-5 &#x2022; 10 minutes to downtown &#x2022; One block to bus stop (TriMet #35) &#x2022; Close to New Seasons and 2 blocks from Green Zebra.<br>\n<br>\nRent: $750/mo. plus $150/month for all utilities (cable/HBO, wi-fi, on site laundry, water, garbage, gas, electric)<br>\nBackground / Credit Check $35.00 Fee<br>\n$750 deposit<br>\n<br>\nIf you are interested, I&apos;d love to hear from you. Email and tell me a bit about yourself, what you do for work/play, etc.<br>\n<br>\nMe: Casual, professional, graphic designer/artist. I balance a full time job with a studio practice. I compost, recycle and care about being environmentally friendly. I keep the house clean. I&apos;m social &amp; outgoing but generally keep my home space quiet and low key. I&apos;d like to share the space with a peaceful, happy-home-life kind of person.<br>\n\n    ",
        "image": "http://images.craigslist.org/00N0N_6nmzZnCa3Mg_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942342572.html"
    },
    {
        "title": "room for rent",
        "href": "/mlt/roo/4942326684.html",
        "time": "2015-03-21 08:27",
        "price": "$600",
        "neighborhood": " (United States)",
        "postBody": "\n        Room for rent. Take over lease until 10/27/15.<br>\n<br>\n2 bed 1 bath around 850 sq ft.<br>\nRent $600 - Utilities about $200 per month. Utilities include: internet, cable, waster, sewer, electricity and garbage.<br>\n<br>\nComplex requirements: monthly income minimum-$1600 or equivalent savings, no felony conviction(s) and no property debt.<br>\n<br>\nhttp://www.wimbledonsquareandgardens.com\n    ",
        "image": "http://images.craigslist.org/00G0G_5iE8n3J5QE8_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942326684.html"
    },
    {
        "title": "155 square foot bedroom in shared home $700/month",
        "href": "/mlt/roo/4942310103.html",
        "time": "2015-03-21 08:18",
        "price": "$700",
        "neighborhood": " (north portland)",
        "postBody": "\n        Hello,<br>\nThis a posting for a shared bedroom within a 3 bedroom, 1 bath home located in North Portland. <br>\nThe location has been called &quot;ideal&quot; by prior tenants in regard to the following criteria:<br>\n1. Quality of landlord<br>\n2. Condition of room and cleanliness of shared living spaces<br>\n3. Proximity to mass transit and the popular North Mississippi Avenue restaurants, bars, and shopping<br>\n4. Highly popular neighborhoods of Alberta Arts District and North Williams and Overlook are in close proximity for biking, jogging, exploring the city.<br>\n5. Approximately 4 miles from the main downtown city center.<br>\n<br>\nThe room is 150 square feet in size with 9 foot ceilings. There are hard wood floors and plaster walls that are all in very good condition.<br>\n<br>\nOther amenities and details:<br>\n1. Monthly Rent is $700 and this includes all utilities<br>\n2. The room is partially furnished with full size mattress (no frame), 40 sq. ft. area rug, armoire (no closet), desk, dresser and chair.  <br>\n3. Access to Large shared restroom with clawfoot tub and shower. Storage available in restroom for personal toiletries.<br>\n4. Large shared kitchen with built in eating area.<br>\n5. Laundry available onsite in basement<br>\n6. Huge shared living room with fireplace, 2 large couches, and comfy lounge chair and TV.<br>\n7. Large outdoor deck with west facing exposure. Excellent place in the summer months.<br>\n<br>\nWe are: two professional and active men ages 24 and 37 and one yellow lab mix. We share house responsibilities and pay for a cleaning service on a monthly basis. We keep the house clean as we like to have friends over to enjoy the home. We eat healthy, always have coffee on hand and spend weekends getting outside for hikes, volcano climbing, ski instruction and beach trips.<br>\nI work from home but also travel extensively and regularly. My home office occupies the central &quot;dining room&quot; but it is visually separated from the living room. <br>\n<br>\nYou are: Male or female, motivated, energetic and interested in living in a positive, open-minded and energetic household. Willing to keep the shared spaces clean and clear of messes as a form shared respect. If you enjoy gardening that would be a plus... We have a large back yard that is almost ready for planting.<br>\n<br>\nNo pets at this point. One dog is enough and she is wonderfully well behaved.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942310103.html"
    },
    {
        "title": "Need Roommate@Large Victorian--Available April 1st",
        "href": "/mlt/roo/4942279962.html",
        "time": "2015-03-21 08:10",
        "price": "$500",
        "neighborhood": " (Portland)",
        "postBody": "\n        Available April 1st<br>\nRent: $500 + Shared Utilities<br>\nTwo Rooms in Large Victorian<br>\n<br>\nRooms are across from each other upstairs, one is about 12 x 11, the other is about 10 x 10. <br>\nPerfect as a bedroom / office combo for one person.<br>\nThere is a shared full bath upstairs with shower, double sinks &amp; separate claw foot tub. You&apos;d share the upstairs bathroom with 1 other housemate, and I&apos;d occasionally want to take a bath up there (claw foot tub!!)<br>\n<br>\nThe House:<br>\nLarge Victorian in North Portland near the Willamette Bluffs<br>\nClose to Public Transit, New Seasons, Green Zebra, etc.<br>\nThere is a massive shared kitchen &amp; dining room, and a large basement. Decent sized yard.<br>\n<br>\nUs:<br>\nThe other upstairs space will be rented by an awesome guy, Union worker, either working a lot, or when home, keeps to himself. He has the attic &amp; a large room, so basically uses the restroom &amp; on rare occasion the kitchen.<br>\n<br>\nI own an antique shop in N. Portland, and work a fair amount of time. I will have two rooms on the main floor, and the full bath off of the kitchen, so won&apos;t need to share your bathroom upstairs (except for the occasional bath). I do garden in my spare time, so will be putting in a pretty full garden.<br>\n<br>\nI have a large, sweet, very lazy dog who is an excellent, nearly full time sleeper. I also have a little black cat who thinks he is a dog. He is indoor/outdoor.<br>\n<br>\n<br>\nLooking for:<br>\n<br>\nPreferably one tenant.<br>\nSomeone who has full time work &amp; hobbies.<br>\nWe work a lot, so like the house to be pretty mellow. There&apos;s not a ton of communal space, but lots of personal space. Summer BBQs for sure, and we host a pig roast once a year, so bonus if you are a meat eater. :)<br>\nOpen to a person with a cat, provided the cat is fine with dogs &amp; other cats.<br>\n<br>\nWe are currently living in a house in Kenton, and will be moving to the new house (where you&apos;ll be joining us) on April 1st. The owners are currently taking out the oil tank and converting to gas heating, as well as installing a kitchen island and gas range (yay). The lease is in my name so your move in will be<br>\n<br>\nFirst months Rent - $500<br>\nRefundable Deposit - $150<br>\nIf with Cat - $100 Fee<br>\nMonth - Month Lease<br>\n<br>\nIf you&apos;re interested, drop me an email with some information about yourself. Include a phone number. If it sounds like we&apos;d be a good fit, we can take it from there. Thanks!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942279962.html"
    },
    {
        "title": "NORTH PORTLAND SHARE HOUSE",
        "href": "/mlt/roo/4942303068.html",
        "time": "2015-03-21 08:06",
        "price": "$500",
        "neighborhood": " (NORTH. PORTLAND)",
        "postBody": "\n        PRIVATE ROOMS   WORKING MEN ONLY. NO DRUG ALCOHOL, OR SMOKING. FREE UTILITY AND CABLE SHARE BATH WITH ONE OTHER AND FRIG,  PRIVATE $500.00 PLUS DEPOSIT,  <br>\n <a href=\"/fb/pdx/roo/4942303068\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942303068.html"
    },
    {
        "title": "LARGE Room+Private Bathroom+Walkin Closet@Beautiful House",
        "href": "/mlt/roo/4942281175.html",
        "time": "2015-03-21 08:04",
        "price": "$500",
        "neighborhood": " (Portland)",
        "postBody": "\n        Hi! I&apos;m looking for a roommate to share my beautiful home in the Foster-Powell neighborhood. The master suite is yours, which comes complete with en-suite bathroom and large walk-in closet. The house is large (1700 sq ft), and is new (built in 2011).<br>\n<br>\nThe house consists of an open-plan front room/dining area/kitchen, with an additional office space and half-bathroom on the ground floor. The kitchen has a large fridge-freezer, gas stove and dishwasher, and the front room has a beautiful gas fireplace. Downstairs has beautiful hardwood floors throughout. Upstairs are 3 bedrooms, 2 bathrooms. There is also a washer and dryer on the upper level of the house for laundry. Outside there is a garage with storage space for your bicycle, and there is a front and back garden you are welcome to work on or just lounge about in when the weather&apos;s nice. Also located moments away from Mount Tabor park, which is great for a lovely walk or run.<br>\n<br>\nThe house is heated by gas, and also has central air conditioning for comfortable sleeping during the hot summer months.<br>\n<br>\nAbout me: 44 years old man, I work full time in organic produce (meaning produce perks for you!). My weekdays are mostly taken up with the work and exercise routine, plus a little time with a few important friends. I tend to go to bed early and rise early, and I&apos;m looking for someone with similar habits (this is not a party house). Weekends I spend with my 4-y.o. little boy, who stays over most Friday and Saturday nights.<br>\n<br>\nAbout you: I&apos;m looking for a positive person who is professionally employed or is a full-time student in a graduate program. You keep regular hours, and appreciate quiet at night. You like kids, and they like you. Perhaps you even have a child who comes over to stay occasionally? You are a respectful person and communicate in a clear and positive manner.<br>\n<br>\nThe room is $500 per month + utilities . Total move in costs are first month rent +375 security deposit . Utilities are electric, gas, water and internet. The room is unfurnished (the bed and table in the pics will be removed, unless you want to use them..)<br>\n<br>\nSorry, no pets. Sorry, no smokers.<br>\n<br>\nIf you&apos;re interested, drop me an email with some information about yourself. Include a phone number. If it sounds like we&apos;d be a good fit, we can take it from there. Thanks!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942281175.html"
    },
    {
        "title": "Share beautiful 3 bdrm house w/ huge yard in Woodstock",
        "href": "/mlt/roo/4921375259.html",
        "time": "2015-03-21 07:37",
        "price": "$800",
        "neighborhood": " (45th Ave. Woodstock)",
        "postBody": "\n        I need a roommate to share a beautiful spacious 3 bedroom mid-century ranch style house in Woodstock. We&apos;ve got 3 bedrooms, a large front room, dining room, a really nice bright kitchen with lots of space and a cute breakfast nook and laundry facilities. All of the rooms have large windows so the house is nice and bright even on those cloudy days. There is one and a half baths. The main bathroom is set up for two people.<br>\n<br>\nThere is a very large yard (double lot) so a love of gardening would be a plus. We do have to care for the yard. I have a yard person to mow. Someone who will stick around and garden with me every now and again would be great. I will need help with the yard even if you don&apos;t garden, there are leaves to rake and a general sense of care is important.<br>\n<br>\nThere is central air and heat along with a wood fireplace. The house is also on a major bus route and very close to Woodstock shops and the New Seasons that is going in.<br>\n<br>\nI am looking for a quiet and kind roommate. I am laid back and clean, but I&apos;m not obsessive. We can have a party or two and the yard is really set up for some great summer parties, but all in all I work hard and need my sleep, so quiet after bedtime on the weekdays is needed. <br>\n<br>\nI have a dog and a cat. Someone who understands and loves animals is important.<br>\n<br>\nSomeone who is responsible pays their rent on time is a must. Friendly is good! Someone who works hard or studies hard will fit in just right.<br>\n<br>\nThere is flexibility on how much you want to share the house. The front room is open for furniture and complete share. The dining room is free for furniture and share as well. There are two free rooms and I can take one or not. So your rent depends on how much space you want to take. It will be between $800 and $1000 plus some utilities (depending on how much space you take). For move in you need first and last months rent plus an $800 deposit. Move by April. You will need to be approved by the owner who will require an application and a credit check.<br>\n<br>\n<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00Y0Y_dGPPyVcATLW_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4921375259.html"
    },
    {
        "title": "Inner SE Room With Deck /Utilities Included",
        "href": "/mlt/roo/4942238481.html",
        "time": "2015-03-21 07:25",
        "price": "$475",
        "neighborhood": " (Inner SE Portland)",
        "postBody": "\n        Great room for the right person.(fun, creative, D.I.Y., bookish, communication, musicians, artists, students,writers,vegans (I am not a vegan , but trying !), yogis, meditation, non-smokers, moderation, clean, respectful, employed, ) Older but warm house, garden space,10&apos; by 11&apos; single occupancy only, (with twin bed), has an alcove closet, hardwoods, share updated bathroom, usually quiet, (not all the time!) low traffic household ,there is no storage available for you, there is wi-fi and a washer/dryer, close to bus stops, future Max stop, bike lanes and parks (Second daylight basement (unfurnished) bedroom, may be available soon, 10&apos; by 11&apos; single occupancy only, carpet, has an alcove closet, two windows,(funky)( Rent covers all utilities, but utilities may be included past a cost point ),I am sorry, no pets. $150. move in deposit. We can exchange references.  Thanks!\n    ",
        "image": "http://images.craigslist.org/00e0e_1etLKGMz3Ty_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942238481.html"
    },
    {
        "title": "roommate 2 br, 2bath apt,Multnomah",
        "href": "/mlt/roo/4915815864.html",
        "time": "2015-03-21 06:50",
        "price": "$550",
        "neighborhood": " (by Gresham)",
        "postBody": "\n        Transgender woman looking for roommate for 2 bedroom, 2 bath apartment.  I have 2 cats. Washer and Dryer in apartment.  Pool and party room available.  Split rent and utilities.  Your rent, $550.00<br>\nper month, your utilities, $60.00.  Need 1st, last month&apos;s rent, and $550.00 security deposit.  Best to contact me through texts, may leave voicemails if needed.  \n <a href=\"/fb/pdx/roo/4915815864\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nCynthia\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4915815864.html"
    },
    {
        "title": "Room 4 rent",
        "href": "/mlt/roo/4942064745.html",
        "time": "2015-03-21 04:07",
        "price": "$430",
        "neighborhood": " (Inner SE Portland)",
        "postBody": "\n        Location is: Brooklyn neighborhood (inner SE Portland, south of SE Powell).<br>\nServed by TriMet routes 9 (Powell), 17 (Holgate), 19 (Milwaukie), 33, 66 (OHSU express), <br>\n70 (to Lloyd Center), and (coming in September of 2015) the  new Orange Max line<br>\n<br>\n<br>\nThe room:<br>\nWhite stucco-y walls, beige carpet, 3 electric outlets, single large ground floor window, open closet (with a space above  for 3 large Rubbermaid tubs on top).<br>\n<br>\n<br>\nWhat am I looking for?<br>\nMature, clean, respectful, super quiet person with no pets.<br>\n<br>\nLong term renters (at least 1 year - no lease required though, rental is month to month).<br>\n<br>\nPrefer someone who works either downtown, the South waterfront (OHSU), SE Portland, <br>\nor the Central Eastside district.<br>\n<br>\nAll potential renters must provide written/verifiable proof of incomes, either:<br>\n- government/disability/Social Security direct deposit <br>\n- full time (40+ hours per week) job<br>\n <br>\nThis insures you will be able to pay (in cash) $1000.00 move in cost (1st, last, &amp; security deposit)<br>\nThe person renting this room will also be required to pay half of the monthly utilities, <br>\nwhich usually consist of:<br>\n1.) Electricity - $30.00/month in summer, $50-70 per month in the winter<br>\n2.) If desired: Internet Wi-Fi 802.11n/g (CenturyLink 3Mbps) - $15.00 per month<br>\n<br>\nMe:<br>\nI am adult 40+ male who spends most of the time on my multiple computers <br>\n(doing web design/development and server programming) and occasionally watching TV <br>\n(with headphones on).<br>\n<br>\nMost of the apartment complex residents are single seniors (over 65) who don&apos;t go out a lot.<br>\n<br>\nThis is a great place for those who are ready to leave the &quot;let&apos;s go clubbing/partying&quot; stage of life behind, <br>\nconcentrating instead on hunkering down and working long hours to save as much money as possible <br>\n(in hopes of renting a place by yourself eventually).<br>\n<br>\nI don&apos;t have phone/texting, so please use the Craigslist email reply above and include your non-anonymized email if you want/expect a reply.<br>\nThanks.<br>\n<br>\nRe-posted: 03/21/2015<br>\nA very discouraging week last week.<br>\n<br>\nScheduled half a dozen people to meet with and, although all agreed to the appointment times, no one actually showed up.<br>\nI have a prior commitment this weekend, but will try to schedule a number of people who respond over this coming week for next weekend.<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942064745.html"
    },
    {
        "title": "Room available! Small urban farm setting",
        "href": "/mlt/roo/4937294451.html",
        "time": "2015-03-21 02:10",
        "price": "$425",
        "neighborhood": " (SE)",
        "postBody": "\n        THE HOUSE:<br>\nA 3 bedroom 2 bath ranch style home with hardwood floors.  It&apos;s just a block or two away from the Springwater Corridor Trail.  Quiet street.  Also easy access to I205.  Front and back yards are fenced and filled with gardens, fruit trees (some still quite small), and a fenced area belonging to our 2 pygmy goat friends and 5 chickens.  They are very amusing to hang around with.  Washer and dryer in the laundry room.  Wood stove in the living room.  My partner and I have a bathroom in our room so you would mostly have the main bathroom to yourself (except for the occasional guest or one of us using it from time to time.)  We simply ask that you keep it clean. There&apos;s a lot of cupboard and shelf space in the bathroom. <br>\n<br>\nWe reuse, recycle, compost and use natural cleaning products.  No drinking/no smoking house. <br>\n<br>\nCURRENT HOUSE INHABITANTS:<br>\nI&apos;m 36 yrs old, trans male qpoc, i love plants, cooking, gardening, hiking with the goats, being amused by the furry and feathered friends here, being creative, working with herbs, and am building a small herbal tea/educational business.  I do some work from home and also work full time outside of the house.  I enjoy doing projects in the yard and house and like spending time outside of the city.  I like to keep shared space clean, can be social and also enjoy time to myself.  I go in and out of regular meditation practice.  <br>\n<br>\nMy partner is 34 yrs old, also enjoys gardening and creating fun, pleasant, usable space.  This ranges from house and yard projects to quiet time with an art project.  She enjoys dance and movement in many forms.  She loves being outside in beautiful places and enjoys trips out of the city.  She&apos;s sometimes social and sometimes taking time to herself.  She occasionally gets into pie baking mode and that&apos;s always delicious.  She works full time out of the house.  Generally Sun-Thurs.  <br>\n<br>\nOscar the cat does a lot of sleeping and purring in various desirable locations around the house and yard.  We&apos;ve been best buds for about 17 years now.  Oscar&apos;s very sweet and tends to be nervous around other animals who pay too much attention to him.  <br>\n<br>\nYOU:<br>\nYou are thoughtful of shared space, happy to wash your dishes, and chip in with sweeping and such.  You have a reliable income and pay your rent/bills on time.  You are queer and trans friendly and generally open minded.  You are pretty quiet after 10pm and before 8am.  You are happy to live in a house with no alcohol/drugs whether or not you partake elsewhere.  Ideally it would be nice if you enjoy the plants and animals that live here as well.  Lets see.. why don&apos;t you tell us more..<br>\n<br>\nTHE ROOM FOR RENT:<br>\nAround 140 square feet, has a ceiling fan, closet with some built in shelves and a window that faces west and the backyard - Rent is $425. Utilities (electric, water/sewer, trash, wifi, wood) is $125.  SO, Rent + Utils = $550/ month.  Available March 17th.  Lease is month-to-month but we are hoping to find someone for a long term situation.  <br>\n<br>\nEmail me with questions and let me know a little about yourself and what you&apos;re looking for in a living situation.  When are you looking to move in somewhere?  For how long?  <br>\n<br>\n$550 Rent/util + $550 security dep. to move in.  We could work out a way to split up the security deposit if needed.  <br>\n<br>\nI listed the cross streets below - the house itself is on Clatsop St where there is no traffic and it feels very private.  <br>\n<br>\nThanks!<br>\nDaniel<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4937294451.html"
    },
    {
        "title": "&#x25BA;---LONG TERM WEEKLY SHARED HOUSING---&#x263B;---HURRY---",
        "href": "/mlt/roo/4942018378.html",
        "time": "2015-03-21 01:44",
        "price": "$160",
        "neighborhood": " (SE PORTLAND)",
        "postBody": "\n        * LONG TERM WEEKLY SHARED HOUSING<br>\n* SRO=SINGLE ROOM OCCUPANCY=1 PERSON<br>\n* FURNISHED ROOM<br>\n* SHARE KITCHEN<br>\n* EUROPEAN SHARED BATHROOM<br>\n<br>\n* ROOM PRICES $160 + UTILITIES<br>\n* FREE BASIC CABLE &amp; WIFI<br>\n* EASY BUS TO CITY CENTER<br>\n<br>\n* SMOKE FREE<br>\n* ALCOHOL &amp; DRUG FREE ZONE<br>\n* NO VISITORS/GUESTS<br>\n* NO ANIMALS<br>\n<br>\n<h2>SE PORTLAND &lt;&gt; \n <a href=\"/fb/pdx/roo/4942018378\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n&lt;&gt;</h2><br>\n<br>\nAll rooms subject to prior rental. Minimum stay required 5 weeks. We reserve the right to make changes without notice, and are not responsible for errors or omissions. All prices exclude city, county, state, and federal fees and taxes, screening fees, and deposits.<br>\n\n    ",
        "image": "http://images.craigslist.org/01515_aH3tb8E5qSe_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942018378.html"
    },
    {
        "title": "1 or 2 Females Needed for Dorm-Style Room-Share",
        "href": "/mlt/roo/4942028592.html",
        "time": "2015-03-21 01:43",
        "price": "$375",
        "neighborhood": " (SE Brooklyn St)",
        "postBody": "\n        I am seeking 1 or 2 college-type women to share my large room. I have a twin loft bed frame and matching twin bed frame available for use at this time or you can bring your own. You supply mattress*, bedding*, and desk. We would share a private bath. (* I may provide this depending on the circumstance)<br>\n<br>\nHouse has fully equipped kitchen, a second (small) fridge, a garage (storage only), washer and dryer, a TV/blu ray player/wii, and a half bath on the first floor.<br>\n<br>\nA) Due to allergies, no pets can be accommodated. <br>\nB) Due to my brother and a roommate also living in the house, I am lookinyg to maintain a peaceful and respectful atmosphere in the house. The ideal people/person for sharing my room would be students, as I am a student. I timed myself walking to PCC from the house: it is a 12-15 minute walk. To Warner Pacific main campus, it is 25 minutes&apos; walk (probably really fast by bike). By car it is an even quicker ride. <br>\n<br>\nCost: <br>\nFor 1 person only (total 2 people in room including me): $395 (utilities included*), month-to-month contract with first &amp; last month due up-front, plus $300 refundable security deposit. -OR- $375/month (utilities included*) with renewable, (probably 12 month) lease, plus $300 refundable security deposit.<br>\n<br>\nFor 2 people (total 3 people in room including me): $315 (utilities included*), month-to-month contract with first &amp; last month due up-front, plus $300 refundable security deposit. -OR- $295/month (utilities included*) with renewable, (probably 12 month) lease, plus $300 refundable security deposit. <br>\n<br>\nAn application will need to be filled out (provided by me).<br>\n<br>\n*Currently internet is paid separately to my brother. We can arrange to have it included in the rent, if you desire.<br>\n<br>\n--The &apos;room&apos; is available immediately. To see it, respond to the email address. I am able to show it this weekend through next weekend. Starting in April I can only show it on weekends.\n    ",
        "image": "http://images.craigslist.org/00x0x_hW146kNLoo0_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942028592.html"
    },
    {
        "title": "ELS/ESL Room for Rent Inc utilities",
        "href": "/mlt/roo/4942019706.html",
        "time": "2015-03-21 01:18",
        "price": "$500",
        "neighborhood": " (Concordia neighborhood)",
        "postBody": "\n        Room for rent, available March 26.  $500,  includes utilities, fully furnished.  Single occupancy only. Located in Multnomah county, NE Portland.<br>\n  <br>\nThis room is priced lower than our others because it is located in our basement which is used for storage the room itself is new construction and very nice with it&apos;s own thermostat.  If you are okay with this, Give us a call.<br>\n<br>\nWe are twenty minutes walking distance from Concordia University, one block from Trimet 70 bus route. Trimet from our house to PELA or Kaplan is 35 minutes.  Rooms are in our family&apos;s home (Wife/Carol, Husband/Dan).  We have a small, friendly 13 pound ShihTzu dog, Corey.    <br>\n<br>\nWe have hosted students from Taiwan, Japan, South Korea, China, Thailand, Saudi Arabia, UAE and Russia, and have enjoyed them all.  We treat our students like family.  You are responsible for your own food.  We are available for conversational practice.  :)<br>\n<br>\nINCLUDES;  Utilities, wifi, fully furnished (bed, bedding, chair, desk, office chair, mini fridge, closet with storage,  hardwoods on main floor, dishwasher, flat screen TV in living room, basic cable, shared kitchen, shared bathroom (share with other students), shared washer and dryer,  fenced backyard.  You may use our dishes, towels, etc...as long as you clean them and put them away.<br>\n<br>\nNEARBY: We are on a corner lot on the NE Portland bike highway.   Alberta Arts District with lots of restaurants and shops.  Walgreens, New Seasons, Hot Lips Pizza, and Subway at NE 33rd and Killingsworth.  McMenamins Kennedy School theater, restaurant, pubs and hotel.  Shops and restaurants on NE Fremont.<br>\n<br>\nRent is $500/month.  Move in requires first month&apos;s rent and $275 deposit.  Month to month, longer term may be available in the future. Single occupancy only.  Occasional drinking.  No recreational drugs, no smoking, no additional pets.  Friends may visit, but no overnight guests. You would need to clean up after yourself, including your dishes, and clean your bathroom every fourth week.  <br>\n<br>\nIf you&apos;re interested, we would love to hear from you.  Please call or text Carol at \n <a href=\"/fb/pdx/roo/4942019706\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n  This is also my business phone, so I may answer with the name of my business,&quot; Enhancements,&quot;  (salon).\n    ",
        "image": "http://images.craigslist.org/00E0E_f0KyM3U0ER1_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942019706.html"
    },
    {
        "title": "&#x25BA;---LONG TERM WEEKLY SHARED HOUSING---&#x263B;---HURRY---",
        "href": "/mlt/roo/4942017612.html",
        "time": "2015-03-21 01:14",
        "price": "$160",
        "neighborhood": " (SE PORTLAND)",
        "postBody": "\n        * LONG TERM WEEKLY SHARED HOUSING<br>\n* SRO=SINGLE ROOM OCCUPANCY=1 PERSON<br>\n* FURNISHED ROOM<br>\n* SHARE KITCHEN<br>\n* EUROPEAN SHARED BATHROOM<br>\n<br>\n* ROOM PRICES $160 + UTILITIES<br>\n* FREE BASIC CABLE &amp; WIFI<br>\n* EASY BUS TO CITY CENTER<br>\n<br>\n* SMOKE FREE<br>\n* ALCOHOL &amp; DRUG FREE ZONE<br>\n* NO VISITORS/GUESTS<br>\n* NO ANIMALS<br>\n<br>\n<h2>SE PORTLAND &lt;&gt; \n <a href=\"/fb/pdx/roo/4942017612\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n&lt;&gt;</h2><br>\n<br>\nAll rooms subject to prior rental. Minimum stay required 5 weeks. We reserve the right to make changes without notice, and are not responsible for errors or omissions. All prices exclude city, county, state, and federal fees and taxes, screening fees, and deposits.<br>\n\n    ",
        "image": "http://images.craigslist.org/00u0u_35lqsQZccNm_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942017612.html"
    },
    {
        "title": "One roommate wanted for our awesome house near Mississippi!",
        "href": "/mlt/roo/4942003781.html",
        "time": "2015-03-21 00:30",
        "price": "$590",
        "neighborhood": " (N/NE Portland)",
        "postBody": "\n        We&apos;re a group of four looking for a fifth housemate to fill an upstairs room in our adorable house beginning April 1. We live right next to all the shops and restaurants on N. Williams and a short walk to N. Mississippi. Five minutes to downtown by car, and we&apos;re on the Vancouver/Williams bikeway, and there&apos;s public transit galore in our &apos;hood.<br>\n<br>\nOur house has an amazing porch, an awesome back deck and a dreamy garden/yard full of flowers and plants. Yard is fully fenced. <br>\n<br>\nWe are all in our mid-20s: 3 gals, 1 guy and 2 sweet, fantastic pooches. We are all friendly, relaxed folks with jobs. Emily works at Powell&apos;s and likes riding her horse and snuggling with Tina, her sweet chunky-monkey dog. Anya works at Papa Haydn&apos;s and spoils us with sweet treats. Alex works for Portland Running Company and is building a tiny house. Lindsey is a bartender and also has a sweet pup.<br>\n<br>\nWe all get along so well that there could be a sitcom about us if only we weren&apos;t so boringly pleasant to each other. We  sometimes hang out for drinks or crappy TV marathons, and we&apos;re friends, but we won&apos;t bug you if you&apos;d rather not see our faces that much. We are not the passive-aggressive note-leaving, house meeting type of deal -- we trust that we can coexist comfortably and happily without micromanagement, and we&apos;re looking for a roommate who digs that. The closest you&apos;ll come to house &quot;management&quot; is a note on the chalkboard that says, &quot;I cleaned the kitchen! Let&apos;s keep it nice.&quot; We are aggressively unconcerned with your sexual preferences, food choices, recreational activities and political leanings (as long as you&apos;re not the worst. Homophobes/animal kickers/racists/bullies need not apply).  We keep the kitchen pretty clean, but we don&apos;t look like a model home. We&apos;re all willing to help out with the cleaning, but our natural state isn&apos;t immaculate. You shouldn&apos;t eat off the floor, but you don&apos;t do that anyway, right?<br>\n<br>\nThe space ($590 for your room): <br>\n*Upstairs, shares a bathroom with Emily and Alex. The other two rooms use different bathrooms and are on different floors.<br>\n*Carpeted<br>\n*Normal-sized -- can fit a full bed, desk, dresser, shelves, etc. <br>\n*Windows that give awesome light all day.<br>\n*W/D in the basement<br>\n*Street parking and enclosed driveway that we don&apos;t use but you can if you want.<br>\n*We&apos;re fully furnished (the room is NOT), but you&apos;re welcome to bring whatever you want and we can make room.<br>\n<br>\nWe&apos;re looking for someone who:<br>\n*is just one person. Sorry, but our lease only allows a total of five people.<br>\n*plays well with others and is sane<br>\n*is employed or in school or can otherwise pay your bills on time every time (seriously, be able to pay your bills)<br>\n*likes dogs. Our pups are part of the family, and you should expect to be cuddled if you&apos;re in the common areas. They&apos;re well-behaved and total darlings. No more pets, sorry!<br>\n*doesn&apos;t run a tarantula-breeding business or similar<br>\n<br>\nSerious Business:<br>\n*Our lease requires an $1120 deposit per housemate. We know, we know, it&apos;s a big deposit. Our landlord did it that way instead of asking a deposit+last month&apos;s rent. The house and neighborhood are worth it! And you&apos;ll get it back when you move out! Think of it as a savings account? The roommates who have switched out in the past have all gotten their full deposits back. Our landlord is awesome and fair, and unless you ditch us without notice, don&apos;t pay your rent or take a sledge hammer to the walls, you are going to get the deposit back. IF everything else seems perfect but you can&apos;t swing the whole deposit, let us know and we can work something out where one of us puts in and extra half (and gets that amount back).<br>\n*We split utilities and internet evenly. Averaging about $70 total per person for the summer, and a little higher once heat goes on. Water is quarterly. To be safe you should budget $100ish for bills each month.<br>\n*Our lease runs until January 2016, and if we&apos;re all still happy we can re-sign.<br>\n<br>\nLet us know if you want to check the place out or talk with us!\n    ",
        "image": "http://images.craigslist.org/00q0q_3fKUEdgW5By_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942003781.html"
    },
    {
        "title": "Furnished room",
        "href": "/mlt/roo/4942005042.html",
        "time": "2015-03-21 00:17",
        "price": "$650",
        "neighborhood": null,
        "postBody": "\n        Fully furnished large room opening in a house located on SW Jackson and Broadway St. The house is well organized and has a weekly maintenence to clean. There are five bedrooms, three bathrooms and two kitchens. The room receives a lot of sun during the day. All utilities are included. <br>\n<br>\nGood for PSU, OHSU, PCC students or people who work downtown. <br>\nHas street parking only. <br>\n<br>\nTo make an appointment to view the room please call Sousan Brown at \n <a href=\"/fb/pdx/roo/4942005042\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n <br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00v0v_bXZYqTKD58f_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4942005042.html"
    },
    {
        "title": "Room Available 4/1/15",
        "href": "/mlt/roo/4941973034.html",
        "time": "2015-03-20 23:03",
        "price": "$675",
        "neighborhood": " (SE Holgate Blvd)",
        "postBody": "\n        Bedroom available in a brand new 4 bedroom 2 1/2 bath home. Bedroom is 10x12 located on the 1st floor.<br>\n<br>\n17 Tri-met bus located right outside home. This bus goes directly across Ross Island Bridge and have stops near the waterfront and PSU.<br>\n<br>\nConveniently located near PSU/OHSU (roughly 4 miles), walking distance to Trader Joe&apos;s, Walgreens, Starbucks, and Safeway<br>\n<br>\n $675 per month + $100 for utilities<br>\n<br>\n<br>\n$300 deposit fee + $25 background check<br>\n<br>\nAbout me: I&apos;m a 27 year-old male student attending PSU in a pre-dental Post-Bac program. I just moved to Portland from San Francisco last year to attend school.<br>\n<br>\nOther roommates: There are 2 other roommates - a male and female. Both attend OHSU and are in their 20s.<br>\n<br>\nAbout you: I am looking for a laid back roommate who can pay the rent on time and is easy to get along with. I&apos;d prefer to have someone clean but does not need to be OCD.<br>\n<br>\nAbout the home: This is a newly constructed home built in March 2014. It is approximately 1930sqft with 4 bedroom and 2 1/2 bath. All appliances are new and upgraded. Photos are before the home was furnished. For photos of the furnished home, let me know.\n    ",
        "image": "http://images.craigslist.org/00202_4Ibo8AJxZDr_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941973034.html"
    },
    {
        "title": "Room in Inner NE with Rad Roomies!",
        "href": "/mlt/roo/4941961067.html",
        "time": "2015-03-20 22:32",
        "price": null,
        "neighborhood": null,
        "postBody": "\n        We are 4 queer folks in our twenties and thirties (barely) looking for an awesome roommate to share our house! We all work full time with fairly regular hours. Together we enjoy cooking and eating brunch, watching Chopped, exploring all this great nature, trivia, board games, beers, concerts, backyard fires, and the occasional dance party. We care about each other, enjoy each other&apos;s company, respect each other&apos;s need for private time, and are looking for someone who will do the same. No cigarette smokers please.<br>\n<br>\nThe house:<br>\nThe Woodlawn/Concordia neighborhood is wonderful - close to Alberta Arts, bars/restaurants/coffee shops in walking distance, Alberta Park is blocks away, New Seasons is a short bike ride, and public transportation is readily accessible. Close to the 8, 72 &amp; 75. 4 bedrooms, 2 bathrooms. All new, energy-efficient appliances. W/D on-site. The garden has been dabbled in, but there&apos;s lots more room to plant!<br>\n<br>\nThe room:<br>\nThe room is carpeted and has access to the semi-finished attic. It has a big closet and windows that let in afternoon light. Available April 1. <br>\n<br>\nThe numbers:<br>\nRent is $430/mo + utilities. Rental application $30. You would need to sign onto the lease (which goes through Sep 30) with $420 security deposit. <br>\n<br>\nCats:<br>\nWe have 2 tri-colored lady cats, Turkey and Phoebe. They are wonderful but unfortunately we don&apos;t have room for more pets. <br>\n\n    ",
        "image": "http://images.craigslist.org/00909_3d9LdLNSLeO_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941961067.html"
    },
    {
        "title": "guy and dog need guy housemate",
        "href": "/mlt/roo/4941961349.html",
        "time": "2015-03-20 22:29",
        "price": "$550",
        "neighborhood": " (N Williams Ave)",
        "postBody": "\n        I find that I have better luck with guys so I would prefer a guy.  I&apos;m willing to entertain the possibility of another dog, with plenty of provisions. Any other kind of animal is going to be seen as food by the existing dog.<br>\n<br>\nThe house is located a short walk to Mississippi Ave and a shorter walk to the Williams shopping district. New Seasons is just down the street.<br>\n<br>\nWe&apos;re on a major bus line and bike lane and we&apos;re 5 minutes from downtown by car, if anyone wants to attempt that.<br>\n<br>\nUtilities and fast internet included, $550.  First and last required. Available 1 April.<br>\n<br>\n14 1/2&apos; X 12&apos; upstairs room with additional 3&apos; x 8&apos; closet.<br>\n<br>\nEasy going, drama free, relatively quiet except when I&apos;m making noise.  Noise is typically music making. <br>\n<br>\nFeatures include:  washer/dryer, dishwasher, cable internet, reverse osmosis water, plenty of cooking paraphernalia, espresso machine, kitchen gadgets, tech based alarm system, canine based alarm system, charming dog (more about this later), commuter bike parking on the front porch, limited storage in the basement, natural wood floors throughout, a bathroom with a kickass shower, another bathroom with an excellent tub.<br>\n<br>\nThe house is a 3 bedroom Victorian that has mostly been restored and is always improving.  There is a living room, dinning room, library, antechamber to the library, breakfast room , front porch, small courtyard in back with a bench, two bathrooms etc. We recycle everything possible, keep the temperature at a balmy 60 during the day and 62 in the evening, flush only when necessary and generally try to be as green as possible.<br>\n<br>\nI&apos;m looking for someone who will want to make this home and stay for a long time. It sucks to have people moving in and out. I&apos;ve had many housemates who have stayed between 1 and 3 years and that&apos;s ideal.  I realize things change, but be honest with intent, please.<br>\n<br>\nREAD THIS CAREFULLY !  Certain things in artificial fragrance give me respiratory problems so NO perfume, smelly soap or shampoo, body spray, scented candles, hair product, laundry soap, those horrible things people put in the dryers, scented toilet paper, whatever else may have chemical scents. Natural scent is ok, but seriously, almost everything has &quot;fragrance&quot; in the fine print ,which means chemical, so none of it please. Seriously: IT MAKES ME ILL.  And if you have friends who bathe in perfume and visit you often, you will have to do something to try and keep the perfume out. <br>\n<br>\nI&apos;m a classical musician and woodworker. http://www.minnerlyfurniture.com  So there is music playing and practicing at times. I have no problem with musicians as long as it&apos;s not loud electric. The room is well situated to not bother neighbors by practicing. I have my woodworking shop in the basement, so I make noise down there sometimes but I try to do it when people are away or, at least,  when no one is sleeping. I sometimes have people over to play music.<br>\n<br>\nThe house is filled with antiques, some of which have been in my family for 200 years, so you need to be able to live around antiques. The furniture can be used but not abused.  THIS IS IMPORTANT.  If you have only lived with particle board and plastic furniture and don&apos;t know how to behave around nice furniture then you can stop reading here. <br>\n<br>\nYOU MUST LIKE DOGS. Seriously, I don&apos;t mean tolerate, I mean like.  If you are willing to make the effort to be friends and relate to her, all will be good, if not there will be annoying barking which will not be blamed on her. It&apos;s pretty simple; if you like her she&apos;s awesome. She&apos;s a really smart sheltie.<br>\n<br>\nUnfortunately, the servants, scullery maids, and housekeepers have been let go, so we all have to pitch in to keep things clean. It&apos;s one of those annoying austerity measures that we have to live with. I take responsibility for most of the vacuuming and dusting, but if people use the kitchen and bathrooms then I expect that people will help keep them clean. Cleaning up after yourself is a start, but that is only some of what it takes to keep things clean.<br>\n<br>\nI don&apos;t eat mammals, although I do eat birds and fishes. If you&apos;re a militant non meat eater, be warned that Argos, the dog, does eat meat; raw crunchy bones with meat. I don&apos;t mind meat eating as long as it&apos;s a minimum and doesn&apos;t involve lots of frying. Frying and sauteing are antiquated ways of cooking according to my French cookbook.  I don&apos;t fry things and prefer that it be kept to a minimum; it gets grease all over the house, makes the house smell like a fast food joint and is bad for your health. If you equate cooking with frying, then this isn&apos;t for you. I prefer someone with some awareness of clean natural eating.  Sharing meals is nice but almost never works out with peoples schedules, so whatever.<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00R0R_c8jLtYTaI0Y_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941961349.html"
    },
    {
        "title": "Sunny Pvt FURNISHED Room! Large Yard to Enjoy",
        "href": "/mlt/roo/4941961188.html",
        "time": "2015-03-20 22:29",
        "price": "$550",
        "neighborhood": " (ne portland)",
        "postBody": "\n        IMMEDIATE OCCUPANCY! Great opportunity for a person new to the area in a good neighborhood, close to public transportation, shops &amp; services, parks n&apos; Libraries.<br>\nPark your car and bike everywhere from here-----that is what I do and it works well.<br>\nI&apos;m quiet, studious and occasionally have wild Scrabble, Backgammon &amp; Trivial pursuit parties/get-togethers with other over-educated, well traveled friends.<br>\nI&apos;m looking for someone who is Liberal, Progressive and Open Minded---------no grinches allowed!<br>\ndoes this sound like it might work for you? This is not a &quot;Party House&quot; even though I&apos;m 420 freindly. I&apos;m into clean &amp;sober living, practice Naturopathy. A heavy drinker &amp; smoker would not like it here. I would not like you either.<br>\nMy 3 &apos;Kitties&apos; are clean and friendly. Yours would be welcome, also.<br>\nRent includes: FREE Wi-Fi, Utilities, laundry  and Storage Space. Move in costs are: $550 + $200 (Available April 1st!) Refundable Security Deposit + $50 cleaning fee (non-refundable) + 2 references. $800 to move in.\n    ",
        "image": "http://images.craigslist.org/00x0x_arh02LDyGLc_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941961188.html"
    },
    {
        "title": "Rooms for rent near lewis &amp; clark",
        "href": "/mlt/roo/4941949579.html",
        "time": "2015-03-20 22:07",
        "price": "$560",
        "neighborhood": " (Burlingame/Hillsdale/OHSU/SW Portland/Markham)",
        "postBody": "\n        Smaller room $560, bigger room $590<br>\nwalk to bus line. <br>\nwasher dryer included<br>\nsingle occupancy.<br>\nno pets.<br>\nno smoking.<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941949579.html"
    },
    {
        "title": "Available room in a Nice Home",
        "href": "/mlt/roo/4922778443.html",
        "time": "2015-03-20 21:47",
        "price": null,
        "neighborhood": " (Portland)",
        "postBody": "\n        A possible room for rent for 1 person in a 3 bedroom 2 bath house with a fenced yard. The house is nice and clean. It is located SE Portland with easy access to 205. Looking for the right person to rent a room in my home. The person is a professional, mature and tidy. No smoking, drugs, pets. Light alcohol use ok. $500 per month +1/2 of utilities. Will need to pay partially refundable $200 cleaning deposit and $125 non-refundable security deposit at move in. <br>\nAbout me: I like to kayak, bike ride, x-country ski and am a professional.\n    ",
        "image": "http://images.craigslist.org/00g0g_2lYe73Xqakw_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4922778443.html"
    },
    {
        "title": "@@@@@ Hood View room PEARL DISTRICT apt! @@@@@@",
        "href": "/mlt/roo/4935473500.html",
        "time": "2015-03-20 20:56",
        "price": "$699",
        "neighborhood": " (Pearl District)",
        "postBody": "\n        This is a revised ad.. (apologies on delayed responses; one applicant tried and failed the application process, so the apt is back open and available!)<br>\n<br>\nAvailable NOW: 1 room in a nice 2-bdrm apt for $699 monthly (if you stay over 4 months; $749 if less) + 1/2 net &amp; electricity ($60 background screening fee, $20 refunded upon accepted &amp; signed lease agreement!).&#xA0;HUD Housing type. You get dibs on furnishing the front/dining rooms, deck, remaining hall, and the space to put a cupboard in bathroom, etc., etc.<br>\n<br>\n- YOU: It&apos;s okay if you are a student! Couples welcome ($800 + 2/3 total). Please clean up after yourself rather quickly, though you don&apos;t have to be OCD all the time; help with occasional household scrubbing chores (or discuss maid); pay bills on time!; no pets. The normal courteous manners. <br>\n<br>\n- ME/ROOMMATE: I&apos;m a nonsmoker, GONE MOST NIGHTS a week and quietly in my room mostly when home. I&apos;m a very reasonable, laugh a lot, easy to talk to, thirties gal who loves being active, going out and about, Timbers &amp; Blazers, 24 Hour Fitness, and enjoying festivals and all that Portland has to offer. Ask anyy questions about me/home!<br>\n<br>\n- BEDROOM: Unfurnished, view of mount Hood &amp; Convention Center tops, 10x12&apos;? room, regular size closet, east facing window&#xA0;<br>\n- *FRONT/DINING ROOM: ceiling fan, some closet space. Room will be EMPTY and you get dibs on furnishing.<br>\n- *DECK: regular size. Will be empty, and you get dibs on furnishing. Gas BBQ ok, charcoal not allowed.<br>\n- KITCHEN: built-in microwave, dishwasher, stove, regular size fridge, half of cupboards are yours (there&apos;s room to add a shelf/cabinet too, if we wish).<br>\n- STORAGE UNIT in bldg: basically FREE! You pay a $35 deposit, and it&apos;s fully refunded upon move out.<br>\n<br>\nBuilding has nicely landscaped private sun patio area with chairs &amp; tables, nice gas fireplace-lit lobby, recycling/garbage room just down hall, free secured bike parking room, secured main lobby, large coin-operated washer &amp; dryer facility in building (snack &amp; drink vending machines); fitness center in building with treadmill, elliptical, free weights and weight machines; LEED certified (built with super earthquake technology!).<br>\n<br>\nIndoor covered parking garage spots $110, or on-street metered parking, or free street parking is just a few blocks away, and the streetcar runs on our street! Lotsa TriMet nearby.<br>\n<br>\n- WALKING DISTANCE: Everything Pearl District is walking distance! First Thursday Arts festivities, Saturday Market, restaurants, convenience store, Le Happy creperie, Sister&apos;s Coffee, yoga, LA Fitness, 24 Hour Fitness, Office Max, Starbucks &amp; other coffee places, Safeway, Lovejoy Bakery &amp; Sandwiches, Supa, many breweries &amp; bars- Pink Rose, Bridgeport Brewery, the Fields Sports type bar; banks, a park with benches across street, etc..<br>\n<br>\nIf you are interested and would like to know more or meet in person and see the apt, please email me! Thanks for reading!!<br>\n<br>\nTags: monthly month PSU Lewis Clark State 420 friendly street car section eight downtown nw couple\n    ",
        "image": "http://images.craigslist.org/00d0d_c5uln17qFUZ_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4935473500.html"
    },
    {
        "title": "Room Available",
        "href": "/mlt/roo/4934086524.html",
        "time": "2015-03-20 20:47",
        "price": "$500",
        "neighborhood": " (NE Prescott \\ NE 60th)",
        "postBody": "\n        I am going to be moving out of town and am looking for someone to take over my room by April 7th.<br>\n<br>\nRent is $500/per month and includes utilities.<br>\n<br>\nHardwood Floors, Beige Walls, Large Closet with tons of storage space. Newer paint and fixtures. No mold.<br>\n<br>\nShared bathroom - I&apos;ve never had an issue getting into the bathroom, we are all respectful.<br>\nShared living area - Cable TV and WIFI included.<br>\nShared Kitchen - with a large variety of cooking/eating utensils, dishes, pans, etc.<br>\nWasher and Dryer in house.<br>\nLarge backyard with plenty of room for gardening and what not.<br>\n<br>\nSmoking ok outside. <br>\nWe do drink, but don&apos;t &quot;normally&quot; bring the party home. <br>\nOk to have friends over as long as everybody is respectful of other peoples space, things, and work schedules.<br>\n<br>\nWe have many pets. Snake, Cats, Lizards. A dog. Chickens.<br>\nIf you plan on bringing a pet it will need to be approved first.<br>\n<br>\nIf you would like i do have a bed, dresser, and 2 shelves i would be willing to leave.<br>\n<br>\nMost of the house works office hours and goes to school so week night are typically pretty quiet.<br>\n<br>\nThe house is fairly clean but also a little messy. Deep cleaning is done on the regular but you can definitely tell people live here. <br>\n<br>\nMessage me using the email link or text 8five0723three220 for more information.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4934086524.html"
    },
    {
        "title": "Room for rent in nice SE woodstock home",
        "href": "/mlt/roo/4941892723.html",
        "time": "2015-03-20 20:40",
        "price": "$500",
        "neighborhood": " (SE 60th and raymond)",
        "postBody": "\n        Hi potential roommates,<br>\n<br>\n  I have a small room for rent in my Woodstock home. <br>\n<br>\nAbout the room/ house<br>\nThe room is about 10x10. Lots of windows with built in wooden blinds. Nice Hardwood floors, and a ceiling fan and light. Also, there are a lot of power outlets in the room. This room would be best for someone that does not have a lot of furniture, although there is plenty of storage in the garage and basement. The  house is pretty small, but very functional. There is a dishwasher that works great, as well as washer and dryer in the basement- both in great working order as well. The entire house has nice hardwood floors. And lots of storage space in the detached garage, as well as the basement. Which you would be welcome to use for storage. There is only one bathroom in the house, so you would have to be ok with sharing a bathroom. The shower is amazing and has two shower heads. The house has central heating and stays warm and cozy in the winter months. There are lots of big shady trees on the property, so I  imagine the summers I&apos;ll stay fairly cool in the house. There is a good sized front porch, where my dog spends most of his time. The lot itself is hug, there is a big front yard and a large back yard as well. The entire property is fenced in, and there is plenty of room in the yard for gardening, raised beds etc. the neighborhood is great and very safe, nearby an elementary school. So, it&apos;s a family neighborhood. <br>\n<br>\nAbout me<br>\n<br>\n  I am in my mid 20&apos;s working in the restaurant world, and going to school. I am not a party person, but I do enjoy a glass or wine, or two from time to time. My friend lives in the granny unit that is attached to the garage. She is also in her mid 20&apos;s working a very full time job. Due to her job, she is not home for 3 full days and nights each week. We are two very easy going, social girls that are ideally looking for someone similar to ourselves. However, that does not mean we are only open to other female roommates. If you are a clean, tidy male we would love to meet you as well.  I have a siberian husky that is 2 and very friendly, he loves other dogs and people. I also have a cat, that spends most of his time hiding in my room or outside in the yard. Because I have two animals, I would not like anymore animals living on the property. I am kind of a clean freak, not OCD but I generally keep my house and main living areas cleaner than the average person. Let me know if this sounds like something you might be interested in and I would be happy to send you pictures and more info. <br>\n<br>\nThe room is $500 plus utilities. The house is small, so utilities don&apos;t tend to be very high. But just like everywhere in Portland, water is probably the highest bill- compared to the other utilities. Looking to rent by April 20th\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941892723.html"
    },
    {
        "title": "1-BR available in 2-BR house, Buckman area",
        "href": "/mlt/roo/4941867584.html",
        "time": "2015-03-20 20:26",
        "price": "$515",
        "neighborhood": " (SE Washington St.)",
        "postBody": "\n        Looking to fill the second bedroom of a charming little house with a great central SE location in the Buckman neighborhood. It is a two-bedroom house at about 800 sq. ft, and is in close proximity to all the shops, restaurants, and bars on Burnside, Stark, and Belmont. It&apos;s got a driveway, a lovely porch, a utility shed, a partially fenced front yard/small back yard, and W/D hookups. No dogs allowed, unfortunately, but another cat might be doable. <br>\n<br>\nWiFi is already set up and runs about $20/mo. per person. Electric is usually between $50-80/mo. total. Ideally, whoever moves into the room will switch the PGE account over into their name. <br>\n<br>\nThe room itself is a decent size, neither very small nor very large; its current occupant can comfortably fit a queen-size bed, a desk with a chair, and two dressers. Also has a pretty normal-sized closet. Pictures can and will be provided upon request. The room is available beginning April 1st for both short-term or long-term accommodations.<br>\n<br>\nYou would be sharing the house with my cat, Jezebel, and me, a 24-yr old transplant from NY who has been in Portland for about two years now. I&apos;m into writing, yoga, and shoegaze. A few more things:<br>\n-I work weekends (F-M) until almost midnight, meaning I am usually up relatively late, so if you are a morning person, please keep that in mind when considering this room. It would be nice to live with someone who has a similar schedule.<br>\n-I am also very 4/20 friendly, sooo this likely wouldn&apos;t be a good fit if you&apos;re not down with that.<br>\n-I&apos;m a pretty low maintenance individual when it comes to household chores. I keep the house relatively tidy and try to contain my personal mess within the confines of my own bedroom.<br>\n<br>\nAs mentioned above, I can and will provide pictures to those interested and I&apos;d be happy to answer any additional questions you might have about the space, or me.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941867584.html"
    },
    {
        "title": "Room/Floor in Charming Close-in House",
        "href": "/mlt/roo/4941811958.html",
        "time": "2015-03-20 19:17",
        "price": "$625",
        "neighborhood": " (Inner NE Portland)",
        "postBody": "\n        House share (with one other) in comfortable close-in NE Portland home - by Irving Park. The bedroom that comes with the rental is in a nicely finished daylight basement space that has high ceilings (8&apos;). Please see photos. It is a spacious room and includes a nearly exclusive use &quot;ante-room.&quot; This house share includes use of the other rooms in the house and a sharing of two full bathrooms -- one on the first floor, the other on the second floor. <br>\n<br>\nThe household environment is laid-back but respectful - enviro-friendly with an emphasis on eating healthy, recycling, no or very little tv, visiting with friends, relaxing, etc. In general, warm and friendly, yet independent. I&apos;m 50, male, and rather involved with my work and outside work activities, so I&apos;m not home that much. House comes with a veggie garden, yard, and some native plantings, etc. Chickens may arrive this spring.<br>\n<br>\nI tend to cook once or twice a week or so and am open to an occasional food or meal share. <br>\n<br>\nNeighborhood is close-in and &quot;neighborly.&quot; All the households on the street have dinner together one night a month. It is a soup night that moves to a different neighbor&apos;s house each month. Quiet at night. Near Whole Foods (at Fremont &amp; NE 15th), Irving Park, Broadway stores, etc. Close to bus lines, bike lanes, and Max (6 or 7 blocks). <br>\n<br>\nW/D on site. Wireless included. Renter to pay a $120/mo utility charge (which covers ALL utilities -- gas, elec., water, sewer, wifi, trash, recycling). <br>\n<br>\nPhotos are of room, ante-room, dining room, kitchen and living room.<br>\n<br>\nThanks for your interest. Please let me know if you have any questions. In a reply to this post, please say a little about yourself and what you are looking for in housing. Note that I&apos;m looking for a single (ie, an individual, not a couple). Having boy/girl-friends over is of course ok, just not looking for a couple right off the bat. Pets are on a case-by-case basis. <br>\n<br>\nCheers, Steve<br>\n\n    ",
        "image": "http://images.craigslist.org/00W0W_frBemOmO9NZ_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941811958.html"
    },
    {
        "title": "{ Room for rent in a nice house Pets OK!",
        "href": "/mlt/roo/4898736078.html",
        "time": "2015-03-20 19:15",
        "price": "$675",
        "neighborhood": " (United States)",
        "postBody": "\n        Room for rent in a very nice, clean two bedroom house one block north of 60th and NE Sandy. Remodeled 3 years ago, the house has hardwoods throughout, fireplace, gas heat, bathtub, gas range and gourmet kitchen, and a washer and dryer in the basement (as well as space for storage). The large covered front porch has a hammock and two chairs for chillin in the morning sun and a big back deck for grillin later on. The yard work is done once a week by a landscape company but if you are so inclined, there is room to plant some flowers or tomato plants. The room for rent is around 14x12 and has two big windows facing west and north with a very large closet and a small storage space above the closet. Good and quiet location near Whole Foods, Safeway, Food Carts, 24 Hr. Fitness, Trader Joe&apos;s, Hollywood Theater, Yen Ha, and many shops, bars and restaurants on Fremont. The house has off street parking and is one block from major bus lines, is close to the Halsey Max station, and is very bike friendly. There&apos;s some storage and the house is pretty much furnished although the couch is not very comfortable so if ya have a good one I&apos;ll get rid of mine.<br>\n<br>\nMy name is Scott I&apos;m 38. I do custom tile for a living. I am looking for someone 25 to 40, male or female. I keep myself busy; not really a &apos;sit-and-watch-TV&apos; kinda guy. Into riding motorcycles, mt biking, snowboards, skateboards, surfing, yoga, etc. Most of time the house is very quiet. Rent is $675.00 per month with a security deposit of $650 plus an additional $100-300 deposit if you have a pet. Bills are around $100-130 per month including internet. Move in date is mar 1st. I look forward to speaking to you. No couples.<br>\n<br>\n<br>\nYou can reach me at \n <a href=\"/fb/pdx/roo/4898736078\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nThanks,<br>\nScott\n    ",
        "image": "http://images.craigslist.org/00P0P_bKPbqCZsUeE_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4898736078.html"
    },
    {
        "title": "Male Christian Friendly, Drug/Alcohol Free House - May 1st",
        "href": "/mlt/roo/4941819107.html",
        "time": "2015-03-20 19:12",
        "price": "$400",
        "neighborhood": " (se)",
        "postBody": "\n        Got the notice from one of my housemates he&apos;s moving out end of april, getting married, so we need some new blood... Our place is obviously only for a select few given the house rules and such, but maybe that&apos;s you... we&apos;re seriously a calm mellow bunch and easy to get along with and friendly... but not overly friendly needing to be in your face all the time hanging out...<br>\n<br>\nThe house is a Drug and Alcohol free house (this includes your room and the house property)... if you drink, just respect the house rules and don&apos;t do it here (and for sure not interested in heavy drinkers at all - or drug users of any kind - including pot)... It&apos;s also a NO Cohabitation house, so no girlfriends sleeping over, etc. We&apos;re looking for a good decent drama free guy, of course another Christian believer in the house would be great (all 3 of us are), but its not a must.... also you MUST be working or in school with financial aid (no one can live here if theres not a set in stone method for paying rent... if these house rules are livable for you, you will get along great here...<br>\n<br>\n1 Room on main floor... its about 11 x 12 or so and has 2 windows... bathroom a few feet away...<br>\n<br>\nThe rent for this room is a flat $400 INCLUDING normal utilities (and wireless internet - normal bandwidth useage)... this does not include the use of an AC unit, that would be about $25 more a month for normal, not 24/7 use (this rate could change if our bill jumps a lot more than normal)... but a fan use is no charge (with the two windows, a fan can usually do the total trick on even the hottest days.... NO mini fridges or that kind of things in the room.... The house has a washer and dryer that you may use for free, but they are not part of rent, just a courtesy, so don&apos;t abuse their use (5 or less loads a month).<br>\n<br>\nNo pets, minus say a bird or something like that, we do have two old dachshunds... they are generally decent dogs and I&apos;m careful about excessive barking, but it is not prestine, so if you can&apos;t handle some barking, or dislike dogs, then this place isn&apos;t for you... Also we have a few chickens...<br>\n<br>\nOh yeah, from time to time we have or will have band practice in the basement (arranged at the least obtrusive time for all).... but thats not happened in quite a while, but it might... also we have the occasional house show/ concert in the main floor living/dining room areas... there will be plenty of notice of this and at most it happens a few times a year and lasts for like 4-5 hours or so start to finish.... last year it happened twice and the housemates all hung out and enjoyed it... like the house those events are drug/alcohol free as well...<br>\n<br>\n6 month min, 1 year preferred commitment... $100 ($50 refundable) deposit required.<br>\n<br>\nlet me know if you&apos;re interested....\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941819107.html"
    },
    {
        "title": "Goose Hollow Southwest Portland Single Bedroom Monthly Sublet",
        "href": "/mlt/roo/4941818380.html",
        "time": "2015-03-20 19:12",
        "price": "$595",
        "neighborhood": " (900 SW St Clair Ave Portland)",
        "postBody": "\n        *** females only please!****<br>\nIm moving of the area and need someone to take over my room, my lease is up in September so ideally I would like someone who could take it for this length of time, but I am willing to have someone take it monthly. The sublet would start April 1st. <br>\nI live in a 2 bedroom apartment building in goose hollow. The price is great for the location, it&apos;s one block away from Burnside and a 5 min walk to the red and blue line max stop at providence park. Walking distance to multiple bus stops, and downtown. 2 blocks away from gorgeous Washington nature park , Oregon zoo, Rose and Japanese garden .  <br>\nThe room is part of a 2 bedroom apt, the other room is occupied by a graduate student in her late 20s. There is a large living room, kitchen with dishwasher and amenities, one full bath. Internet is included. There is laundry in the apartment complex, with elevator access. The room is furnished , there is a futon bed , closet and dressers. For more information and pictures , please text or call. <br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941818380.html"
    },
    {
        "title": "Goose Hollow Southwest Portland Single Bedroom Monthly Sublet",
        "href": "/mlt/roo/4941817640.html",
        "time": "2015-03-20 19:11",
        "price": "$595",
        "neighborhood": " (900 SW St Clair Ave Portland)",
        "postBody": "\n        *** females only please!****<br>\nIm moving of the area and need someone to take over my room, my lease is up in September so ideally I would like someone who could take it for this length of time, but I am willing to have someone take it monthly. The sublet would start April 1st. <br>\nI live in a 2 bedroom apartment building in goose hollow. The price is great for the location, it&apos;s one block away from Burnside and a 5 min walk to the red and blue line max stop at providence park. Walking distance to multiple bus stops, and downtown. 2 blocks away from gorgeous Washington nature park , Oregon zoo, Rose and Japanese garden .  <br>\nThe room is part of a 2 bedroom apt, the other room is occupied by a graduate student in her late 20s. There is a large living room, kitchen with dishwasher and amenities, one full bath. Internet is included. There is laundry in the apartment complex, with elevator access. The room is furnished , there is a futon bed , closet and dressers. For more information and pictures , please text or call. <br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941817640.html"
    },
    {
        "title": "Great Place! / 1 Room Available NOW!",
        "href": "/mlt/roo/4921635505.html",
        "time": "2015-03-20 19:04",
        "price": "$450",
        "neighborhood": " (I-5/Killingsworth)",
        "postBody": "\n        Available Now-  1 bedroom available for one person each with no pets. 5 Bedroom house with 2 bathrooms (one bathroom in basement). Privacy living room and very nice outdoor back patio area to enjoy. Each room has cable and WiFi. Washer/dryer on site. Bedroom size is roughly 9x11. Great location near PCC, MAX, I-5, Mississippi ave., bars, coffee shops, New Seasons... <br>\nMonthly rent: 450.<br>\nUtilities: 100.<br>\nMove in Cost: First +utilities +last + deposit (250)<br>\n      <br>\n  -MOST IMPORTANT:              <br>\n*Please respond to this add by leaving your &quot;PHONE NUMBER&quot; along with what you do for work, what your current living situation is and why you are moving.  And, please also include a couple of previous roommate references.  *If you do not include these, you will NOT be considered.<br>\n<br>\nNO PETS!!<br>\n<br>\nThank you<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00X0X_g0Er5IXpmkm_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4921635505.html"
    },
    {
        "title": "Beautiful Couple and Dog Friendly Room, Utilities included",
        "href": "/mlt/roo/4941801965.html",
        "time": "2015-03-20 18:54",
        "price": "$875",
        "neighborhood": " (Cesar Chavez &amp; Holgate)",
        "postBody": "\n        We have one bedroom available in our beautiful turn of the century home. The bedroom is couple friendly with a huge closet, and we are allowed one dog in the unit, at the discretion of our landlord. All of us love dogs, but none of us own one.<br>\n<br>\nAbout the house:<br>\n<br>\nThe home was built in 1910, and has hard wood throughout, as well was two large bathrooms. It is full of character, and we absolutely love it. The living room has a unique wood stove that is in working order, a spacious dining area with a window nook perfect for reading, a well-equipped kitchen with two ovens and a dishwasher, as well as a small island for all of your baking needs. The available bedroom is located on the second floor and is only steps away from the upstairs patio, which currently contains a table and chairs, as well as risen garden beds. The house has an unfinished basement with a washer and dryer, and ample storage space. There is a side patio and a fenced in back yard with fruit trees and a barbecue. There is minimal yard work. The landlord has hired a company to do most of the work, and the house comes with a push mower for tenants&apos; use, for the small amount of bare grass. Eco-friendly and efficient! The house as a whole is surrounded by flowering trees and plants, and come spring, it will be amazing. Finally, we are 1.5 blocks from a trader Joe&apos;s, biking distance to Powell and Reed College, and right off of Cesar Chavez. The location is amazing.<br>\n<br>\nAbout you:<br>\n<br>\nWe hope you are a couple or single employed young professional, or maybe even a student, that enjoys wine, dinner parties, grilling, and wants a place to live that truly feels like home. We value direct communication, and hope that you do too. We also hope that you are willing to help keep the house clean so that the beautiful preservation done by out landlord can shine through. If you want a place where you can feel proud to live, this home is for you.<br>\n<br>\nAbout us:<br>\n<br>\nWe are three young professionals living in Portland. Out names are Alice, Joey and Taylor. We all love the outdoors, and are very active people. Between the three of us, we like to trail run, climb, kayak, raft, snowboard, ski, camp, canoe, backpack and mountain bike. We also like to cook, and of course the occasional Netflix marathon is welcomed. If you like to do any of these things, you&apos;ll fit right in! If not, that&apos;s ok too. To each their own! We legitimately want to be friends with our roommate, but ultimately we are respectful and just want a harmonious home.<br>\n<br>\nPricing:<br>\n<br>\nThe room its self is $875 for a couple or $825 for a single person. The landlord adds an additional $50 per person each month because the utilities are entirely included, hence the price difference depending on  your situation. To move in, you will need to pay: 1st month&apos;s rent, last month&apos;s rent, and your equal share of the deposit, which is $1000. So, if you&apos;re a couple, you will pay $2,150. If you are one person, you will pay $1900.<br>\n<br>\nPlease contact Alice for a showing, we would be happy to meet with you show you the house!\n    ",
        "image": "http://images.craigslist.org/01010_bTTt4EfOdHT_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941801965.html"
    },
    {
        "title": "room for rent fairview",
        "href": "/mlt/roo/4941799294.html",
        "time": "2015-03-20 18:51",
        "price": "$650",
        "neighborhood": " (fairview)",
        "postBody": "\n        Available April 1st. I have one 12x15 room in a three story home. All utilities including WiFi and cable included in rent. Must have good rental history to be accepted by the landlord. Sorry, no dogs or cats. Drama free house, no revolving door of people, enjoy the peace and comfort in a newer home located within walking distance to shopping! No couples, only room for 1 at this point, sorry. Text me or call to arrange a time to visit.\n    ",
        "image": "http://images.craigslist.org/00W0W_bPZW26Ize39_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4941799294.html"
    }
]