[
    {
        "title": "Furnished, Spacious Room with Private Bath in Private Setting",
        "href": "/mlt/roo/4881683541.html",
        "time": "2015-02-07 12:01",
        "price": "$1260",
        "neighborhood": " (Near Williams Street)",
        "postBody": "\n        Quiet, spacious room with its own private bathroom in a spacious and energy efficient house. Walk to fabulous restaurants on Williams, New Seasons grocery, Wonder Ballroom, public transportation, and Legacy Emanuel Hospital. Near Downtown, Pearl, Moda center<br>\n<br>\nMonthly rate of $1260. Starting Feb 24. Please email for details.<br>\n<br>\nThe room is ideal for a single person or a couple who is moving to Portland and needs time to find a permanent home. Or it could be ideal for the traveling medical professional working at Legacy Emanuel, which is two blocks away, or for anyone who needs month-to-month housing. You will be sharing the 3 bedroom home with only one other person who is the owner. <br>\n<br>\n<b>Guest Quote</b><br>\n&quot;The privacy aspect was great, it was more-or-less like having our own little apartment, even though we pretty much only slept there. The room is so nice and well-kept! &quot;<br>\n<br>\n<b>The Space</b><br>\nThe room is large (11x19 ft), quiet, and bright. It has its own private bathroom with shower and tub. The room is fully furnished and includes a comfortable queen bed, french style sitting chair, dresser, shelves, desk and chair. The closet is very large. <br>\n<br>\n<b>Access</b><br>\nYou will have access to the private room and private bathroom upstairs. Downstairs you have access to the living room, TV with Cable, HBO, Netflix and streaming channels, full kitchen, two decks with sitting areas, half bath, and laundry. Additional bonus is that the cat will probably demand petting. He is very friendly and cuddly!<br>\n<br>\nAlso includes Stumptown Coffee or tea! <br>\n<br>\n<b>In the Neighborhood</b><br>\nThe Eliot and Boise neighborhoods are very convenient for accessing many neighborhoods on the East side and provides quick access to Downtown and the Pearl district. Major bike ways are just a blocks away that provide access to downtown and the Pearl district, Alberta and NE Portland and North Portland. Ask the host where you can rent bikes if you are interested. <br>\n<br>\nThe booming Williams Street commercial corridor is within walking distance for dining, shopping, wine and beer tasting, and even cooking classes! Several nice parks are within close walking distances including Dawson and Irving Parks. New Seasons is just a few blocks away!<br>\n<br>\n<b>NEARBY RESTAURANTS</b><br>\nToro Bravo, Ox, Tasty n Sons, Lincoln, Life of Pie, Kenny and Zukes, Mint 820, Ned Ludd, Por Que No Taqueria?, Russel Street BBQ, Bunk Bar, and many more.<br>\n<br>\n<b>NEARBY BARS and BREWERIES</b><br>\nWidmere Brothers Brewing, Lompac the 5th Quadrant, Hopworks Bike Bar, Wineup on Williams, Bunk Bar, Ex Novo, Tin Bucket, Box Social, Maui&apos;s, Reverend Nat&apos;s Hard Cider Taproom, TeSoAria Winery, and much more<br>\n<br>\n<b>NEARBY MUSIC VENUES</b><br>\nWonder Ballroom, Secret Society, Mississippi Studios, McMenamins White Eagle, Waypost<br>\n<br>\n<b>NEARBY CAFES</b><br>\nRistretto Roasters, Waypost, Goldrush Coffee Bar, Twenty Six Cafe, Tiny&apos;s Coffee, Stash Tea Bar<br>\n<br>\nNew Seasons in Neighborhood! <br>\n<br>\nModa Center (Rose Quarter) and Home of the Trailblazers is about 3/4 mile away.<br>\n<br>\nOregon Convention Center is 1 mile away.<br>\n<br>\nLegacy Emmanuel is 1/4 mile away.<br>\n<br>\nNike Factory Store is 1/4 mile away.\n    ",
        "image": "http://images.craigslist.org/01010_ffp5daPKqLq_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881683541.html"
    },
    {
        "title": "Roommate search",
        "href": "/mlt/roo/4881759409.html",
        "time": "2015-02-07 12:01",
        "price": "$500",
        "neighborhood": null,
        "postBody": "\n        I&apos;m looking to find a roommate to move into the basement apartment that I&apos;ve been renting for the past six months. Preferably a woman around 21 and younger. Someone who is willing to clean up after themselves and is mindful of other people. I have connections with the family that lives upstairs, who also owns this place. It&apos;s a two bed, single bath. One of the rooms is mine, of course. Laundry is shared with upstairs tenants, they&apos;re very nice to work with. I&apos;m 18 and have two jobs, one on SE Hawthorne and the other on SE Division. I moved here 6 months ago, from the south coast of Oregon. My parents come visit often, and I am open to your friends/family visiting as well. If you are interested, I would like to meet you for coffee before the deal is set. Shoot me a text!\n    ",
        "image": "http://images.craigslist.org/00p0p_5FVibJcCZy9_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881759409.html"
    },
    {
        "title": "Temporary Internship Relocation",
        "href": "/mlt/roo/4877831068.html",
        "time": "2015-02-07 11:56",
        "price": "$745",
        "neighborhood": " (Portland Metro Area)",
        "postBody": "\n        Are you moving to Portland metro area for an internship? For Nike Inc., Intel, etc? Need temporary housing till your internship is done? We can help. Here at NW student Housing we specialize in personalized service therefor we recognize the need for flexible lease terms. Internships &amp; Short Term Lease Contracts.Traditional Rental Leases are 12 months long. we have created Short Term Lease Contracts, to best fit your needs. This makes short term rentals as easy as a long term rental but we do all the work, all you have to do is plan your internship and give us a call. We can accommodate terms as short as one month. To get more information about us feel free to visit www.nwstudenthousing.com or give us a call direct: <br>\n <a href=\"/fb/pdx/roo/4877831068\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor toll free <br>\n <a href=\"/fb/pdx/roo/4877831068\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n We are open six days a week Monday through Friday from 8:30 am through 5:30 pm\n    ",
        "image": "http://images.craigslist.org/00H0H_j4J1NdbtOYi_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4877831068.html"
    },
    {
        "title": "Immediate student housing available",
        "href": "/mlt/roo/4877832484.html",
        "time": "2015-02-07 11:55",
        "price": "$575",
        "neighborhood": " (gresham)",
        "postBody": "\n        Are you moving to Portland for College? Or need student housing off campus? Minutes from downtown portland with bus access as well as max a mile or two down the road.We can assist you in location an Off Campus Student Housing option. We pick you up from your hotel or airport and take you on a tour of the neighborhoods closest to your campus and show you the units that are available THAT day to sign lease contracts and move in immediately. We take the confusion and uncertainty out of moving to a new location when you aren&apos;t familiar with the area. Please feel free to call and inquire for further information, we are available 6 days a week 8:30am-7:00pm we can be reached Toll Free at <br>\n <a href=\"/fb/pdx/roo/4877832484\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nor Locally at <br>\n <a href=\"/fb/pdx/roo/4877832484\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\nwww.nwstudenthousing.com\n    ",
        "image": "http://images.craigslist.org/01212_9l47HKlrbHe_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4877832484.html"
    },
    {
        "title": "2 rooms for the price of 1",
        "href": "/mlt/roo/4881735047.html",
        "time": "2015-02-07 11:50",
        "price": "$550",
        "neighborhood": " (Foothills of Mt. Scott)",
        "postBody": "\n        2 rooms for the price of one!!<br>\n<br>\nThis is an upstairs area.  The entire upstairs is yours!<br>\n2 rooms 13x11 and 10x11, both have carpet.<br>\nThe wood paneling for the walls &amp; ceiling give it a &quot;cabin like&quot; feel (very cozy).<br>\nBoth rooms have closets and are equipped with Internet, &amp; DirecTV.<br>\nAll utilities are included in rent - gas heat, water, electrical, phone, internet, &amp; DirecTV!<br>\n<br>\nThe rest of the home is shared - Kitchen, Living room, Study, Laundry, etc.<br>\nThere are 2.5 baths, so everyone somewhat has there own bath!<br>\n<br>\nMy home is on a dead end street and is very peaceful.<br>\nYou can hear the frogs croaking &amp; the coyote&apos;s howling at night.<br>\nThe lot is just shy of &#xBD; acre. Fully fenced.<br>\nPlenty of room for a garden or a dog to roam, if you so desire.<br>\n<br>\n5-min. to I-205. Clackamas Town Center 10 min. away. Hawthorne District 10 min. away. Downtown is 15 min. away. Powell Butte is walking distance. The Spring water Corridor is a stone&apos;s throw away.<br>\n<br>\nRent is $550 including all utilities!! $300 security deposit. $40 application fee.<br>\nMove in is $890 ($550 rent + $300 deposit + $40 app fee)<br>\n2nd month rent will be pro-rated.<br>\nRent is month to month.<br>\n<br>\nMy personal profile:<br>\n38 yr. old.  Professional. Clean cut. Don&apos;t smoke. Drink socially. Occasionally have people over. Enjoy sports, home projects, &amp; great people!<br>\nI have a 2&#xBD; year old puppy (&#xBD; Yellow lab, &#xBD; German Sheppard)<br>\nI have 1 housemate currently.  She has her own area connected but separate to the house.  She is a research assistant and taking college courses, clean cut, doesn&apos;t smoke, drink, etc.<br>\n<br>\nPlease reply email preferred.<br>\nCalls will be taken too. \n <a href=\"/fb/pdx/roo/4881735047\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00I0I_k4UrEJu4nNd_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881735047.html"
    },
    {
        "title": "Room available in Beautiful/Sanctuary House Inner-NE / Woodlawn",
        "href": "/mlt/roo/4881739077.html",
        "time": "2015-02-07 11:48",
        "price": "$650",
        "neighborhood": " (ne portland)",
        "postBody": "\n        I am the owner of a house seeking to rent out one of the bedrooms to a roommate who is non-smoker, easy-going, motivated and clean. Someone who has a passion for gardening is a big plus! The house has two bedrooms, updated bathroom with a clawfoot bathtub &amp; kitchen with granite counter space. The house also features an outdoor hot tub, a large finished basement space with a wine cellar, home-brewery, and newly updated washer and dryer. The house has a large gardening area, with a hammock resting area, a nice living space, garage for storage, bikes, and tools. The bedroom I am renting out is the largest in the house, with plenty of closet and storage space. <br>\nThe house also features a newly built, all-mahogany front deck.<br>\n<br>\nOther perks include a large backyard and outdoor patio space, covered BBQ grilling area, gardening space with raised beds.<br>\nAll of which you will be free to use, plant vegetables, and retire in the hot tub or hammock at the days end!<br>\n<br>\nThe house is in an awesome location, right smack in the middle of two great neighborhoods, Woodlawn and the Alberta Arts district. There are parks in less then a few blocks from the house, and within another few blocks are great restaurants, a pizza place, coffee shop, brewery, pub house, and a local produce store that recently opened up.<br>\n\n    ",
        "image": "http://images.craigslist.org/00r0r_Sq3No04nyP_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881739077.html"
    },
    {
        "title": "Portland Heights Elegant SW Close-in",
        "href": "/mlt/roo/4881724560.html",
        "time": "2015-02-07 11:40",
        "price": "$600",
        "neighborhood": " (Portland Heights)",
        "postBody": "\n        Minutes from downtown Portland  and OHSU in the heart of Portland Heights, one of Portland&apos;s finest historic, neighborhoods.  Traditional, larger, charming 3 bedroom, 3 bathrooms, 2 decks, with hardwood floors, marble entry, 2 fireplaces and partial view of Mt. Hood.  Private, quiet room for rent is furnished with queen bed, dresser, two closets and is quiet.  Storage is available.  Kitchen privileges. Located less than 5 minutes from OHSU and downtown.  On 51 busline. All utilities included except share heat in winter. Wireless. Off street parking.  Looking for full time working professional for shorter term. No lease required.  References. Available late early Feb.\n    ",
        "image": "http://images.craigslist.org/00t0t_6GMhZvbXJ77_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881724560.html"
    },
    {
        "title": "All util inc blks from U of P PCC dwntown Swan Is bus max close",
        "href": "/mlt/roo/4881709451.html",
        "time": "2015-02-07 11:39",
        "price": null,
        "neighborhood": " (N Portland)",
        "postBody": "\n        I have room for rent in a two story house right up by the University of Portland in N Portland and just blocks to Swan Island and   5 miles N of Downtown. I have the house set up really comfortably it is fully furnished for whatever your needs.I have a few other roommates that are really chill easy going 420. The house sits off Lombard by one block where you would take the bus down to the max connecting points. The rent is $495 per month I pay all utilities at least a 3 month min stay but you can stay for as long as your needs. Please call 503 2o9 23 o four.....      for more information.\n    ",
        "image": "http://images.craigslist.org/01414_2O0JwiRtOMz_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881709451.html"
    },
    {
        "title": "need place to live in trade of me working for you.",
        "href": "/mlt/roo/4881708211.html",
        "time": "2015-02-07 11:30",
        "price": null,
        "neighborhood": " (any)",
        "postBody": "\n        I&apos;m in need of a place to stay, if your in need of a lot of help around your place.<br>\nI would like to work for you in trade for rent. I can&apos;t work a regular job right now. Personal reasons. I don&apos;t drink don&apos;t smoke and don&apos;t do drugs. So I have done this for others and have good references. Easy going and hard working have a back ground in running heavy equipment and very knowledgeable self motivated. So if you got work from heavy to light I got time.<br>\nLike cutting wood,clearing land, remodeling, cleaning up your yard, house,property anything I got time to work hard for you. references available upon request. thank you\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881708211.html"
    },
    {
        "title": "Available room in a Nice Home",
        "href": "/mlt/roo/4881688086.html",
        "time": "2015-02-07 11:29",
        "price": "$500",
        "neighborhood": " (se portland)",
        "postBody": "\n        A possible room for rent for 1 person in a 3 bedroom 2 bath house with a fenced yard. The house is nice and clean. It is located SE Portland with easy access to 205. Looking for the right person to rent a room in my home. The person is a professional, mature and tidy. No smoking, drugs, pets. Light alcohol use ok. $500 per month +1/2 of utilities. Will need to pay partially refundable $200 cleaning deposit and $125 non-refundable security deposit at move in. <br>\nAbout me: I like to kayak, bike ride, x-country ski and am a professional.\n    ",
        "image": "http://images.craigslist.org/00g0g_2lYe73Xqakw_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881688086.html"
    },
    {
        "title": "one bedroom for rent",
        "href": "/mlt/roo/4873554002.html",
        "time": "2015-02-07 11:07",
        "price": "$350",
        "neighborhood": " (ne portland)",
        "postBody": "\n        Have one furnished  bedroom for  rent . all utilites  included. with laundary .<br>\nlooking  for female  room mate.  very close to   public transport and  shopping malls.<br>\navailable now.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4873554002.html"
    },
    {
        "title": "Live with us in our amazing new place!",
        "href": "/mlt/roo/4869637931.html",
        "time": "2015-02-07 11:06",
        "price": "$750",
        "neighborhood": " (Irvington)",
        "postBody": "\n        My girlfriend and I are looking for a new roommate for our home!  The space is a top floor duplex with private entry. Location is inner NE...specifically Irvington. Just a few blocks from Fremont, by Alberta Arts district, and just over the bridge from the Pearl. Close to bars, coffee, grocery, and public transportation, this location would be ideal for a biker or frequent TriMet user, although there is plenty of street parking and a driveway if you do have a car. <br>\n<br>\nVIDEO TOUR:<br>\nhttps://www.youtube.com/watch?v=00XPMqWTKJU&amp;feature=youtu.be<br>\n<br>\n<br>\nThere is plenty of indoor and outdoor space...a good sized back yard, a private balcony/patio just for our unit that spans the entire roof of the garage and large common areas. Appliances are all brand new or very close to it. There is a washer/dryer in the unit as well as a large claw foot tub and gas fireplace.<br>\n<br>\nYour would-be bedroom is a double room. This gives plenty of opportunity for a study or office that will be completely for you, or use it as just an extra room to spread out. You will have lots of privacy, great windows, and sky lights! The windows face the backyard, so views are quite peaceful. The lighting in the apartment is great. There is one closet in this room with built in shelving, and you will also receive more storage in the form of a large closet in the living room. <br>\n<br>\nAs for us, we are in our mid and late 20s and artists. I am a musician and my girlfriend is a painter and art student.  <br>\n<br>\nWe are looking for a like-minded person to rent on a month to month basis, with possible potential for a longer term situation. Preferably in your 20s and 420 friendly. We rarely throw a party beyond a home cooked dinner with a group of friends, and prefer a roommate who is similar in that respect. We have two cats and a Pomeranian, so you should like animals and not be allergic. Because of this, we are not sure if having more pets is possible, but we are not ruling it out entirely. <br>\n<br>\nPlease write back telling us a bit about yourself!  Looking forward to meeting you!\n    ",
        "image": "http://images.craigslist.org/00606_4xYPFhSUZZ5_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4869637931.html"
    },
    {
        "title": "Room for rent in 3 bed 2 bath house with utilities and WiFi",
        "href": "/mlt/roo/4876456952.html",
        "time": "2015-02-07 11:01",
        "price": "$500",
        "neighborhood": " (ne portland)",
        "postBody": "\n        I have two rooms I want to rent out in a 3-bedroom 2 bathroom house.  Also has large living room and dining with open kitchen.  Has a 2 car garage with driveway for 4 cars total and also street parking if needed.  Yard is fenced in and gated.  Also has hot tub but I am currently working on the control panel for that.  Yard is pretty private.  Wood floors.<br>\n<br>\nRooms both have closet space, one room has a futon and desk in it that can be used.  Other room is empty.  Bathroom is adjacent to rooms in hallway, I would not be using it as there is also a master bathroom.<br>\n<br>\nI am a divorced male that works as a programmer in room automation and A/V for an electrical contractor.  I work everyday between 7-3:30.  I like pets, I do not currently have any but am open to cats and small dogs.  Smoking, drinking, whatever is also fine.  Just don&apos;t get to crazy unless I&apos;m invited, then hey, I&apos;m divorced.<br>\n<br>\nI need to work on the Laundry as I have always taken my laundry and even when I was married we would take our laundry elsewhere... I will be working on getting a washer and dryer.  I have only been reluctant because the hook ups are in the garage and I didn&apos;t want a washer and dryer taking up my garage space...  There are a few Laundromats in the area and if your nice, you may even be able to take your laundry where I do mine for free...  As long as you don&apos;t create 5000 lbs of laundry per day!<br>\n<br>\nWi-Fi and utilities are included.  Also have a projector and screen with surround sound in living room to watch movies on.<br>\n<br>\nAnd yes, pictures show rooms with stuff in them, but that stuff can all come out if someone moves in.\n    ",
        "image": "http://images.craigslist.org/00t0t_8m3FhC1k1IE_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4876456952.html"
    },
    {
        "title": "Lots of space, beautiful home in NE!",
        "href": "/mlt/roo/4877771741.html",
        "time": "2015-02-07 11:00",
        "price": "$975",
        "neighborhood": " (57th and Fremont)",
        "postBody": "\n        Hello everybody! House hunting is a drag, and we know it so here is the deal. We are 2 engaged to be married (yes, to each other ;) )late 20s females and we come with an amazing 4-year old Australian Shepherd. We are both full time graduate students.  We live in an awesome, brand new, all hardwood (except 2 bdrms), 3 bed 2.5 bath home in NE. Ideally we are looking for 1 person to fill the other 2 unfurnished bedrooms (the rest of the house is completely furnished- the pictures are from when we moved in). In addition to the 2 bedrooms, a full private bathroom is all yours as well. (We have a bathroom in the master, and never use the other one upstairs) We have cable and internet, all utilities hooked up and ready to go. There is a laundry room with a brand new washer dryer, and all stainless appliances. There is a small fenced in backyard and  attached garage that is pairing as our workspace as well- plenty of street parking. <br>\n<br>\nBasically we want to do what works so we aren&apos;t looking to add anyone to the lease, and are flexible with any time increment. We are pretty easy going, clean and quiet and just ask that the common areas be kept clean. We like to hike, camp and explore Portland.  We are new to the area and just trying to embrace our Pacific NW adventure, oh, and get masters degrees in the meantime. We hardly know anyone out here so you don&apos;t have to worry about big ragers or anything but we do enjoy a couple of beers and the area&apos;s finest wines. No smoking in the house, but we are 420 friendly and as long as the bills are paid on time, wont pass judgement on your vices. We are hoping to get this show on the road by March 1st. I know rent is a bit higher than posted elsewhere, but you&apos;re definitely getting a bit more! $975/mo includes all utilities, 2 bdrm, private full bath and no lease. Email me here if you&apos;re interested. Thanks!\n    ",
        "image": "http://images.craigslist.org/00A0A_jTyheLsHJp4_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4877771741.html"
    },
    {
        "title": "Beautiful house in SW PDX to share",
        "href": "/mlt/roo/4881649270.html",
        "time": "2015-02-07 10:56",
        "price": "$700",
        "neighborhood": " (Hillsdale/Bridlemile)",
        "postBody": "\n        Beautiful house to share on quiet street next to park and public transportation.  Close to OHSU, perfect for med student/resident, near Dosch and Hamilton.  Separate level with 800 square feet of private living space (full bath) for you,  with windows and nice yard.  Comes with some furniture but can accomodate yours.   Share gourmet kitchen, laundry and dining room. Beautiful deck space for our great summer days.<br>\n<br>\nLooking for non-smoker, no pets.  Utilities not included. <br>\n<br>\nI am a fairly active but quiet person who works full time.  I spend most of my free time outdoors climbing, hiking and enjoying the beautiful PacNW.  Looking for responsible, clean adult to share my home.\n    ",
        "image": "http://images.craigslist.org/01515_2QpCti7ilJt_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881649270.html"
    },
    {
        "title": "Housesitter/roommate needed ($600)",
        "href": "/mlt/roo/4881619303.html",
        "time": "2015-02-07 10:39",
        "price": "$600",
        "neighborhood": " (NE Portland)",
        "postBody": "\n        Man (in his 50&apos;s) looking for housesitter and roommate for modern home in NE.  I&apos;m looking for a mature individual to help take care of the house, because I travel frequently.  This results in the selected individual having the house mostly to themselves about 80% of the time.<br>\n<br>\nRent amount is $600/month and includes all utilities including cable and wifi internet.  House is 3 BR/2.5 BA.  Selected individual will have private bedroom and mostly private bath (occasional use of the guest bath by visitors) and reasonable use of the common areas.  I&apos;m mainly looking for a housesitter (not a roommate for cost sharing), so I need somebody who will be at home at least a part of most days.  Also, the house is completely furnished, so I&apos;m looking for somebody who wants to bring minimal stuff.  This will be a six month arrangement; it could go longer, but likely will end in August due to a relocation. <br>\n<br>\nThis is a quiet, respectful home, so no drugs, excessive alcohol, parties, large groups or overnight visitors.  Also, no pets, sorry.  I love dogs but have a very allergic occasional visitor.<br>\n<br>\nReply via email and tell me a little about yourself.<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881619303.html"
    },
    {
        "title": "+ utilities. Dog friendly room avail. March 1st, in clean, large home.",
        "href": "/mlt/roo/4850153387.html",
        "time": "2015-02-07 10:38",
        "price": "$385",
        "neighborhood": " (SE, near Johnson Creek)",
        "postBody": "\n        Hi-<br>\n<br>\nI have an unfurnished bedroom for rent as of March 1st in our friendly and comfortable home. <br>\n<br>\nOur spacious layout affords plenty of privacy to each housemate when desired, as well as multiple common areas when the mood strikes to spend time together. We have 4 bedrooms, 2 full bathrooms, and no more than 4 of us live here at any time. (Please do not contact me if you are more than one person or if you wish to bring your cat or pets other than dogs). Every one here is respectful of others, as well as responsible and clean. <br>\n<br>\nThis home is strictly no smoking (of any substance) and no one does more than light drinking. We currently have a mix of genders and an age range of mid to upper-mid. Our professions are varied -  business manager, landscape architect/arborist, and care giver administrator.  Our hobbies /interests include cooking, bicycling, frisbee golf, boat building, gardening, herbology, watching movies, and sewing. Omnivore or vegetarian, GF or pastry lover, all food preferences are welcome. But you do have to like dogs, even if you do not own one. You also have to be willing to live fragrance-free -- more on that follows<br>\n<br>\nBy the way - To try to filter out phishing and spam, etc., I will not reply if you send me a message that only asks me to contact you, or only asks if the room is still available. Please tell me about yourself when you reply.<br>\n<br>\nThe room package I am renting: The bedroom is on the main floor of the house and is 10 x 10.  It will comfortably hold a Full or Queen size bed and a dresser and desk. It has a small walk-in close as well a sits own hallway closet. It has windows on two walls and bright afternoon light. You will share a full bath with one other person and have your own off-street parking space and extra basement storage.<br>\n<br>\nThe room rents for $ 385/month. Per person, utilities average $115- $135/month. This includes EVERYTHING - water and sewer, trash, cable TV (only basic channels), high speed internet, gas, electric, and yard maintenance. There is a $50 screening fee (everyone here has been screened for criminal records), and the security deposits are fully refundable. I ask for a $500 security deposit and if you have a dog, a $100 pet deposit. I am open to spreading out the deposits over a couple of months and I do not ask for last month&apos;s rent unless a person has shaky credit.<br>\n<br>\nTwo dogs will live here when you move in and we can easily handle one more. The two current pooches spends most of their time with their person and are 10 years old and thus fairly docile. All furry friends must be non-aggressive, peaceably share space with others, be well mannered, and be kept clean and flea treated.  &quot;Yappers&quot; or even large dogs that bark a lot will not work out here. We all like and know dogs, and every dog owner that has ever lived here has told me how good they felt about having their dog stay with us. We often help each other with occasional pet sitting, or putting someone else&apos;s dog outside or feeding, when s/he has to work long hours, etc. <br>\n<br>\nThis is a 1900 sq ft older home in the Errol Heights neighborhood. We occupy a pocket of Portland, that while not too far from most &quot;happenings&quot;, is loaded with old growth trees, green spaces, wild peacocks and occasional coyotes. I saw a deer here for the first time this year! We are surrounded by large lots and friendly neighbors. Away from any main thoroughfare, the primary noises here are a beautiful symphony of birdcalls when in season and rustling trees. <br>\n<br>\nThe home has central gas heat and A/C; washer/dryer, and dishwasher. All floors are wood --(although old and somewhat marred). We have high speed wireless internet in every room and on the deck. There is a large deck, fenced in vary large yard, and a community garden one block away. If you wish you can begin a garden on the grounds.<br>\n<br>\nWe maintain a &quot;clean air&quot; home - avoiding products that off-gas fragrances and other fumes. I can explain this better when we speak with each other -  but the simple explanation is that things like our soaps, lotions, shampoos and laundry products are all fragrance free (I provide up to $35 in refunds for the cost of replacing your current items.) Items that off-gas fumes, such as hair gels and nail polish cannot be used. <br>\n<br>\nCommuting times: We are a 5-minute walk to the 75 bus line and a slightly longer walk to the 72. We are very close to Johnson Creek and the Spring Water Corridor and bike paths. Driving times in good traffic: to Reed College, 7 minutes; to inner SE, 10 minutes; to downtown 15 - 20 minutes; to Clackamas Town Center or the Home Depot on SE 82nd about 15 minutes. <br>\n<br>\nIf all of this sounds like what you are looking for, please reply and tell me a little about yourself and your lifestyle, and tell me how I should contact you. <br>\n<br>\nGood luck in your home hunting-\n    ",
        "image": "http://images.craigslist.org/00Q0Q_1gcrumZLiqv_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4850153387.html"
    },
    {
        "title": "Roommate",
        "href": "/mlt/roo/4881572008.html",
        "time": "2015-02-07 10:26",
        "price": null,
        "neighborhood": null,
        "postBody": "\n        Hello I&apos;m looking for a roommate for at least 4 months only or long if need be. I&apos;m look for a non smoker and no alcohol drinker.  The rent for room will be $380 and split the PG&amp;E. Please text only if your interest. <br>\n <a href=\"/fb/pdx/roo/4881572008\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881572008.html"
    },
    {
        "title": "The &apos;Pond Room&apos;, Office in Beautiful House",
        "href": "/mlt/roo/4881567108.html",
        "time": "2015-02-07 10:17",
        "price": "$695",
        "neighborhood": " (GardenHome/MultnomahVillage (close-in SW)",
        "postBody": "\n        2 Different Rooms for Rent.<br>\n<br>\nWhat&apos;s here . . .?<br>\nAn artist&apos;s residence. &apos;Treehouse&apos;, nestled in hilly woods on small creek, pond. A true Sanctuary. <br>\nComes with groundskeeper (me). Active with wildlife - raccoon, squirrel, frogs, birds, sometimes coyote, owl.<br>\nPrivate, peaceful. Doesn&apos;t feel like you&apos;re in the city. Space to garden. <br>\n<br>\nClose-in SW Portland - Multnomah Village / Garden Home, just 12 minutes from either downtown, Beaverton or TIgard. Directly on #45 bus route.<br>\n<br>\nBeautiful, newer, larger (3200sqft) house. Three Bathrooms, Hardwood, Marble, carpeted floors, fine cabinetry, Woodstove. Additional decks, patios.<br>\nLarge, full-feature kitchen, dishwasher.   Ample refrigerator, and kitchen storage space.<br>\nFine with &amp; respect each other&apos;s eating prefs.<br>\n<br>\n<br>\nOne available room - the &apos;Pond Room&apos;:<br>\n<br>\nBig - roughly 15x24 (368 sqft).  High ceiling (9&apos;), spacious.  Low-pile carpet.  Separate entrance onto pond/waterfall.<br>\nI can supply some, most, all, or none of furnishings.  Currently unfurnished.  Suitable for personal and/or office use.  <br>\nThis room is part of, but also quasi-separate from the rest of the house.<br>\nIt could be a &apos;blank canvas&apos; waiting for an artist to re-create into their own zone, or<br>\nis well-suited for someone who needs to focus on what they&apos;re doing.<br>\nThis room shares a Bathroom.<br>\nPOND room is shown in the PHOTOS.<br>\n<br>\n$695 plus utilities ($695 rent +$85 for utilities)<br>\n<br>\nThe &apos;Pond Room&apos; is available starting April 1st.<br>\n<br>\nPlease cue me up front whether u prefer fully furnished or not.  Thx.  Can also be partially furnished.  Modestly extra to furnish - depends on what&apos;s requested.<br>\nFurnishings that are available in the space:<br>\nSmall computer/work table.  <br>\nOption of stylish height-adjusted work-tables.<br>\nBed (Queen or Full size or Futon) can be furnished @ +$10/mo<br>\n\tBed options may depend on availability.<br>\n2 - quality shelving sets, differing styles.<br>\nDesk Chair<br>\n<br>\nIt&apos;s an adaptable space.  It can be a purely lived in space, a lived-in office, an art studio, or a standalone office.<br>\nAt different times it has been all these.<br>\n<br>\nSmall, Quiet, Non-damaging pet would be considered ONLY for the POND Room  (in room or outside - not rest of house) <br>\n@ +$25 for rent, and +$500 pet security deposit.<br>\n<br>\n<br>\nSecond available room - the &apos;Garden Room&apos;:<br>\n<br>\n12x9. Separate entrance, walk thru garden to arrive. Your own personal deck - partially covered, with bench. 3 windows look into tree/garden scene. Beautiful maple hardwood floor with walnut trim (area carpet option). Built-in cherry bookcases. Also built-in to the wall: 6 drawers for clothes or files. Closet has built-in shelving as well. Sweet space. All that&apos;s really needed in this room is a bed (which I can provide Queen or Full) - with the built-in&apos;s the room is essentially self-furnished. The built-ins, the windows and doors take up most of the wall space. Besides a bed, there&apos;s only room for a small desk and perhaps one or two other small furnishings.<br>\nThis room shares a Bathroom.<br>\nNOT shown in Photos in this ad.  See separate ad for &apos;Garden Room&apos; for photos.<br>\n<br>\n$595 plus utilities ($595 rent +$85 for utilities)<br>\n<br>\nThe &apos;Garden Room&apos; is available starting Either March 1st, March 15th, or April 1st.<br>\n<br>\nOPTION:  <br>\nBed (Queen or Full size or Futon) can be furnished @ +$10/mo<br>\nBed options may depend on availability.<br>\n<br>\n<br>\nQuiet, safe neighborhood.<br>\nWithin 1 mile are two large parks - one wild-wooded, the other is Gabriel Park.<br>\nAlso 1 mile for shopping, grocery, restaurants, 3 community centers - one with pool, fitness.<br>\nPrecisely midpoint between I-5, Hwy 26 and Hwy 217. 2.5 mi from Washington Square.<br>\nNear to Lewis and Clark College, OHSU, PCC Sylvania.<br>\n12 min drive from PSU or Naturopathic College.<br>\n<br>\nI&apos;m here a lot, gone a lot - operating a modest wedding/portrait photography business from home.<br>\n<br>\nLooking for: clean, honest, financially sound and responsible, healthy, excellent communication,<br>\nlight/warm-hearted, ability to cooperate in and enjoy shared space, positive, tending towards quieter, non-television watching, non-gaming (of the loud sort), mature. <br>\nWe respect each other&apos;s space. Our practice is to check in with each other to see if it&apos;s a good time to chat.<br>\nWe&apos;re also warmly amicable and genuinely happy to see and greet each other. Harmonious sums it up.<br>\nIf you&apos;d like a gentle sense of &apos;community-lite&apos; in a beautiful place,<br>\nor if you&apos;ve been feeling some isolation being solo in your current place - this could be a good fit.<br>\nLooking for someone who truly understands how to respect, care for, and keep clean fine things (this house).<br>\nPrefer people who love life and their pursuits; <br>\nand for whom it&apos;s natural to recycle, compost, conserve electricity, heat, hot-water usage. <br>\nSerious students, professionals, creatives, spiritual folk, someone who needs to focus, would do well here.<br>\n<br>\nMe? Aside from being a photographer, gardener, I&apos;m active/healthy - run, swim, ski, climb a rock, dance, spiritual streak. <br>\nIf you&apos;re inclined you can get more of a vibe: www.peterpaulrubens.com<br>\n<br>\nThis is a very organized house.  Clean is important - this is what we mean by clean:<br>\n- Whenever any of us use the kitchen, we clean it up 100%, immediately after using - not &apos;mostly&apos; clean, not clean it &apos;later&apos;, not crumbs, splats, utensils left.<br>\n- Whomever handwashes dishes and leaves them to dry in the dishrack, they&apos;re conscientious to put those dishes away within 24hrs.<br>\n- When using the laundry machines, we empty them within 2-3hrs so they&apos;re ready for the next person.<br>\n- Any shoes that were worn outside, are not worn inside the house - due to hardwood floors and carpets.<br>\n- We each have a household chore that takes 25min every 2 wks. It&apos;s much more peaceful that we can really, truly count on each of us to do  our part, before it&apos;s due, no reminders needed. <br>\nBasically our philosophy is that when the next person arrives in a space that it&apos;s beautiful for them and fully ready to use.<br>\n<br>\nAs one new housemate said:<br>\n&quot;These rules are how I would like other people to do things yet I have rarely enjoyed them doing so, so I am very excited about living in a house that will actually be clean!&quot;<br>\nIf you relate with the above, you&apos;ll thrive here.<br>\nWe&apos;re definitely not &apos;perfect&apos; - nobody is - but we keep these agreements to a very high degree: &gt;95% of the time.<br>\n<br>\nIncl in the $85 utilities is HighSpeed WiFi, Washer/dryer, Filtered drinking water, Electric, Gas heat/cooking, (premised on utility use being modest/conserving). <br>\n<br>\nPOND ROOM:  1st month&apos;s rent (695+85util) to move in with $1000 refundable security deposit = $1780 (Total $ to move in)<br>\nGARDEN ROOM:  1st month&apos;s rent (595+85util) to move in with $1000 refundable security deposit = $1680 (Total $ to move in)<br>\nFirst two months are a trial, then Six month lease. <br>\n<br>\nIt is very important that you have:<br>\nSolid References.<br>\nSolid Income.<br>\nNo smoking. No drugs.<br>\nAdult only.<br>\nAfter interview, then fill out an application with ($35) background check <br>\n<br>\nIt&apos;s a great place. We&apos;re looking for a great housemate. Could be you or someone you know.<br>\nCall Peter @ \n <a href=\"/fb/pdx/roo/4881567108\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n or Em reply to this ad.<br>\nIf you don&apos;t reach me please leave the best times to call you.<br>\n<br>\nIt&apos;s an all-around wonderful enough place that at different times, 4 former housemates have either returned to stay a second time.<br>\n<br>\nThis is a quote/feedback from a housemate candidate:<br>\n<br>\n&quot;Your sanctuary is truly a rare find. There were no things that jumped out in a jangly way for me when I visited - it was a sweet mix of refined and energetic, and I think your ad conveys the flavor as well as words can describe such a rich setting. You could add a bit more to express the cozy spaciousness of things and the richly layered and textured property and dwelling - the multiple floors and easy flow of the space and the exquisite craftsmanship. The price seems reasonable to me too...&quot;<br>\n<br>\nAnother:<br>\n&quot;We looked at your house and saw that it&apos;s absolutely beautiful and perfect. Thank you for posting your home. Whomever you choose for your roommate(s), I&apos;d consider them blessed.&quot;<br>\n<br>\n<br>\nThanks for taking your time to read<br>\nI do my best to respond to all legitimate inquiries ~ Peter\n    ",
        "image": "http://images.craigslist.org/01313_7ZkuvzMklDl_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881567108.html"
    },
    {
        "title": "Clean and Sober living for women and children",
        "href": "/mlt/roo/4874661061.html",
        "time": "2015-02-07 10:16",
        "price": "$380",
        "neighborhood": " (141st SE Portland)",
        "postBody": "\n        Available Now!!!<br>\nMOVE IN NOW FOR $380<br>\nOn 141st SE Portland (off Stark)<br>\nWe are a Safe, Clean and Sober living home<br>\nfor Single Women and Mother and their children. <br>\nWe have Fully Furnish Rooms available for rent $380/ month<br>\n*Utilities included<br>\n*Free Wi-Fi<br>\n*Washer &amp; Dryer Access<br>\n*Close to max and bus lines<br>\n*Close to Fred Meyers and other shopping stores<br>\nIf you&apos;re interested please leave your Name &amp; Contact Information<br>\nThank You <br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4874661061.html"
    },
    {
        "title": "Room for rent in a house se portland 115th powell",
        "href": "/mlt/roo/4849882684.html",
        "time": "2015-02-07 10:13",
        "price": "$600",
        "neighborhood": " (115th powell)",
        "postBody": "\n        I have a room for rent in my newly remodeled 3 bedroom 2 bath house. The room has 3 windows and a closet .The house has a really big back yard. I have 2 small dogs who are friendly <br>\nI am looking for someone 21-40 no pets please<br>\nLooking for single occupancy for 600 a month. The house is really close to a bus line on powell or division 3 minute walk in either direction. 15 minute walk from the Max and mall 205.Rent is $600 a month including utilities. I will need 1st last and a deposit of 300 for a total of 1,500 to move in.This is a house not a aparment or town home. Feel free to text or email with questions. \n <a href=\"/fb/pdx/roo/4849882684\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\ndo NOT contact me\n    ",
        "image": "http://images.craigslist.org/00r0r_eqLiCUuAefl_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4849882684.html"
    },
    {
        "title": "Room For Rent in 3 bdrm House",
        "href": "/mlt/roo/4881549311.html",
        "time": "2015-02-07 10:00",
        "price": "$400",
        "neighborhood": " (NE Portland Near Gateway)",
        "postBody": "\n        Nice size bedroom.  $400 rent plus up to $100 utilities. (less in summer time)   I have a Boston terrier.  I have a large back yard.  Call Jeff <br>\n <a href=\"/fb/pdx/roo/4881549311\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881549311.html"
    },
    {
        "title": "Spaciou rooms in single family home for rent.",
        "href": "/mlt/roo/4853913051.html",
        "time": "2015-02-07 09:59",
        "price": "$380",
        "neighborhood": " (Multnomah Village)",
        "postBody": "\n        Hi,.<br>\n<br>\nI&apos;ll be leaving for the month of February, and would like for someone to sublet my basement apartment for the month. It comes furnished with a loaded kitchen, full bathroom, and private entrance. There are three professionals who live upstairs, the door can be locked from the basement to ensure privacy..Locaton: Multnomah Village, portland in 97230 Area code.<br>\n<br>\n4 large bedrooms; 3 bathrooms, 1 kitchen and a smaller kitchenette (both gourmet furnished and stocked), plenty of off street parking and on a main bus line. Living and family rooms are large with big screen TV&apos;s and nice furniture. The extra bedroom can be either furnished or not. A small pet is acceptable but you must take care of the critter. We try to eat family style but everyone has there own private stashes.<br>\n<br>\nAll utilities, wi-fi and monthly room rent is only $380.00 and if you check out okay I will not require the typical first, last plus deposit. Pay your rent and fit in.<br>\n<br>\nSeeking a young professional/student to rent from February 1st and leaving the 28th.There will be a standard sublet agreement signed to ensure legal matters are covered. Payment up front.<br>\n<br>\nParking, there is garage that can fit two cars. I haven&apos;t decided if I&apos;ll need my car, if so, then the spot is yours.If interested please text If interested please text \n <a href=\"/fb/pdx/roo/4853913051\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nme about yourself. Thanks :-) me about yourself. Thanks :-)\n    ",
        "image": "http://images.craigslist.org/00A0A_6ooHw4J4fZ3_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4853913051.html"
    },
    {
        "title": "Looking for 2nd Female to rent On #20 Bus. Close to MHCC",
        "href": "/mlt/roo/4867137846.html",
        "time": "2015-02-07 09:51",
        "price": "$550",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Looking for a mature single female, with no children, to share my 3 bedroom 2 bath,double wide manufactured home. You would share the  bathroom with my female roommate. You will also have the use of the washer and dryer and the kitchen and living room. The #20 bus stop is in front of the house. I have a small dog. She is both hypo allergenic so no allergy problems as she has hair not fur. Rent would be 550.00 that includes the utilities. Plus a $200.00 deposit.<br>\nPlease email me for more information.<br>\nNo Drugs of any kind unless from a doctor. No Drinking. Smoking outside only<br>\nIf you would like more information please send your name and phone #<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4867137846.html"
    },
    {
        "title": "Looking for a live-in girlfriend",
        "href": "/mlt/roo/4881419599.html",
        "time": "2015-02-07 09:43",
        "price": null,
        "neighborhood": " (north portland)",
        "postBody": "\n        I have HSV2 (genital herpes) which is well controlled, so you should be likewise afflicted. <br>\nI know that this is a bit out of the ordinary, but I thought that I could take care of a couple of things in one spot.<br>\n I&apos;m a nice guy, 55 and I&apos;m looking for a single, open minded, 420 friendly trustworthy, honest, affectionate and very sexual female, who is looking to form a caring, loving and long term partnership, to share my house with me. I&apos;m not looking to jump right into this as I would like to take a little time so that we can get to know one another to see if we click or not. But if your situation won&apos;t allow you to do that, we can give it a try. We can start things off slow to get comfortable with each other and you will have your own room for you to use when you like.<br>\n This is definitely not a Sugar Daddy/Sugar Baby arrangement. <br>\n Rent is not really important, but if you could pitch in on a utility bill and food, that would be fine.<br>\n I&apos;m not a partier, I&apos;m more of a hippyish, laid back and cerebral person who does prefer quiet surroundings and usually don&apos;t have a lot of company over. The right person could definitely make this a home for the both of us.<br>\nages and races, so if you&apos;re interested, send a message about yourself and send a picture. No pic, no reply. In turn I will tell you more about myself and send you pictures. Let&apos;s see if we would be a good fit for each other.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881419599.html"
    },
    {
        "title": "Room for rent, incl utilities",
        "href": "/mlt/roo/4881479211.html",
        "time": "2015-02-07 09:33",
        "price": "$550",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Nice room w/double closet,  kitchen privileges, your own bath.   MAX and bus close.  Very clean one level home in Gresham&apos;s East Hill neighborhood.  Walk to bus, shopping, max.  Active, retired owner seeking quiet, clean, business professional or active busy, retired.   $550/month, includes utilities, internet.  No smoking, pets, or drugs.  Call Diane for appointment \n <a href=\"/fb/pdx/roo/4881479211\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n  I do background checks.<br>\n<br>\n<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881479211.html"
    },
    {
        "title": "1 Room available INNER NE!",
        "href": "/mlt/roo/4878126165.html",
        "time": "2015-02-07 09:32",
        "price": "$588",
        "neighborhood": " (Stanton)",
        "postBody": "\n        Great House in a Great Location. Come take a look at the place. The house was completely remodeled last year. Room is available Immediately. Close to everything Portland has to offer...Downtown, Mississippi, Alberta, Parks, Shopping, Bars/Nightlife. Very laid back house, only rule is to keep community space very clean. Utilities are very economical ~$75/month. 1-year lease ending in July.  You would be subletting the rest of the lease term.<br>\n<br>\nNote: the landlord has a strict no pet policy<br>\n<br>\nOne Upstairs Bedroom Available<br>\nBedroom - 14&apos; x 11&apos;<br>\n$588<br>\n<br>\n<br>\n-Washer/Dryer<br>\n-Dishwasher<br>\n-Front Deck<br>\n-High 10&apos; Ceilings<br>\n-Open Floor plan<br>\n-Shed in back for storage<br>\n-Large Back Yard<br>\n-Parking Available for all roommates on lot!<br>\n<br>\nJosh<br>\n\n    ",
        "image": "http://images.craigslist.org/00K0K_2tC0dWzgVNY_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4878126165.html"
    },
    {
        "title": "Furnished Room in Fab Ladd&apos;s Addition Household (incl utilities)",
        "href": "/mlt/roo/4881496233.html",
        "time": "2015-02-07 09:30",
        "price": "$850",
        "neighborhood": " (Inner SE/Ladds Addition)",
        "postBody": "\n        There is a room coming available March 1st in our beautiful house in Ladds Addition. For those new to Portland, Ladds Addition is a historic neighborhood featuring diagonal streets lined with 100-year old elm trees, four rose garden circles and a central garden circle. While it is a quiet neighborhood, It is 1-1/2 miles from downtown, close to bus lines, and 2 blocks from the Hawthorne and Division Street neighborhoods, which are bustling with cafes, shops and coffeehouses. We are also two blocks from New Seasons market and about 5 blocks from People&apos;s Food Coop. <br>\n<br>\nYour room would be on the 2nd floor of the house, facing the front yard, with wood floors, and two windows overlooking the tree-lined street. The room is furnished with a comfortable bed, an armoire, a desk, a 2 lamps and an area rug. <br>\n<br>\nThe house is a Portland four square built in 1915. It has 4 bedrooms on 3 floors and 1-1/2 baths, wood floors throughout, a cozy fireplace, natural woodwork, a simple but charming kitchen featuring a 40s gas Wedgewood stove and maple flooring, front porch with a porch swing, patio and hammocks, garden with veggie beds and perennial beds in backyard, and full unfinished basement with washer and dryer. It is comfortably furnished with a mix of antiques, mid-century garage-sale finds, a few modern things thrown in, and treasures brought back from travels around the world. <br>\n<br>\nWe are three people looking for a fourth to share our tranquil home. We are two women and one man in our 30s through early 50s. You can be any age, just be nice. The house has the feel of a peaceful refuge. We are pretty independent and lead busy lives, but enjoy sharing our home with each other too, and often find ourselves chatting when we meet up in the kitchen. We enjoy art and cultural events, reading, hiking, kayaking, bicycling, sustainability, good food/wine, travel. We are responsible, helpful and nice to each other. Looking for someone compatible with our household. <br>\n<br>\nThe room is available January 1st. The $850.00 monthly rent includes all utilities, one-a-month common area house cleaning, and a high-speed wireless internet connection. We have one otherwise good-natured cat, who asked me to say &apos;no more pets please.&apos; Only looking for one person for the space. We are open to a long-term compatible housemate, or a shorter term rental of a minimum of three months. Email with any questions. Thanks! <br>\n\n    ",
        "image": "http://images.craigslist.org/00g0g_gFZQQxtb9ff_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881496233.html"
    },
    {
        "title": "&#x25BA;---BEDROOM w/PRIVATE BATH!PRIVATE Bathroom---&#x263B;---HURRY---",
        "href": "/mlt/roo/4881322319.html",
        "time": "2015-02-07 09:19",
        "price": "$525",
        "neighborhood": " (st Tanasbourne / Orenco Station / Intel)",
        "postBody": "\n        &#x25BA;---BEDROOM w/PRIVATE BATH!PRIVATE Bathroom---&#x263B;---HURRY---<br>\n<br>\n<br>\nBright Needles, 2 bedroom, 2 bath for rent.   <br>\n1st Studio with Large Walk-In Closet!    <br>\nSpacious 2 bedroom apartments featuring washer and dryer hookups, bay windows,    <br>\nDishwasher,Laundry,Fireplace,Storage,wood Floors,Closet ARE RENT INCLUDED  <br>\n2 car garage, and well maintained common areas.    <br>\nBright Needles, 2 bedroom, 2 bath for rent.   <br>\n1st Studio with Large Walk-In Closet!    <br>\nSpacious 2 bedroom apartments featuring washer and dryer hookups, bay windows,    <br>\nDishwasher,Laundry,Fireplace,Storage,wood Floors,Closet ARE RENT INCLUDED  <br>\n2 car garage, and well maintained common areas.    <br>\n<br>\n<b>Good luck! :-)&gt; GO&gt;&gt;         Cheap.room.ch.vc/<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</b>\n    ",
        "image": "http://images.craigslist.org/00B0B_4cJ7xlqfPT2_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881322319.html"
    },
    {
        "title": "Share spacious duplex in Inner SE",
        "href": "/mlt/roo/4849957174.html",
        "time": "2015-02-07 09:15",
        "price": "$625",
        "neighborhood": " (SE Belmont by 14th)",
        "postBody": "\n        SE Belmont, close in! $625/month + utilities. Keep it simple having just one great roommate. Available March 1st or sooner. Very cool, historic walkable neighborhood just blocks from the trendy Hawthorne District and all the fun Belmont shops. Contact me soon with your phone number because this place will go fast. I promise to contact you within a day or sooner. MUST RESPOND WITH PHONE NUMBER or I won&apos;t reply. Why? Because of spammers and to see if we click. Also, if you are still throwing the idea around of leaving your old place or unsure if you can afford this deal, please do not contact me as I run two businesses and simply don&apos;t have any extra time to show the place to anyone undecided. You must be comfortable and respect that I work from home. I am quiet though I&apos;m mostly looking for someone who works daytimes and doesn&apos;t keep late hours to make this manageable. I&apos;ve tried the alternative and it harder. <br>\n<br>\nWe&apos;ll be sharing my wonderful home -- a very spacious 2 bedroom/1 bath in a large, well-kept house near SE Belmont and 14th Aves. I&apos;m a friendly freelance writer/inventor seeking a clean, respectful, laid back and personable housemate no later than March 1st. I mostly work out of my home office, so need someone respectful of this on the quieter side with normal daytime hours. I&apos;m NOT looking for a ant-social hermit type, however, who barely says anything or stays in his/her bedroom all the time. I am a very light drinker and don&apos;t smoke or do drugs; and I&apos;m looking for the same or a non-drinker. Smoking and incense are not allowed by the property owner. <br>\n<br>\nI&apos;m financially responsible, cleanly, considerate and very safety minded. You must be, too. I like to read/write/watch movies, cook and entertain sometimes. Compatibility is essential and we will make sure we are. Really looking for someone laid-back. No pets at this time, perhaps later. Definitely NO cats. I&apos;m allergic to them, and prefer dogs. <br>\n<br>\nRequires good credit/background check + the customary first/last month&apos;s rent + $300 security deposit upfront. Pet deposit is just $100 and fully refundable if no damage. You will sublet from me. Gas, electric and water/sewer/trash removal are separate and average out $80/month each (much lower during summer/fall). Comcast WiFi is also available for about $25 more. Utilities and rent must be paid early or on-time each month. Must abide by a liberal cleaning agreement. No exceptions. Sorry, NO COUPLES, but guests are welcome within reason. I&apos;m easy going with that and expect you to be with me, too. <br>\n<br>\nABOUT THE HOUSE--<br>\nShare the first floor of an attractive large, 105-year old renovated house. Close to downtown, two blocks from great coffeehouses, restaurants, etc. Plenty of large double-pane windows with great views. Great front porch view of downtown. Hardwood floors in a large living and dining rooms. No AC, but floor fans work well and the house is well-shaded.<br>\n<br>\nABOUT THE AVAILABLE BEDROOM: Decent sized room with closet and use of entire hallway closet. Three windows. Peaceful, very quiet location at the rear of home. Plenty of room for a queen-sized bed, dresser, desk, etc.<br>\n<br>\nPlease respond to this ad soon with your phone # if you&apos;re interested and match the requirements.<br>\n<br>\ndo NOT contact me with unsolicited services or offers\n    ",
        "image": "http://images.craigslist.org/00L0L_i8FfrALEhBn_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4849957174.html"
    },
    {
        "title": "Large Unfinished Basement",
        "href": "/mlt/roo/4881466964.html",
        "time": "2015-02-07 09:14",
        "price": "$500",
        "neighborhood": null,
        "postBody": "\n        I have a large unfinished but livable basement room located close in SE Portland. This old house is split into 4 units one of which I rent. It is kind of a run down space but I have enjoyed living here. I previously used the basement as my bedroom/living room but am looking to lower the cost of living alone by finding a housemate so I condensed my stuff upstairs. We would be sharing just the kitchen and bathroom. The basement is approx. 700 sq.ft. with it&apos;s own entrance. The stairs inside, lead directly into the bathroom upstairs connected to the kitchen. Other than using the washer and dryer once a week in the basement there is no other reason I would need to go into your space and it could be separated to create more privacy.This house is old and the walls and floors can be thin though.<br>\n<br>\nThe rent is $500 plus gas, electric and internet, which half is about $95 in winter and $50 during the summer.<br>\n<br>\nI am a pretty easy going, pot smoking, beer, wine and whiskey drinking gay male that is 30. I have a cat. I like to play video games and hang out with friends. I work a lot during the day. Have no real expectations of you other than keeping our shared space clean and hopefully not be too awkward. <br>\n<br>\nReally great area close to Hawthorne and Division right below Ladd&apos;s Addition. Great for busing or biking. Parking is on street but requires a yearly permit in most spaces.<br>\n<br>\nIf you&apos;re interested please let me know a bit about yourself and I would be happy to answer any questions and send some pictures of the space.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881466964.html"
    },
    {
        "title": "Trade work for rent Basement bedroom in the country",
        "href": "/mlt/roo/4881418280.html",
        "time": "2015-02-07 09:12",
        "price": "$1",
        "neighborhood": " (NE Washington state)",
        "postBody": "\n        WE LIVE IN NE WASHINGTON STATE TWO HOURS NORTH OF SPOKANE AND 8 HOURS FROM PORTLAND. <br>\n<br>\nThe work-for-rent required is mainly carpentry along with various maintenance around the property. If you want out of the city keep reading because we are WAY out in a wooded rural part of NW Washington State. Enjoy the seclusion and outdoor activities of our 212 acre forested land. If you like the outdoors especially snow country you will love living here. <br>\n<br>\n<br>\n             PLEASE THOUROUGHLY READ BEFORE RESPONDING.<br>\n<br>\n<br>\nWe are asking for approx. 10 -- 15 (negotiable) hours of carpentry work per week.  If your skills are such that you can produce highly skilled work quickly the hours can be fewer. We are very informal with your work schedule but you will be asked to start your day by at least eight o&apos;clock in the am. The days you work are mostly left up to you. You will not be overworked and you will be appreciated here.<br>\n<br>\nYour accommodations: (see pictures)<br>\n&#x2022;\tFurnished basement bedroom (private)<br>\n&#x2022;\t(Shared use of the following basement spaces)<br>\n&#x2022;\tLaundry w/ washer &amp; dryer<br>\n&#x2022;\tComplete kitchen<br>\n&#x2022;\tLiving room w/ big screen TV<br>\n&#x2022;\tFree Dish TV channels<br>\n&#x2022;\tBathroom w/shower<br>\n&#x2022;\tWeight room<br>\n&#x2022;\tSome use of our WI-FI internet<br>\n&#x2022;\tCell phone reception for most services<br>\n&#x2022;\tYou pay no utilities<br>\n<br>\nOutdoors:<br>\n&#x2022;\tCampfire rings<br>\n&#x2022;\tTons of hiking/riding trails<br>\n&#x2022;\tUse of quads &amp; snow mobile<br>\n&#x2022;\tHorseback riding lessons if you desire<br>\n&#x2022;\tUse of shop w/lube pit &amp; cultivate your own garden space<br>\n&#x2022;\tBeautiful creek through the property<br>\n&#x2022;\tGreat off site hunting and fishing<br>\n<br>\nRequirements:<br>\n&#x2022;\tHonesty, clean &amp; a hard worker are the most important requirements.<br>\n&#x2022;\tYou must have some professional rough/finish carpentry experience such as framing, siding, trim work etc.<br>\n&#x2022;\tI need shelves/cabinets built in the shop, framing/siding work on the barn, etc.<br>\n&#x2022;\tYou must be a hard worker, follow directions and able to get along with others. There are other tenants in the basement you will be sharing with.<br>\n&#x2022;\tNo criminals. You will need to pass a thorough background check so please no bad stuff in your history for the last 5-10 years.<br>\n&#x2022;\tWe cannot have drug users, heavy drinkers or smokers in our house.  Please prepared to take a UA test, (bad experience with drug users).<br>\n&#x2022;\tYou need to be very clean as you will be sharing space with others.<br>\n&#x2022;\tNo personal vehicle required. You may hitch a ride into town for supplies with us when we go, (about once a week).<br>\n&#x2022;\tIf you do have a car be aware we live in snow country so you need a 4x4 or a AWD vehicle to get around. There is plenty of parking for a car/rv.<br>\n&#x2022;\tWe have enough animals here so no pets please. <br>\n&#x2022;\tYou will need a $100 REFUNDABLE cleaning/security deposit per bedroom before you move in.<br>\n&#x2022;\tYou will be providing your own food and personal items so you MUST have a separate income to make it out here. Not much employment in the area so (even though it is possible) don&apos;t count on getting a job locally. A retirement income of some kind would be perfect.<br>\n<br>\nAbout us:<br>\nWe a retired couple with a big house and way too many projects. I am a retired home builder and own a small sawmill that I use to cut my own lumber for all my building  projects.  My projects include:  A small log cabin on the property this year. Covered bridge over the creek, finish the barn, organize the shop, to name a few. We are respectful, friendly folks who are very easy to get along with, however we do expect the work to be done in a safe and professional manner.<br>\n<br>\nTHE PROPERTY IS 2 HOURS NORTH OF SPOKANE WA AND APPROX. 35 MINUTES FROM COLVILLE. <br>\n<br>\nCall me or email please (NO TEXT)<br>\n<br>\n<br>\n<br>\nKey words: basement, quiet, secluded, wooded, farm, horses, horse, acres, rental, creek, carpenter, labor, trade, bedroom<br>\n\n    ",
        "image": "http://images.craigslist.org/00L0L_8VDc8lwk2QH_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881418280.html"
    },
    {
        "title": "Beautifully Furnished Room AVAIL NOW, Short-Term Stay Okay",
        "href": "/mlt/roo/4866648747.html",
        "time": "2015-02-07 09:01",
        "price": "$795",
        "neighborhood": " (SE Division Richmond Hood)",
        "postBody": "\n        Tastefully furnished rooms in an historic house in the heart of the SE Hawthorne and Division Street area. For stays of 30 days or longer.<br>\n<br>\nVisit the Green Willow Guesthouse website for more photos, information and testimonials. Cut and paste the following URL into your web browser: <b>www.GreenWillowGuesthouse.com</b><br>\n<br>\nGreen Willow Guesthouse is hosted by the owner of a bright and spacious (2300 sq. ft.) 4-bedroom, 2-bath 1915 craftsman house with fully furnished rooms and everything you need for your short-term stay. It&apos;s in a quiet neighborhood with abundant street parking. The Richmond Neighborhood was voted one of the &quot;West&apos;s 24 Best Places to Live and Work&quot; by Sunset Magazine.<br>\n<br>\nWe&apos;re close to:<br>\n&#x2022; Stumptown Coffee<br>\n&#x2022; The Woodsman Tavern, Petite Provence and many other great restaurants<br>\n&#x2022; New Seasons and Fred Meyer grocery stores<br>\n&#x2022; Bagdad Theater<br>\n&#x2022; Bus lines 4, 14, 9 and 75.<br>\n<br>\nA 15-minute drive to Portland International Airport, downtown Portland and OHSU.<br>\n<br>\n<br><b>FEBRUARY SPECIAL ON THE MOUNT TABOR ROOM AND THE ROSE GARDEN ROOM--The first 30 nights is only $795 if you book by the available February dates below.</b>\n<br>\n<br>\n<b>Rose Garden Room: available FEBRUARY 8, 2015.<br> \nMount Tabor Room: AVAILABLE NOW.<br>\nHawthorne Room: available MARCH 2, 2015.<br></b>\n<br>\n<b>See rates below with descriptions of each room. Rent includes all utilities (gas, electric, water and trash), bed linens and towels, and high-speed WiFi Internet access.</b> All rooms have locks and window air conditioners in the summer.<br>\n<b>Minimum 30 days and then prorated for whatever length of time you need.</b><br>\n<br>\nPLEASE NOTE: For those with allergies to cats. One kitty lives here, however she is not allowed in the guest rooms. Sorry, no additional pets. \n<br>\n<br><b>ROSE GARDEN ROOM--AVAILABLE FEBRUARY 8, 2015<br>\n$850 a month October through May. $950 a month June, July, August and September</b>\nWindows facing the south and west (towards the gardens) make this a bright and cheery room. It&apos;s on the main floor, approx. 10 x 12 feet plus a large six and a half by three foot closet, with nine foot ceilings and fir-wood floors. Large shared bath is also on the main floor. Fully furnished with. . .<br>\n&#x2022; Full-size antique shabby chic bed with semi-firm mattress<br>\n&#x2022; Nightstand<br>\n&#x2022; Desk<br>\n&#x2022; Chair<br>\n&#x2022; Two large angled bookcases, each over three by six feet<br>\n<br>\n<b>HAWTHORNE ROOM--AVAILABLE MARCH 29, 2015<br>\n$795 a month October through May. $895 a month June, July, August and September</b><br>\nAn angled seven-foot ceiling gives this second floor dormer room cozy appeal. It&apos;s 145 square feet with beige carpet, light yellow walls and a deep closet for extra storage. The room includes:<br>\n&#x2022; Full-size bed with semi-firm mattress<br>\n&#x2022; Nightstand<br>\n&#x2022; Dresser<br>\n&#x2022; Desk &amp; chair<br>\n<br>\n<b>MOUNT TABOR ROOM--AVAILABLE NOW<br>\n$850 a month October through May. $950 a month June, July, August and September </b><br>This second-floor room has over 225 sq. feet and offers morning light and a view of Mount Tabor Park.<br>\nThis warm and spacious room includes:<br>\n&#x2022; Queen-size bed with semi-firm mattress<br>\n&#x2022; Nightstand<br>\n&#x2022; Dresser<br>\n&#x2022; Bookcase<br>\n&#x2022; Desk &amp; chair<br>\n&#x2022; Deep closet + an armoire<br>\n<br>\n<b>You&apos;ll also enjoy these house amenities:</b><br>\n&#x2022; Vintage-style kitchen with 1948 stove/oven and modern appliances (dishwasher, refrigerator, microwave, toaster, toaster oven, coffee maker) plus cookware, dishes, and utensils. Storage space for your food.<br>\n&#x2022; Washer and driver in the basement<br>\n&#x2022; Formal dining room<br>\n&#x2022; Piano <br>\n&#x2022; Hardwood floors on main level<br>\n&#x2022; Architectural features including built-ins, leaded-glass windows and crown moldings<br>\n&#x2022; Bike storage in the garage <br>\n&#x2022; Large front porch with swing and rockers for lounging<br>\n&#x2022; Private backyard with fruit trees<br>\n&#x2022; Raised-bed vegetable gardens<br>\n<br>\nThis is a peaceful house with a mellow and creative energy. If you&apos;re an easy-going, friendly, good communicator with positive energy, you&apos;ll love it here. We enjoy quiet time after 10 p.m. during the week. No smokers, no drugs, no heavy drinkers. <b>Sorry, no couples please. Single occupancy only.</b><br>\n<br>\nReservations and deposit required to hold the room. <br>\n<br>\nYour host: I am female, in my 50&apos;s and the homeowner. Creative, conscious, easy-going and into healthy living. I&apos;m an author, marketing communications writer and personal renewal coach. When you reply, please tell me something about yourself and what appeals to you about this living situation. That way I&apos;ll know you are a real person seeking housing and not a scammer. <br>\n<br>\nI look forward to talking with you.<br>\n<br>\nLori\n    ",
        "image": "http://images.craigslist.org/00x0x_akN9hLY2A3L_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4866648747.html"
    },
    {
        "title": "Room For Rent",
        "href": "/mlt/roo/4881411092.html",
        "time": "2015-02-07 08:42",
        "price": "$500",
        "neighborhood": " (Inner SE)",
        "postBody": "\n        We&apos;re an older couple (50s/60s) with a room to rent. Our house is in the south side of Ladd&apos;s Addition. We have a small furnished upstairs room with a shared bath. The other upstairs renter is a young male PSU student. The room is $500/month. This includes everything, such as utilities, wifi, washer/dryer access, and kitchen privileges. As this is a shared house, we will respect your privacy, and expect the same in return. We have an entire crew of dogs and cats, which will quickly learn to be your best friends. We do not have room for any more animals at this time! We are car free (bike everywhere!), although there is a parking space in the alley behind our house. There is a market, coffeehouses, and restaurants very close. This area is quite walkable. Our house is on bus route 4, and one can be downtown in less than 10 minutes.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881411092.html"
    },
    {
        "title": "Nice room gated property on max!! Utilities inc.",
        "href": "/mlt/roo/4881373609.html",
        "time": "2015-02-07 08:29",
        "price": "$425",
        "neighborhood": " (gresham)",
        "postBody": "\n        Nice room......can be furnished ...or unfurnished.........full sized bed (currently furnished) dresser, chair, tv stand, night stand, nice with lots of windows.  ALL utilities included withxfinity super wifi and hulu plus and netflix provided as well... use of house, kitchen and laundry.  PRIVATE gated property that is wooded and very country feel in the city...a couple blocks from major max stop and 1 block from bus 20...close to resturants, stores and gas...CHILL neighbors ...NO PETS.... SMOKING outside only<br>\n<br>\n.....I offer three ways of renting........month to month requires first/last and deposit....6 month lease requires first and last and deposits waived......year lease requires just first months rent...last month and deposit waived.<br>\n<br>\nverifiable income...criminal check and 25.00 app fee     NO COUPLES<br>\n<br>\nready now..NO COUPLES\n    ",
        "image": "http://images.craigslist.org/01515_glTE5dMVeaI_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881373609.html"
    },
    {
        "title": "********Giant Room For Rent In Beautiful Home********",
        "href": "/mlt/roo/4881235932.html",
        "time": "2015-02-07 08:26",
        "price": "$500",
        "neighborhood": " (***Portland***)",
        "postBody": "\n        I am seeking a housemate, to share my cute SE Portland house with me. The 13 x 13 bedroom with carpeting, a big closet, and a nice window will be available March 1 for $550/mo, including wifi and other utilities. <br>\n<br>\nThe house has hardwood floors, two bathrooms and three bedrooms (one is my office), good heating plus a toasty woodstove, gas range, washer/dryer, basement with plenty of storage space, large vegetable garden and fruit trees. Enjoy hanging out in the backyard or on the front porch, and eating fresh veggies and fruits from the garden. Walking or biking distance to shops on Woodstock, Foster and Reed College, and there&apos;s a busline close by. I bike to work downtown from here. <br>\n<br>\nI&apos;m a 40-yr old woman, and I&apos;m taking classes at PSU in addition to working for an environmental organization, which means most of my free time is spent studying. I&apos;m looking for someone who&apos;s a good fit with my fairly liberal, quiet and friendly household -- you&apos;re easy going and you do your part. I have one cute cat who fights with neighbor cats; I would consider a pet if it was a good fit. <br>\n<br>\nIf you are interested, please send me an email (with Your Phone number) or text  a little information about yourself, your schedule (work, routine), lifestyle and any questions you have. <br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881235932.html"
    },
    {
        "title": "Room in gorgeous classic house w/ great yard!",
        "href": "/mlt/roo/4876866668.html",
        "time": "2015-02-07 08:11",
        "price": "$415",
        "neighborhood": " (SE Foster - Powell)",
        "postBody": "\n        Hi there!<br>\n<br>\n<br>\nWe are looking for a someone to share our large comfortable house with us. There are currently 3 of us and it is a mature household. We hold stable jobs and while it is not a &apos;party&apos; house, we enjoy getting together socially and having a BBQ etc. <br>\nThe main floor hosts the kitchen, a large living room and dining room, bathroom and 2 bedrooms (including the one that is up for rent). The bedroom layout offers plenty of privacy. The top floor is a private, non-communal living space with its own bed and bath where two of us reside. The kitchen tends to be the most social, well-used room in the house and if you live with us we require you to think communally by leaving the shared rooms clean and available for others coming behind you. We enjoy conversation and being social, but are independent and can often be busy with our own schedules. We equally share the responsibility of keeping the communal rooms tidy and bring in a cleaner once a month to deep-clean the bathrooms and kitchen. <br>\nWe mostly keep &apos;day&apos; hours from about 6:30am to 10:30pm and are seeking someone with compatibility in this area. Communication and receptivity are important to us and we avoid drama over simple requests and passive-aggressive ways of relating. Home is a place to feel genuinely relaxed and tension free and we practice open communication to ensure we have a peaceful home. We are comfortable with folks being honest and up front, expressing their concerns in a caring, respectful manner if something is bothering them and will work to find a solution that works for everyone involved. Give us a call if it seems like this would be a good fit. <br>\n<br>\nOther details about the house:<br>\n<br>\n&#xB7; Rent is $415 per month, $415 refundable deposit required<br>\n&#xB7; Shared utilities (average $75 per month over 12 mos.)<br>\n&#xB7; Spacious attractive 1913 home, among big trees<br>\n&#xB7; Room on light, sunny side of house (11&quot; x 11&quot;)<br>\n&#xB7; Quiet neighborhood with beautiful large, secluded back yard &amp; deck<br>\n&#xB7; Shared kitchen, spacious living &amp; dining room<br>\n&#xB7; Located near SE 79th and Holgate<br>\n&#xB7; 2 minutes walk to the 17,72,14 bus lines. Easy access to downtown, bike or bus<br>\n&#xB7; Close to Holgate Library; Mt Scott community center - pool, gym and Yoga classes; the Spring water Corridor trail and Lents &amp; Essex parks<br>\n&#xB7; Plenty of off road parking<br>\n<br>\n<br>\nUnfortunately (for pet owners &amp; smokers) we are a &apos;no smokers / no pets&apos; household.<br>\n<br>\nSend us a little info about yourself if you&apos;re interested and we&apos;ll get back to you with further info.\n    ",
        "image": "http://images.craigslist.org/00g0g_eOpmNTDQsMz_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4876866668.html"
    },
    {
        "title": "The Men&apos;s Dormitory at Kailash Ecovillage.",
        "href": "/mlt/roo/4841200525.html",
        "time": "2015-02-07 08:04",
        "price": "$350",
        "neighborhood": " (inner SE Portland)",
        "postBody": "\n        A new concept in community living, the first of its kind in Portland. A 6-bed hostel style (dormitory) occupancy at Kailash Ecovillage, a 7-yr old intentional community in inner SE where sustainable practices such as extensive recycling, composting, sustainable gardens and food production, rainwater and solar energy harvesting are being developed.<br>\nLocated close-in in SE Portland and walking distance to Trader Joe&apos;s, Walgreens, Safeway, and a host of other stores to serve your needs. Two blocks from bus 75 39th Ave, three blocks to 17 Holgate bus line, and a few more blocks to 9 Powell Blvd bus line.<br>\nMinutes from downtown, PSU, OHSU, NCNM, and Reed College.<br>\n<br>\nEmail us at kailashecovillage at  gmail.<br>\nAlso visit us at www.kailashecovillage.org<br>\n<br>\nSpecifics:<br>\nTotal dorm area: about 1100 sq ft; bathrooms and kitchen with solid wood cabinets and granite countertops. Large common room with dining and living areas. Two sleeping areas with 1.5 bunks each. (No private rooms.)<br>\nRent $350/month (Security deposit $300), 6 month lease<br>\nApplication fee $20<br>\nOn-site laundry facility<br>\nFurnished with basic furniture (beds with foam mattresses, tables, chairs, futon couches, lockable lockers, and kitchenware such as pots, pans, and dishes)<br>\nOn-site parking -- bike encouraged!<br>\nWater, sewer, electric, and garbage included in the rent<br>\nTwo bathrooms, 2 toilets, 4 shower stalls<br>\nOn site community garden plots available<br>\nNo pets<br>\nNo smokers<br>\nPlease note, this is a space for males only.<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00M0M_EZLpDRkSzS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4841200525.html"
    },
    {
        "title": "Small Garden Bed Room for Rent",
        "href": "/mlt/roo/4881338257.html",
        "time": "2015-02-07 07:58",
        "price": "$400",
        "neighborhood": " (Woodstock)",
        "postBody": "\n        One bedroom, for rent, available in the month of February, 2015, in Portland. This rental is available February through May, 2015, and it could go longer. Rent is $400.00/month, includes utilities (Wifi, water, garbage, electricity, oil heater in main house). Month to month. The house is located in the SE Woodstock district of Portland. Brentwood Park is nearby. The neighborhood is quiet at night, no barking dogs or clucking chickens. Comfortable four bedroom house with one shared bathroom and kitchen. There is a working fireplace. The bedroom is small and has a very comfortable, single bed; it would not fit a larger bed hence, no couples. The bedroom has its own entrance. The #19 bus stops half a block away. There is no cable, just basic t.v. capacity. The garden room has its own heater and fan, and there is space for a bike. A washer/dryer is available for use. There is some additional storage space available in the basement. The very large backyard has two hammocks, a fire circle, and a developing garden. There is always plenty of on street parking. This is a very mellow household. We will be doing a background check. Here are the no&apos;s: no illegal drugs, no alcohol, no tobacco, no pets. Close to Reed College, SE PCC and Warner College. We are looking to live harmoniously with our new housemate. Are you that person? &#xA0;Text or e-mail. Let&apos;s chat.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881338257.html"
    },
    {
        "title": "move in immediately",
        "href": "/mlt/roo/4881331620.html",
        "time": "2015-02-07 07:54",
        "price": "$400",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Have a room with a big master cloths sets. Not for smoker, any druggies either. You should be Employ/full time student. Sorry no pet. $ 400 a month to month deal. Utility price is flexible- depend on your situation. The place is open now, come, &amp; visit it today. (just one block to max station, &amp; right next to a bus line <br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881331620.html"
    },
    {
        "title": "The best of both worlds! 2 bed pseudo-apartment in super cozy home.",
        "href": "/mlt/roo/4872678743.html",
        "time": "2015-02-07 07:43",
        "price": "$1100",
        "neighborhood": " (north portland)",
        "postBody": "\n        Day-lit basement &quot;apartment&quot; with 2 bedrooms, enclosed and soundproofed den area, private full bathroom and separate entrance. Common areas include on-site laundry, fully stocked kitchen with gas range, back yard w/deck, and bike storage. This is the perfect set up for a couple.<br>\n<br>\nSouth-facing front yard is dedicated to organic flowers, veggies and fruit. Large fenced back yard has a hammock, a huge deck, and a &quot;Cadillac&quot; of a gas grill. The house has wireless internet and is located near New Seasons, Fred Meyer, Yellow Max line, a number of bus lines, I5, and downtown Kenton. <br>\n<br>\nA little bit about me: I am really easy to live with, I keep things very clean and mostly neat, and I have a great sense of humor. Although I am gregarious and enjoy socializing, I often keep to myself after a long day at work in order to recharge. I am quiet and respectful of others, but I do love music and on occasion having friends over for a meal. I also strive to be as &quot;green&quot; as possible -- solar hot water and PV systems, composting, recycling etc. The greatest lessons I&apos;ve learned about how to be a good roommate are to not sweat the small stuff, and to ask for what you want without expecting/requiring that you get it. <br>\n<br>\nA little bit about you: I am looking for a renter(s) who values maintaining a cozy home (including shared chores in common areas), communicates openly and respectfully, and who has a good heart and a great sense of humor. It would be dreamy if I could find someone who loved to garden too! <br>\n<br>\n$1,100/month + utilities + $1,300 security deposit with month-to-month lease. Pets could be considered depending on the type of pet(s) and with additional pet deposit. <br>\n<br>\nCall Jenn at \n <a href=\"/fb/pdx/roo/4872678743\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nfor more information. I look forward to hearing from you!\n    ",
        "image": "http://images.craigslist.org/00000_eReM324hkyq_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4872678743.html"
    },
    {
        "title": "Teachers, host an international student &amp; earn extra income",
        "href": "/mlt/roo/4881275730.html",
        "time": "2015-02-07 07:29",
        "price": null,
        "neighborhood": " (portland)",
        "postBody": "\n        Are you a teacher looking for supplemental income? Do you have a spare room in your house? As a teacher, you have already dedicated your life to the enrichment of others. Why not expand that reach to international students?<br>\n<br>\nAmerican Homestay Network is a homestay management company that places international students, scholars, interns, and business professionals with American host families. Our mission as a company is to provide the safest, highest quality homestay experience in America. We are always in search of people who have a heart for others and the ability to show their hospitality by opening their homes to someone else. <br>\n<br>\nSome of the unique things we offer to our hosts are: <br>\n<br>\n\t&#x2022;\tSupport during the entire homestay experience. There is a local homestay manager that is there to assist our hosts from the day the guest arrives to the day they leave.<br>\n\t&#x2022;\tIn-depth cultural and homestay training for the hosts and the students.<br>\n\t&#x2022;\tA variety of homestay options. This includes long term, short term, weekends, etc. <br>\n\t&#x2022;\tCompetitive compensation of $460-$1350 per month<br>\n\t&#x2022;\tOnline payment services that minimize collection issues<br>\n<br>\nHosting an international college or high school student for a short- or long-term stay is an opportunity to expand your family, enrich your outlook, and supplement your savings. Please visit https://us.homestaynetwork.com/host/apply?referral=craigslist to apply or give us a call for more information. <br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00V0V_bUaqc9lHeuh_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881275730.html"
    },
    {
        "title": "International students seeking American home accommodations",
        "href": "/mlt/roo/4881273795.html",
        "time": "2015-02-07 07:23",
        "price": null,
        "neighborhood": " (portland)",
        "postBody": "\n        We are looking for English-speaking host families or individuals to offer a room for an international college student. <br>\n<br>\nMonthly compensation for qualifying host families is between $460-$1350, paid every 2 weeks. Compensation varies based on accommodation, location, meals and transportation provided.<br>\n<br>\nAmerican Homestay Network is a homestay management company that places students with families for short or long-term stays. We have immediate need for families or individuals to provide a warm and supportive home environment for these students. <br>\n<br>\nThe application process is simple and all students and hosts are carefully screened. We also provide 24 hour support for both students and hosts.<br>\n<br>\nThis is an excellent opportunity to have a cultural experience within your own home, change the life of an international student, and make extra income at the same time.<br>\n<br>\nPlease call for more information, respond to this listing, or apply at https://us.homestaynetwork.com/host/apply?referral=craigslist <br>\n\n    ",
        "image": "http://images.craigslist.org/00Z0Z_aeiZysVKagg_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881273795.html"
    },
    {
        "title": "Large basement room in Sellwood",
        "href": "/mlt/roo/4865906244.html",
        "time": "2015-02-07 07:20",
        "price": "$450",
        "neighborhood": " (946 SE Nehalem St)",
        "postBody": "\n        Large room for rent. Utilities split between you and 3 other housemates; they&apos;re usually $75 per person. Rent is $450, and deposit of $400 is due at the time of move in. <br>\n<br>\nYou can move in as soon as you pass the screening through the management company. Rent will be prorated.<br>\n<br>\nRoom is furnished, unless you don&apos;t want the furniture.<br>\n<br>\nSorry, the management company doesn&apos;t allow pets.<br>\nThe application fee is $40.<br>\n<br>\nThis room is for one person, as it&apos;s already a packed house.<br>\n<br>\nEmail me for a time to view the room. First come first serve.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4865906244.html"
    },
    {
        "title": "Large Room and Private Bath in the Country - Utilities, etc. Included",
        "href": "/mlt/roo/4881268343.html",
        "time": "2015-02-07 07:11",
        "price": "$600",
        "neighborhood": " (Rural Scappoose)",
        "postBody": "\n        Large room for rent in country home,  about 6 miles northwest of Scappoose on 5 partially wooded acres along the North Fork of Scappoose Creek.  Rent is $600/month, and includes electric, water, and garbage, with in-room separate telephone number (party line), DSL internet service, and satellite TV.  I commute to work in NE Portland, and it takes about 45 minutes each way in most weather - it&apos;s also about 45 minutes to Beaverton, Hillsboro, Longview, Vancouver, etc.<br>\n<br>\nCarpeted 11&apos; x 23&apos; room is downstairs, (daylight basement) and separate from my living area, in a modest ranch-style country home.  Private bath upstairs.  One parking space included in garage, along with a small area of basement storage.  Shared kitchen area. Fenced yard, and pets are negotiable. <br>\n<br>\nRental is month-to-month, but I am hoping to rent long-termish to someone responsible, reliable, and trustworthy who enjoys the country environment.  I like my privacy and general solitude, and offer the same to you.  (I&apos;m not at all anti-social, just the solitary sort.)  If you have an interest in country living, I&apos;d be glad to talk with you about your living needs and plans. <br>\n<br>\nThank you.<br>\nIrene\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881268343.html"
    },
    {
        "title": "*** PRIVATE 2 bedrooms + bath + living area ***",
        "href": "/mlt/roo/4881231596.html",
        "time": "2015-02-07 06:42",
        "price": "$995",
        "neighborhood": " (Lovely home in very close-in SE Portland)",
        "postBody": "\n        Do you want to live in a centrally located neighborhood, just minutes from the Sellwood Bridge, and within walking distance to wonderful restaurants, coffee shops, bakeries, New Seasons, bike paths, and kayaking?<br>\n<br>\n... LOOK NO FARTHER!<br>\n<br>\nYour 2 bedrooms, private bath, plus living quarters on the second floor are spacious, light-filled, and freshly painted.<br>\n<br>\nWe would share a fully-stocked kitchen and the dining room. The laundry facilities and some storage are available to you in the basement. <br>\n<br>\nThis is a clean and peaceful home, not a party house, so NO smoking or drugs.<br>\n<br>\nI&apos;m respectful, have an active life, am easy to get along with, and keep a clean home ... hopefully you are as well.<br>\n<br>\nCredit check, references, and proof of dependable income are required. One year lease with first and last month&apos;s rent + $150 security deposit. We will split the utilities.<br>\n<br>\nYour new home is available immediately. Email Chris via this posting and tell me a little about yourself. Include your phone number, and I&apos;ll promptly return your call. <br>\n<br>\nThanks for your interest. I&apos;ll look forward to hearing from you!\n    ",
        "image": "http://images.craigslist.org/00m0m_9WzOKWIs8pe_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881231596.html"
    },
    {
        "title": "Private bath, rent includes utilities, internet",
        "href": "/mlt/roo/4872858946.html",
        "time": "2015-02-07 06:33",
        "price": "$500",
        "neighborhood": " (SW Barbur &amp; Capital)",
        "postBody": "\n        $500, rent includes internet,water and garbage. Available 02/01/2015. Please call Don to set up an appointment at \n <a href=\"/fb/pdx/roo/4872858946\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nPrivate home on quiet dead-end street with woodland setting. Big deck with gas BBQ. Big fireplace. Free laundry, free wireless internet. Plenty of street parking and storage space in the basement if you have lots of extra stuff.<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nI&apos;m flexible on lease options, actually prefer month-to-month and only ask for first &amp; last, + utility deposit. I&apos;ll need some sort of proof of income (paystub, student loan etc.).<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nThe room has a private bathroom and a sliding glass door that opens onto the deck.<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nConvenient to OHSU (15 minutes), PCC Sylvania (walk there), Lewis &amp; Clark College (5 minutes), and PSU (15 minutes). About 12-15 minutes to downtown without getting on the freeway.  Barbur TC (4 minutes) is served by Trimet all day.<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nPlease don&apos;t contact me if you&apos;re looking for a room for more than one person, I will only rent it to one person at a time. No pets please. No Smoking.<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nNice stuff around; Tryon Creek State Park, Multnomah Village, Gabriel Park, Costco.<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\nPlease call Don to set up an appointment at \n <a href=\"/fb/pdx/roo/4872858946\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4872858946.html"
    },
    {
        "title": "Room Available Now Close in SE (Brooklyn)",
        "href": "/mlt/roo/4881149231.html",
        "time": "2015-02-07 05:12",
        "price": "$450",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        <b>-The Details-</b><br>\nCost : $450 +utils (electricity/internet)<br>\nThe Room: 9.5&apos;x10.5&apos; with a big closet <br>\nThe Apartment: A large living room and decent sized, well-stocked kitchen with an average size bathroom and a small back porch.  The living room has a little room for some furniture but there isn&apos;t too much storage outside of your room. Someone with a whole house load of furniture would not fit very well.  The room has a guest bed in it right now and can be adjusted to fit your needs. \nThe place is in an awesome location within biking/walking distance of 2 New Seasons, QFC, downtown Sellwood, Clinton St. area, and a very quick commute to downtown.\n<br>\nThe Roommate: I&apos;m a 37 year-old, artist, developer, creative type of person. I don&apos;t really drink or smoke or smoke and I pretty much eat vegan food with the exception of sweet deserts from time to time. I am generally laid back and mellow. I tend to always have some projects going on so I might not be the best fit if you are looking for a buddy to hang with all the time but I am very sweet, kind and respectful and share space well with likeminded individuals.  I enjoy cooking and would love to share some meals from time to time.<br>\n<br>\nThe room is available now. <br>\n<br>\nI&apos;m looking for a good roommate that is professional, responsible, pays bills on time, has similar eating habits as me, and is not a pain to be around. It would be nice if we had similar or complimentary interests as well. If you respond via email, it would be helpful to include some information about you. <br>\n<br>\nIdeally:\nThe perfect person for this room might be someone just looking for a month or two of renting and who doesn&apos;t have a lot of stuff. I had someone bail at the last minute for January but ideally I could find someone who is ready to move in and stay at least the month of January to see how it works out. \n\nI&apos;m not a huge fan of smoking or vaping. \n\nPlease no couples or pets - too crowded!\n    ",
        "image": "http://images.craigslist.org/00J0J_b4Wc7SIbe4U_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881149231.html"
    },
    {
        "title": "Private Large Room in Beautiful Queer Friendly House",
        "href": "/mlt/roo/4881137971.html",
        "time": "2015-02-07 05:04",
        "price": "$425",
        "neighborhood": " (Parkrose Heights)",
        "postBody": "\n        Our communal house currently has a private large room on the main floor open for move in asap or by Feb 1st<br>\n<br>\nAbout the room:<br>\n425.00 per month (utilities included)<br>\nPrivate room<br>\n4 month lease (ideally)<br>\nHardwood floors<br>\n3 Windows<br>\nWalk in closet space<br>\nRight next to main bathroom<br>\n<br>\nAbout House: <br>\nThis house is a beautiful property to rent from and here&apos;s why:<br>\nBuilt in 1929<br>\nInternal walls are painted in wonderful colors, and all our floors are hardwood floors. We have plenty of windows for natural sunlight. Extra large living room, Huge kitchen with dishwasher, two sinks and breakfast nook. Plenty of space for communal living.<br>\n1,868 sqft<br>\nSingle-Family Home  (3 floors)<br>\nHuge front yard and backyard garden<br>\n2 bathrooms (one full bathroom, and one half bath in basement)<br>\n<br>\nBenefits:<br>\nReally awesome roommates who respect communal spaces and privacy (currently we are 1 male and 4 females along with me who is non-binary/queer)<br>\nParking available in drive way or side of house.<br>\nLaundry on site in basement.<br>\nCommunal living, without social expectations.<br>\nHigh speed internet, cable, gas, heat, water and garbage (all included in rent).<br>\nClose to the max (green, blue, red) lines and bus to max.<br>\nClose to Winco (24 hr) and Fred Meyers<br>\n<br>\nTerms are:<br>\nFirst (425) and Last (425) months rent (can be used as a deposit)<br>\n4 month lease.<br>\nUtilities included.<br>\n<br>\nWe have one indoor cat, so we cannot accept other cats/dogs.<br>\nPlease be one occupant only.<br>\nBefore messaging with interest, please look up the area (it is outer NE, Parkrose neighborhood)<br>\n<br>\nPlease include in your message:<br>\nName, contact, times to contact<br>\nSource of income/employment<br>\nWhere are you moving from<br>\nHave you lived in communal living before<br>\nWhat kind of roommate are you<br>\nNo cats, dogs, couples<br>\n<br>\nProcess: I receive email, go through them all, contact the people who are applicable then have a phone conversation. If you are a good fit you will have a viewing of the room and house and meet the roommates. I&apos;m currently taking over for my brother (who is on the road and is main lease holder). So I&apos;ll be the main source of contact.<br>\n<br>\n*Please list your favorite color in the subject line so I know you read the entire ad (including location and four month lease)<br>\n<br>\nThank you for looking!<br>\nSid<br>\n\n    ",
        "image": "http://images.craigslist.org/00a0a_cCBtDeoVhJH_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881137971.html"
    },
    {
        "title": "Congenial Housemate - Female",
        "href": "/mlt/roo/4866469530.html",
        "time": "2015-02-07 04:42",
        "price": null,
        "neighborhood": " (Interstate Bridge)",
        "postBody": "\n        ONLY Long-Term Prospects (Over a year).<br>\nShare a townhouse centrally-located by the Interstate Bridge.  In an idyllic setting, with public transportation at the door and shopping, downtown Vancouver, Clark College, and many amenities within walking distance. . . the living quarters include a bedroom and adjacent full bath for you (your housemate has the 2nd bedroom and bath); washer/dryer upstairs; high ceilings, both floors; expansive front porch and rear patio; and ample common areas (kitchen, dining and living).  Townhouse is fully furnished EXCEPT for the bedroom; and deposit is in place (housemate has been residing here for several years).  Cleaning chores to be shared!<br>\nCost of lease, all utilities, cable and WIFI is approximately $1550 per month. . . but your share could be subsidized somewhat in exchange for some cooking/cleaning services or even editing services if you have the academic background (your housemate is a writer).  Your cost: $500-$750 range.<br>\nOther:  Prefer no pets but, if an otherwise great compatibility exists, an exception might be made -- it would require, however, a pet deposit.  Housemate offer is extended to intellectually and emotionally-mature female in good health; someone with a reasonable education-culture capable of carrying a conversation; a person financially-solvent, AND a spotless [criminal] background.<br>\nYour host-housemate: a scholarly, mature gentleman with a successful and long professional background in the community now dedicating the third stage of his life to writing.<br>\nIf interested, please reply in an extensive manner stating your preferences. . . and describing yourself.  If you are in a hurry &quot;to rent a place,&quot; your needs and mine are probably incompatible, since my search is for congeniality. . . and finding whether it might exist requires more than just a casual meeting.   <br>\n<br>\n  <br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4866469530.html"
    },
    {
        "title": "Room in Cozy Woodlawn home",
        "href": "/mlt/roo/4881118245.html",
        "time": "2015-02-07 04:15",
        "price": "$390",
        "neighborhood": " (NE 8th and Dekum)",
        "postBody": "\n        Available. February<br>\n Seeking Women only. <br>\n<br>\nRoom in cozy home near the historic Dekum Triangle.  <br>\n<br>\nWe&apos;ve had a great calm and quiet and comfy home and our housemate is moving closer to campus. Looking to have same nice energy in home. <br>\n<br>\nLive with one a preschool teacher, and me, a Montessori Elementary Teacher, and my 3.5 year old. <br>\n<br>\nWould like to find an Eco-minded, clean, responsible, healthy lifestyle, honest, communicative person who has lots of experience living with people.  We compost almost everything, and recycle all that we can, and are aware of energy usage, etc.  <br>\n<br>\n****Would like to find an Education Student, or Montessorian, especially Primary trained.  Would like to have someone who can do occasional babysitting, for good pay.<br>\n<br>\n****THE HOUSE - 3 bedrooms, 1 bath house, plus backyard studio room (electricity only - this is not avail. to live in, but to use). Small front yard, side garden beds, lots of blueberries growing everywhere! Shed for bikes! Washer and dryer in house.  <br>\n<br>\nMonthly rent is $390 + shared utilities  average of $75 per month each (gas, electric, water/sewage, internet), hugely varying from summer to winter. I have been paying trash and recycling.  <br>\n<br>\nFirst and last month, and $200 security deposit. Month to month agreement. <br>\n<br>\n<br>\n****House is 2 blocks from Woodlawn Park, cafe, restaurants, pizza parlor, pilates, breweries, 2 Bus routes. 2 miles to New Seasons Concordia, Kennedy School or Mississippi Ave. Closer to Concordia University and PCC Cascade and Alberta Arts District. <br>\n<br>\nPlease NO PETS. NO smoking, heavy drinking or drug use, or passive aggressivity. <br>\n<br>\nPhone or text <br>\nThanks!<br>\n\n <a href=\"/fb/pdx/roo/4881118245\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00505_8QJAlmI5s2d_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881118245.html"
    },
    {
        "title": "Master Bedroom available in SE Portland!",
        "href": "/mlt/roo/4881099575.html",
        "time": "2015-02-07 03:15",
        "price": "$900",
        "neighborhood": " (3206 SE 84th ave)",
        "postBody": "\n        Hello my name is Daniel and I&apos;m a 27 year old college student. I have a three bedroom house I rent with one other roommate.  He is 21. We are pretty easy going college guys. The room I have available is the master bedroom and it is large and measures 400 sq ft. It has its own bathroom and electric heating. Brand new laminate floors and large bathroom. I am asking for 900 a month which includes all utilities including electric, Internet wifi, and water. We have a washer and dryer also. The house is old but lots of space. I am asking first and last month&apos;s rent and 200 dollar deposit.  The room is move in ready Feb 28th but can set up viewing anytime just text or call me at <br>\n <a href=\"/fb/pdx/roo/4881099575\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a><br>\n\n    ",
        "image": "http://images.craigslist.org/00a0a_3fND6NUzzzD_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881099575.html"
    },
    {
        "title": "Room in a chill home open to you",
        "href": "/mlt/roo/4860184662.html",
        "time": "2015-02-07 02:19",
        "price": "$500",
        "neighborhood": " (Lewis and Clark College)",
        "postBody": "\n        I have a room for rent in a 3 bedroom house.  The house is walking distance from Lewis and Clark college and 2 blocks from Market of Choice, Subway, Tryon Creek Bar and Grill, and Starbucks. There is also a veterinary, hair salon, dry cleaner, yoga, bike shop, martial arts, gas station, and close to I5 on ramp.  <br>\n<br>\nThere is off street parking if you have a car but it is also on 2 major bus routes if that is how you get around. Everything is close for biking or walking. The house has nice landscaping with a yard and a beautiful magnolia tree growing between the decks. It has 2 decks and 1 is covered so you can enjoy it during the rainy season (that season is a long one). I have lived in this neighborhood for about 9 years and it is safe and pretty.   <br>\n<br>\nI own the house and love it.  I am always trying to improve the house to make it nicer and more comfortable for everyone. I have owned it two years and still completely in love with it.<br>\n<br>\nSorry but not open to dogs or couples. Best of luck.\n    ",
        "image": "http://images.craigslist.org/00r0r_8zxueVdkZMV_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4860184662.html"
    },
    {
        "title": "APRIL 1! Room available in unique house",
        "href": "/mlt/roo/4873325146.html",
        "time": "2015-02-07 00:51",
        "price": "$425",
        "neighborhood": " (SE Portland near Mall 205)",
        "postBody": "\n        We will have a room available on the upper level of our 6 Bedroom / 3 Bathroom tri-level house by APRIL 1st (possibly a little sooner). <br>\nWe are seeking a kind, fun, considerate, friendly person - really, someone who would fit in comfortably here, and appreciate being a part of our unique household with all that it has to offer. <br>\nWe are an interesting blend of men &amp; women of various ages - an eclectic mix of the kind of people that make Portland such a great place to live - artists, students, baristas, skateboarders, bike riders, hikers, internet entrepreneurs, musicians. We are all fairly introverted and share a variety of common interests. We are all kind, respectful, creative, art-oriented, comedy, literature, music &amp; movie loving liberals, with widely varied schedules, and active lives. <br>\nWe also have 2 cute, small, nice dogs, and a friendly (mostly outdoor) cat. <br>\nThe addition we are seeking will be considerate, friendly, and responsible; have a great sense of humor and be easy to talk to; like animals, but preferably have none of their own; have stable finances and an active life; not be a big drinker; not need to have overnight guests; and willing to do the majority of their socializing away from the house. <br>\nThis is a very respectfully 420-friendly household, but no smoking in the house.<br>\nWe are mostly meat-eaters, but we do welcome tolerant vegetarians/vegans.<br>\nThe house has a nice fenced backyard with fountains, and some gardening space is available. <br>\nWe&apos;re located within a short walking distance to several buses and MAX lines (the #15 Belmont, #20 Burnside, #4 Division, the Greenline MAX and Blueline MAX).<br>\nThe house is in a quiet, safe, residential neighborhood within easy walking distance to many useful amenities. We are very close to Mall 205 (Please be sure to mapquest zip 97216 or look up Trimet stops #11027 or  #11411 to determine if the location will work for you).  Near a Dollar Store, Big Lots, Target, Home Depot, and many other useful shops, businesses, and restaurants. The Eastside Community Center is only three blocks away, and it offers lots of great classes, an awesome new pool, a weight room, and outdoor track. Adventist Hospital (where there is a vegan bistro) and the East Portland police station are also very close to our house. Powell Butte and Mt. Tabor are nearby for spontaneous hiking and biking. We are very centrally located with a freeway exit to I-205 only a couple minutes away. Bike riders - we are close to bike paths AND we have our own in-house bike mechanic!<br>\nIt&apos;s $450/month, which includes utilities. Furnished, possibly.<br>\nApplicants offering First + Last are preferred (possibly negotiable).<br>\nShort term, temporary stays of two months or more would also be considered.  <br>\nInterested? We hope to hear from you!\n    ",
        "image": "http://images.craigslist.org/00v0v_kTPQsAzEIUX_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4873325146.html"
    },
    {
        "title": "&#x25BA;---LONG TERM WEEKLY SHARED HOUSING---&#x263B;---HURRY---",
        "href": "/mlt/roo/4881058015.html",
        "time": "2015-02-07 00:32",
        "price": "$150",
        "neighborhood": " (SE PORTLAND)",
        "postBody": "\n        * SRO=SINGLE ROOM OCCUPANCY=1 PERSON<br>\n* FURNISHED ROOM<br>\n* SHARE KITCHEN<br>\n* EUROPEAN SHARED BATHROOM<br>\n<br>\n* ROOM PRICES $150+ UTILITIES<br>\n* FREE BASIC CABLE &amp; WIFI<br>\n* EASY BUS TO CITY CENTER<br>\n<br>\n* SMOKE FREE<br>\n* ALCOHOL &amp; DRUG FREE ZONE<br>\n* NO VISITORS/GUESTS<br>\n* NO ANIMALS<br>\n<br>\n<h2>SE PORTLAND &lt;&gt; \n <a href=\"/fb/pdx/roo/4881058015\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n&lt;&gt;</h2><br>\n<br>\nAll rooms subject to prior rental. Minimum stay required 5 weeks. We reserve the right to make changes without notice, and are not responsible for errors or omissions. All prices exclude city, county, state, and federal fees and taxes, screening fees, and deposits.<br>\n\n    ",
        "image": "http://images.craigslist.org/00b0b_8J3HHkYwqic_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881058015.html"
    },
    {
        "title": "&#x25BA;---LONG TERM WEEKLY SHARED HOUSING---&#x263B;---HURRY---",
        "href": "/mlt/roo/4881057743.html",
        "time": "2015-02-07 00:24",
        "price": "$150",
        "neighborhood": " (SE PORTLAND)",
        "postBody": "\n        * SRO=SINGLE ROOM OCCUPANCY=1 PERSON<br>\n* PRIVATE FURNISHED ROOM<br>\n* CREEK SIDE, OAK TREES, WETLAND HABITAT HOUSE<br>\n* SHARE KITCHEN, EUROPEAN SHARED BATHROOM<br>\n<br>\n* OUR BEST ROOM $150 + UTILITIES<br>\n* FREE BASIC CABLE &amp; WIFI<br>\n* EASY BUS TO CITY CENTER #31, #32, #33, #70<br>\n<br>\n* SMOKE FREE<br>\n* ALCOHOL &amp; DRUG FREE ZONE<br>\n* NO VISITORS/GUESTS<br>\n* NO ANIMALS<br>\n<br>\n<h2>SE PORTLAND &lt;&gt; \n <a href=\"/fb/pdx/roo/4881057743\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n&lt;&gt;</h2><br>\n<br>\nAll rooms subject to prior rental. Minimum stay required 5 weeks. We reserve the right to make changes without notice, and are not responsible for errors or omissions. All prices exclude city, county, state, and federal fees and taxes, screening fees, and deposits.<br>\n\n    ",
        "image": "http://images.craigslist.org/00V0V_j2WMNDz55iq_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881057743.html"
    },
    {
        "title": "**2 Rooms; 1 Available Now, Other 1 Soon!",
        "href": "/mlt/roo/4881037384.html",
        "time": "2015-02-06 23:15",
        "price": "$600",
        "neighborhood": " (inner ne portland, Concordia, Alberta)",
        "postBody": "\n        Hello!<br>\n$600.00 Per Room as Single Occupancy<br>\nThis is a cozy house of 3 private bedrooms and one is now available; another coming available the 27th. You would be sharing common areas with independent others that are busy, clean, respectful of individual preferences, quiet after 10 or so, &amp; responsible, non-red meat eaters. If you are similarly described, &amp; would enjoy a tidy home to recharge in, are full-time employed or are student outside the home, please read on! <br>\nThe &quot;available now&quot; private room has a walk-in closet with full length mirror &amp; a hardwood floor, and the one available on the 27th comes with a built-in bookcase, and each room can be either furnished with basics, or unfurnished, or with just a large, never-used area rug and/or another bookcase or small desk. The common areas, excepting the tiled bath, are all hardwood. The bath is shared with 1 other (clean guy now, occupying the other main floor room down the hall who is leaving to be closer to his girlfriend by the 26th), with the lower occupied level having the shared washer and dryer and has its own bath. Kitchen has dishwasher (best if used to keep sink &amp; counters clean/available),  &amp; has lots of windows! Recycling is happening here, too.<br>\nThe pics show unfurnished common areas, but the dining area is furnished now and more items are coming into the living room, completing it. There is a wood stove and a nice, covered front porch also. There is no storage available here, but a storage facility is within a couple miles of the house.<br>\nPaid Utilities included in the monthly Rent are: Water, Sewer, Garbage, &amp; Recycling-- <br>\nSplit Utilities are internet, electric &amp; gas between housemates &amp; Due Monthly - per person are running about $70.00 when there are 3 :). You can get cable in your room if desired as the line is there.<br>\nHouse is in an established residential neighborhood, so parking is on street (free), directly in front of the house, and the bus is in 4 blocks. Concordia U. is approx. 1 mile, A huge park is within less than 3 minutes&apos; walk, with Kennedy McMenamin&apos;s about a 5 min. walk. The house is close enough to it for free soaking pool privileges there! It&apos;s a less than 10 minute walk to New Season&apos;s, and about 12 blocks to the activities in Alberta Arts, &amp; approx. 2.5 miles to PCC Cascade.<br>\nCooking without red meat is the fare here- fish, dairy, eggs, and all vegies are the predominant preferred foods, &amp; respecting of those needing special requirements met, i.e. low sugar or gluten-free diets-Fresh is great, organic is best!<br>\nA first priority area for keeping common areas clean &amp; tidy is a clean kitchen. The dishwasher is regularly used, and when hand-washed dishes are dry, they do get put away... Low/no clutter is the usual state of the common areas. Being responsible for cleaning up after cooking, eating, &amp; in general is (naturally) expected. <br>\n<br>\nThe usual No&apos;s are here: <br>\nNo smoking, or vaping, or drugs or multiple daily alcoholic bevs (entire Property, including guests). <br>\nNo more Pets. A small Bichon lives here (so please like small dogs--perhaps you grew up with a family dog?)<br>\nOther No&apos;s: No guest stays averaging an extended period for this room. 1 or 2 overnights per week are OK, as this room is Single Occupancy at this rate. Busy couples as full-time occupants of this room would pay additional rent &amp; deposit. Sorry, but no kids as full-time occupants would be a good fit here. <br>\nAnd since this is a cozy home, we are respectful of quiet required for study, reading, etc. after 10-ish pm; no TV in common areas is here.. an occasional dinner gathering is great!<br>\nA &quot;regular&quot; daytime schedule would also be a best fit. A blender on high before 6:00 a.m. would not be such a great alarm clock :( ... <br>\nThis room is a month to month rental, with first month&apos;s rent of $600.00 and a non-refundable $120.00 cleaning fee, and a refundable $280.00 security/damage deposit are all due upon move-in. 2nd month is pro-rated to day of move-in. A $15.00 background check fee, and verifiable income is needed, too, upon application. References from prior shared housing/landlords are welcome!<br>\nLooking forward to hearing from you! Thanks for reading :)\n    ",
        "image": "http://images.craigslist.org/00404_3DbQA06BMBk_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881037384.html"
    },
    {
        "title": "Type A 21yo F seeking roommate replacement",
        "href": "/mlt/roo/4876961251.html",
        "time": "2015-02-06 23:01",
        "price": "$480",
        "neighborhood": " (John&apos;s Landing)",
        "postBody": "\n        Am currently sharing a 2 bedroom in Burlingame/John&apos;s Landing off SW Barbur, and looking to renew lease (exp. 3/31) with a new roommate.<br>\n<br>\nAbout me:<br>\n&#x2022;\tScience major at PSU<br>\n&#x2022;\tLove photography/knitting/sewing/reading/music<br>\n&#x2022;\tChronic case of the travel bug<br>\n&#x2022;\tLGBTQ friendly<br>\n&#x2022;\tEnjoy cooking (especially baking)<br>\n<br>\nYou:<br>\n&#x2022;\tSteady employment, able to make timely payments<br>\n&#x2022;\t20-something, preferably female<br>\n&#x2022;\tTidy (no dishes overnight!! Please put things away when not in use!!)<br>\n&#x2022;\tNo drugs or smoking, please (casual drinking is okay)<br>\n&#x2022;\tWhoever you are!!<br>\n<br>\nThe apartment:<br>\n&#x2022;\tTwo bed, one bath<br>\n&#x2022;\tNo pets allowed<br>\n&#x2022;\tPatio, breakfast bar, dishwasher<br>\n&#x2022;\tRent: $960/month (includes everything except power), split evenly<br>\n&#x2022;\tLaundry facilities, swimming pool, sauna on site<br>\n<br>\nIf this all sounds great to you, drop me an email and let&apos;s meet and chat!!<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4876961251.html"
    },
    {
        "title": "Room offered, 4 other roommates, Mt. Scott/Woodstock",
        "href": "/mlt/roo/4881021453.html",
        "time": "2015-02-06 22:53",
        "price": "$400",
        "neighborhood": " (SE 65th and Ramona)",
        "postBody": "\n        Hi there,<br>\nWe have a room available now or March and are looking for the right person to fill it.<br>\n<br>\nThere are 4 of us:<br>\nMale, 28:  IT professional.  Enjoys hiking, tinkering, making gadgets, just made a mini foundry to melt and mold aluminum.  Wants to make a project with you.<br>\nFemale, a mature 19:  Artist from Russia and more recently Alaska attending PSU.  Enjoys cooking, mushroom hunting and crafting.<br>\nMale, 25:  Bike enthusiast and delivery person.  Has a bike shop in the garage.  Enjoys facts.<br>\nFemale, 29:  Electrical engineering technician and engineering student.  Enjoys hiking, biking, travel, gardening, most things...<br>\nTwo of us are getting married in June and are expecting many guests at the house for the couple weeks surrounding the wedding.  The other two of us are single.  We have 2 indoor cats and 3 outdoor chickens.  One of the cats hates all other animals.  We are open to meeting many types of animals, fixed cats and small fixed dogs, but the chances are not so great for animals that don&apos;t get along with our inhospitable cat.  <br>\n<br>\nThe room available is a reasonably sized 1st floor bedroom with north facing window and good sized closet near the bathroom and linen closet.  We have two full-size bathrooms, but the four of us that live upstairs basically share the one bathroom that is upstairs while the person that lives in the basement uses the lower floor one.  Most of us wake up at 7 am, but there isn&apos;t much bottle-necking there amazingly.  <br>\n<br>\nThe house is between 65th and 67th on SE Ramona St.<br>\nRent is $300 plus utilities/month, which makes the cost about $400 during the winter.  <br>\n<br>\nWe have a small garden that is asleep right now, laundry, dishwasher, movie room with a projector, fireplace, small kitchen, dining area, bike shop, limited woodworking shop, ping pong table, limited darkroom....  Mt Scott Community Center with gym, pool, tennis courts and park are a short walk down the street.  There is a Safeway, Portland Fish Market, Grand Central Bakery, Cloud City Ice Cream, Laughing Planet, Thai food, hardware store, etc in Woodstock a short bike ride away and a Fred Meyer, Asian grocery, Russian grocery, fruit market a short bike ride in the opposite direction.  Space Monkey coffee is around the corner by Mt Scott Park.  We are close to the 19, 17 and 14 bus lines.  There is street parking or we could finagle parking off the alley in the back of the house if absolutely needed.<br>\n<br>\nThere is no smoking allowed on the property because 2 of us are successfully getting over long term habits of smoking. Half of us drink recreationally.  We have an occasional bbq when weather is pleasant.<br>\n<br>\nWe are not super clean, but we try to pick up after ourselves keep messes confined to our own rooms.  The kitchen and laundry room are the most likely to slip.  We silently share chores like garbage/recycling, sweeping, mopping, bathrooms and yard work.  We would expect anyone living here to do their share.  We usually have several half-finished projects going on at once.  A very strictly organized and clean person would not be super happy in our house. <br>\n<br>\nThere are stairs on all sides of the house so it is not disability friendly, but we might fix that for the right person.\n    ",
        "image": "http://images.craigslist.org/00T0T_id8uEwlPNGd_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881021453.html"
    },
    {
        "title": "large room for rent in radical p.o.c. house",
        "href": "/mlt/roo/4881024183.html",
        "time": "2015-02-06 22:52",
        "price": "$530",
        "neighborhood": " (NE Portland)",
        "postBody": "\n        the house is currently composed of 3 &#x24B6;dults (32,28,28), 1 kid (7), 1 dog, and 1 cat. we&apos;re radical, respectful, and reasonable people. we&apos;re all pretty busy through out the week with work and school stuff. we share one kitchen and one bathroom and a couple of garden beds in the backyard. bills are divided evenly between all roommates. <br>\n<br>\nplease email with any questions if interested.<br>\nthanks.<br>\n\n    ",
        "image": "http://images.craigslist.org/00Z0Z_5ArlfAm9VOh_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881024183.html"
    },
    {
        "title": "Room available at University Pointe next month (female only)",
        "href": "/mlt/roo/4881025520.html",
        "time": "2015-02-06 22:52",
        "price": "$654",
        "neighborhood": " (Downtown Portland)",
        "postBody": "\n        Need a temporary lease? Well, there&apos;s about 6 months left on my lease at University Pointe. I live in a 4bed/2bath, furnished apartment and rent is $654/month which includes utilities. It&apos;s an all girls unit and could be perfect for you if you&apos;re coming in for the spring term and want to check out the area for a while. You can always re-sign the lease if that interests you for Fall 2015-2016.  <br>\n<br>\nThe apartment is usually quiet as everyone is busy with school, work or volunteering during the weekdays. The roommates are easy, outgoing, and respectful of your space. Sometimes they just like to hang out and chill in the living room. Plus, I must add that the view is unbeatable!<br>\n<br>\nThe move in date is March 15th. Let me know if you are interested and I would be happy to provide you with more details via email or text!<br>\n\n    ",
        "image": "http://images.craigslist.org/00N0N_jRtChOqYD6m_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881025520.html"
    },
    {
        "title": "Temporary Room For Rent - Furnished",
        "href": "/mlt/roo/4876486228.html",
        "time": "2015-02-06 22:46",
        "price": null,
        "neighborhood": " (Cully)",
        "postBody": "\n        Furnished room for rent on temporary basis. Weekly and monthly rental of one bedroom in two bedroom one bathroom home with large backyard, updated kitchen, wifi, fireplace, washer and dryer. There is no television or cable in this home. $175 per week and $700 per month, all inclusive of utilties. No pets, no couples. Preference for single women, like myself. There is an outdoor/indoor cat in the home that comes and goes as he pleases. Looking for someone with regular sleeping hours as I work Monday through Friday 8am to 6pm and need peaceful hours between 11pm and 7am. Please email for more information and include some details about yourself, the length of stay you are looking for and where you are living now.\n    ",
        "image": "http://images.craigslist.org/00R0R_d5MhH4oP2W_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4876486228.html"
    },
    {
        "title": "Giant Room for Rent In Beautiful Old-World Home",
        "href": "/mlt/roo/4881001264.html",
        "time": "2015-02-06 21:54",
        "price": "$700",
        "neighborhood": " (NE Portland, North Tabor Neighborhood)",
        "postBody": "\n        Hello Portland,<br>\n<br>\nWe are looking for an individual or a couple to join us in our old-world styled home.  The room is available now, but we&apos;re not in a hurry to fill it.  We&apos;ll hold the space for a good fit.<br>\n<br>\nIt&apos;s located in Northeast Portland a little west of the Montavilla neighborhood and slightly south of Mt. Tabor.  We&apos;re near the Seven Virtues Caf&#xE9;, The A.N.D. Caf&#xE9;, The Tannery, The Tabor Tavern, Portland Yoga Arts, A Fred Meyer, and a QFC.  Just up the way is The Academy Theatre and all that good stuff. <br>\n<br>\nThe house is a wooded wonder.  Our space has 3 bedrooms and 1 bathroom.  It&apos;s quite spacious (the room for rent is approximately 22&apos; by 14&apos;), with hardwood floors throughout.  The kitchen has quality carpentry, marble/wood counters, updated stainless-steel appliances, and a warm red linoleum floor.  The living room has a gas fireplace, a decent speaker/record player set-up, and a healthy amount of foliage.  We have double pained windows that keep the heat in and the cold out. There is a 2-tiered balcony, which overlooks an unfenced yard we aptly refer to as &apos;the forest&apos;.  We have a couple of garden beds that are empty as of the writing of this add.  As well as an untested irrigation system connected to each.  Put simply: it&apos;s a nice home.<br>\n<br>\nUs:<br>\n<br>\nA man in his late twenties.  A woman in her mid-twenties.  A sweet baby puppy dog who just turned one!<br>\n<br>\nAll of us are more than the sum of our parts, not bound by nutshells and are kings and queens of infinite space. <br>\n<br>\nWe are raw feelers.  Deep thinkers.  Wild believers. Each of us is an artist in our own right. We are trying to own all of ourselves even our contradictions.  We read Hindu and Buddhist texts, and we watch Netflix.  We practice many types of yoga, and we own a PS4. We love Leo Tolstoy, Jack Gilbert, Milan Kundera, Daniel Quinn, Aldous Huxley, and we think Star Trek Deep Space Nine is a masterpiece. <br>\n<br>\nIn the kingdom of homogeneity we are your monsters.<br>\n<br>\nWe are a couple of yogic, rock collecting, meditating, star children. . .with a dog named after a character from star trek.<br>\n<br>\nIf you&apos;re still reading, we&apos;re thrilled!  We want you to know that this is a come as you are space, but we are looking for a functional community vibe.  We don&apos;t need to share food or have dinners together. We don&apos;t care if your diet matches ours.  You don&apos;t have to like the things we like. We are unconcerned about your gender(s).  We do need you to be respectful and clean.  Perhaps even exceptionally clean, as the house feels nice when it is well cared for and we feel that taking care of one&apos;s home is both rewarding and necessary.  <br>\nWe like to talk with each other about our thoughts and feelings.  As clear, thoughtful communication is already a feat unto itself, it would be nice to live with another person who isn&apos;t hiding from the way they feel or too passive to let it be known to others.  <br>\n<br>\nThe Nitty-Gritty: <br>\n<br>\nWe pay for gas, electricity, and Wi-Fi; the owner, who is attentive to our needs, covers all other utilities.  This includes yard maintenance.   The rent for the space is going to be $700 for an individual and perhaps slightly more for a couple, but only ever so slightly (maybe $750, maybe $800).  Dogs are welcome.  Your room has French doors that lead out to the balcony, thought you would like to know.<br>\n<br>\nPlease email us about yourself.  Be thorough.  Indicate you read the add in its entirety.  <br>\n<br>\nBe well.<br>\n\n    ",
        "image": "http://images.craigslist.org/00U0U_iz9OCzK5bKR_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4881001264.html"
    },
    {
        "title": "The &apos;Garden Room&apos; in Beautiful House",
        "href": "/mlt/roo/4880991096.html",
        "time": "2015-02-06 21:48",
        "price": "$595",
        "neighborhood": " (GardenHome/MultnomahVillage (close-in SW)",
        "postBody": "\n        2 different Rooms for Rent.<br>\n<br>\nWhat&apos;s here . . .?<br>\nAn artist&apos;s residence. &apos;Treehouse&apos;, nestled in hilly woods on small creek, pond. A true Sanctuary. <br>\nActive with wildlife - raccoon, squirrel, frogs, birds, sometimes coyote, owl.<br>\nPrivate, peaceful. Doesn&apos;t feel like you&apos;re in the city. Space to garden. <br>\n<br>\nClose-in SW Portland - Multnomah Village / Garden Home, just 12 minutes from either downtown, Beaverton or Tigard. Directly on #45 bus route.<br>\n<br>\nBeautiful, newer, larger (3200sqft) house. Three Bathrooms, Hardwood, Marble, carpeted floors, fine cabinetry, Woodstove. Additional decks, patios.<br>\nLarge, full-feature kitchen, dishwasher.   Ample refrigerator, and kitchen storage space.<br>\nFine with &amp; respect each other&apos;s eating prefs.<br>\n<br>\n<br>\n<br>\nOne available room - the &apos;Garden Room&apos;:<br>\n<br>\n12x9. Separate entrance, walk thru garden to arrive. Your own personal deck - partially covered, with bench. 3 windows look into tree/garden scene. Beautiful maple hardwood floor with walnut trim (area carpet option). Built-in cherry bookcases. Also built-in to the wall: 6 drawers for clothes or files. Closet has built-in shelving as well. Sweet space. All that&apos;s really needed in this room is a bed (which I can provide Queen or Full) - with the built-in&apos;s the room is essentially self-furnished. The built-ins, the windows and doors take up most of the wall space. Besides a bed, there&apos;s only room for a small desk and perhaps one or two other small furnishings.<br>\nThis room shares a Bathroom.<br>\nGARDEN room is shown in the PHOTOS.<br>\n<br>\nThe &apos;Garden Room&apos; is available starting Either March 1st, March 15th, or April 1st.<br>\n<br>\n$595 plus utilities ($595 rent +$85 for utilities)<br>\n<br>\nOPTION:  <br>\nBed (Queen or Full size or Futon) can be furnished @ +$10/mo<br>\nBed options may depend on availability.<br>\n<br>\n<br>\n<br>\nSecond available room - the &apos;Pond Room&apos;:<br>\n<br>\nBig - roughly 15x24 (368 sqft).  High ceiling (9&apos;), spacious.  Low-pile carpet.  Separate entrance onto pond/waterfall.<br>\nI can supply some, most, all, or none of furnishings.  Currently unfurnished.  Suitable for personal and/or office use.  <br>\nThis room is part of, but also quasi-separate from the rest of the house.<br>\nIt could be a &apos;blank canvas&apos; waiting for an artist to re-create into their own zone, or<br>\nis well-suited for someone who needs to focus on what they&apos;re doing.<br>\nThis room shares a Bathroom.<br>\nNOT shown in Photos in this ad.  See separate ad for &apos;Pond Room&apos; for photos.<br>\n<br>\n$695 plus utilities ($695 rent +$85 for utilities)<br>\n<br>\nThe Pond Room is available starting April 1st.<br>\n<br>\nPlease cue me up front whether u prefer fully furnished or not.  Thx.  Can also be partially furnished.  Modestly extra to furnish - depends on what&apos;s requested.<br>\nFurnishings that are available in the space:<br>\nSmall computer/work table.  <br>\nOption of stylish height-adjusted work-tables.<br>\nBed (Queen or Full size or Futon) can be furnished @ +$10/mo<br>\n\tBed options may depend on availability.<br>\n2 - quality shelving sets, differing styles.<br>\nDesk Chair<br>\n<br>\nIt&apos;s an adaptable space.  It can be a purely lived in space, a lived-in office, an art studio, or a standalone office.<br>\nAt different times it has been all these.<br>\n<br>\nSmall, Quiet, Non-damaging pet would be considered ONLY for the POND Room  (in room or outside - not rest of house) \t\t\t@ +$25 for rent, and +$500 pet security deposit.<br>\n<br>\nQuiet, safe neighborhood.<br>\nWithin 1 mile are two large parks - one wild-wooded, the other is Gabriel Park.<br>\nAlso 1 mile for shopping, grocery, restaurants, 3 community centers - one with pool, fitness.<br>\nPrecisely midpoint between I-5, Hwy 26 and Hwy 217. 2.5 mi from Washington Square.<br>\nNear to Lewis and Clark College, OHSU, PCC Sylvania.<br>\n12 min drive from PSU or Naturopathic College.<br>\n<br>\nI&apos;m here a lot, gone a lot - operating a modest wedding/portrait photography business from home.<br>\n<br>\nLooking for: clean, honest, financially sound and responsible, healthy, excellent communication,<br>\nlight/warm-hearted, ability to cooperate in and enjoy shared space, positive, tending towards quieter, non-television watching, non-gaming (of the loud sort), mature. <br>\nWe respect each other&apos;s space. Our practice is to check in with each other to see if it&apos;s a good time to chat.<br>\nWe&apos;re also warmly amicable and genuinely happy to see and greet each other. Harmonious sums it up.<br>\nIf you&apos;d like a gentle sense of &apos;community-lite&apos; in a beautiful place,<br>\nor if you&apos;ve been feeling some isolation being solo in your current place - this could be a good fit.<br>\nLooking for someone who truly understands how to respect, care for, and keep clean fine things (this house).<br>\nPrefer people who love life and their pursuits; <br>\nand for whom it&apos;s natural to recycle, compost, conserve electricity, heat, hot-water usage. <br>\nSerious students, professionals, creatives, spiritual folk, someone who needs to focus, would do well here.<br>\n<br>\nMe? Aside from being a photographer, gardener, I&apos;m active/healthy - run, swim, ski, climb a rock, dance, spiritual streak. <br>\nIf you&apos;re inclined you can get more of a vibe: www.peterpaulrubens.com<br>\n<br>\nThis is a very organized house.  Clean is important - this is what we mean by clean:<br>\n- Whenever any of us use the kitchen, we clean it up 100%, immediately after using - not &apos;mostly&apos; clean, not clean it &apos;later&apos;, not crumbs, splats, utensils left.<br>\n- Whomever handwashes dishes and leaves them to dry in the dishrack, they&apos;re conscientious to put those dishes away within 24hrs.<br>\n- When using the laundry machines, we empty them within 2-3hrs so they&apos;re ready for the next person.<br>\n- Any shoes that were worn outside, are not worn inside the house - due to hardwood floors and carpets.<br>\n- We each have a household chore that takes 25min every 2 wks. It&apos;s much more peaceful that we can really, truly count on each of us to do  our part, before it&apos;s due, no reminders needed. <br>\nBasically our philosophy is that when the next person arrives in a space that it&apos;s beautiful for them and fully ready to use.<br>\n<br>\nAs one new housemate said:<br>\n&quot;These rules are how I would like other people to do things yet I have rarely enjoyed them doing so, so I am very excited about living in a house that will actually be clean!&quot;<br>\nIf you relate with the above, you&apos;ll thrive here.<br>\nWe&apos;re definitely not &apos;perfect&apos; - nobody is - but we keep these agreements to a very high degree: &gt;95% of the time.<br>\n<br>\nIncl in the $85 utilities is HighSpeed WiFi, Washer/dryer, Filtered drinking water, Electric, Gas heat/cooking, (premised on utility use being modest/conserving). <br>\n<br>\nGARDEN ROOM:  1st month&apos;s rent (595+85util) to move in with $1000 refundable security deposit = $1680 (Total $ to move in)<br>\nPOND ROOM:  1st month&apos;s rent (695+85util) to move in with $1000 refundable security deposit = $1780 (Total $ to move in)<br>\nFirst two months are a trial, then Six month lease. <br>\n<br>\nIt is very important that you have:<br>\nSolid References.<br>\nSolid Income.<br>\nNo smoking. No drugs.<br>\nAdult only.<br>\nAfter interview, then fill out an application with ($35) background check <br>\n<br>\nIt&apos;s a great place. We&apos;re looking for a great housemate. Could be you or someone you know.<br>\nCall Peter @ \n <a href=\"/fb/pdx/roo/4880991096\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n or Em reply to this ad.<br>\nIf you don&apos;t reach me please leave the best times to call you.<br>\n<br>\nIt&apos;s an all-around wonderful enough place that at different times, 4 former housemates have either returned to stay a second time.<br>\n<br>\nThis is a quote/feedback from a housemate candidate:<br>\n<br>\n&quot;Your sanctuary is truly a rare find. There were no things that jumped out in a jangly way for me when I visited - it was a sweet mix of refined and energetic, and I think your ad conveys the flavor as well as words can describe such a rich setting. You could add a bit more to express the cozy spaciousness of things and the richly layered and textured property and dwelling - the multiple floors and easy flow of the space and the exquisite craftsmanship. The price seems reasonable to me too...&quot;<br>\n<br>\nAnother:<br>\n&quot;We looked at your house and saw that it&apos;s absolutely beautiful and perfect. Thank you for posting your home. Whomever you choose for your roommate(s), I&apos;d consider them blessed.&quot;<br>\n<br>\n<br>\nThanks for taking your time to read<br>\nI do my best to respond to all legitimate inquiries ~ Peter\n    ",
        "image": "http://images.craigslist.org/01313_7ZkuvzMklDl_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880991096.html"
    },
    {
        "title": "Lewis &amp; Clark students/others for home close to campus!",
        "href": "/mlt/roo/4840145009.html",
        "time": "2015-02-06 21:38",
        "price": "$650",
        "neighborhood": " (SW Portland)",
        "postBody": "\n        Newly remodeled, up-scale home in terrific, professional neighborhood with two bedrooms available! I live downstairs in a separate apartment. I would like to share my upstairs home with serious, honest, thoughtful, quiet types. No smokers or those who use any drugs, please! This house is not &quot;420 friendly.&quot; The individuals must be neat, tidy, responsible, respectful, organized, able and willing to pay rent on time every month, and have no pets. Candles are not permitted.<br>\n<br>\nThe monthly rent is $650.00 for the smaller furnished room and $750.00 for the larger furnished room; the bathroom is shared between the two. Both rooms are available now. Each room is for single occupancy. A lease for January through June 2015 is required; if your academic program is less than one year we can discuss this. Certainly if you would like to lease for longer than six months, this is possible and encouraged.<br>\n<br>\nHousing includes a washer and a dryer near the bedrooms, use of the kitchen with dishwasher, gas-powered kitchen stove, basic kitchen dishes and cooking items, and lots of peace and quiet. I prefer somebody who is interested in recycling and energy conservation. There is Comcast WIFI. <br>\n<br>\nThis is an excellent residence for a serious, responsible student or somebody who prefers peace and quiet; it is not suitable for a &quot;partier&quot; or somebody who is loud and noisy. It&apos;s perfect for someone interested in starting a vegetable garden in the back yard or a container garden on the deck; we might be able to set up a green house? The yard care is handled by a professional landscaping company. Please email with any questions and to schedule an appointment for viewing.<br>\n<br>\nSpecifics on LOCATION:  The house is .2 mile to Lewis &amp; Clark College. PSU is 20 downhill minutes away by bicycle. OHSU and VAMC are an easy drive down Terwilliger Blvd.. <br>\n<br>\nPlease email and tell me about yourself and then email again for an appointment. The home is available for viewing now. Thank you!\n    ",
        "image": "http://images.craigslist.org/00y0y_3JbG9E2g31v_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4840145009.html"
    },
    {
        "title": "Room available in Woodstock house",
        "href": "/mlt/roo/4880988711.html",
        "time": "2015-02-06 21:31",
        "price": "$575",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        I am seeking a housemate, preferably female, to share my cute SE Portland house with me. The 13 x 13 bedroom with carpeting, a big closet, and a nice window will be available March 1 for $575/mo, including wifi and other utilities. <br>\n<br>\nThe house has hardwood floors, two bathrooms and three bedrooms (one is my office), good heating plus a toasty woodstove, gas range, washer/dryer, basement with plenty of storage space, large vegetable garden and fruit trees. Enjoy hanging out in the backyard or on the front porch, and eating fresh veggies and fruits from the garden. Walking or biking distance to shops on Woodstock, Foster and Reed College, and there&apos;s a busline close by. I bike to work downtown from here. <br>\n<br>\nI&apos;m a 40-yr old woman, and I&apos;m taking classes at PSU in addition to working for an environmental organization, which means most of my free time is spent studying. I&apos;m looking for someone who&apos;s a good fit with my fairly liberal, quiet and friendly household -- you&apos;re easy going and you do your part. I have one cute cat who fights with neighbor cats; I would consider a pet if it was a good fit. <br>\n<br>\nIf you&apos;re interested, please send me a message telling me a little about yourself. <br>\n\n    ",
        "image": "http://images.craigslist.org/00V0V_85foLRckkUT_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880988711.html"
    },
    {
        "title": "Nice Room Weekly Rental.",
        "href": "/mlt/roo/4880971108.html",
        "time": "2015-02-06 21:27",
        "price": "$129",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Greetings,<br>\n<br>\n<br>\nAVAILIBLE NOW!!!!! DON&apos;T WAIT.........<br>\n<br>\n<br>\nSalutations, to all my fellow C.Ler&apos;s..<br>\n<br>\nI&apos;m offering, not much, but then again something is ALWAYS better than the opposite...<br>\n<br>\nHaving now indicating such, I have an &quot;Platform Bed&quot; &amp; HDTV surf, to offer 1 person... 2 people would be 159.00 weekly....<br>\n<br>\nSo if you&apos;re seeking something for a brief period of time, this should be of interest to you or yours...<br>\n<br>\nI can NOT have smoking on premises in NO WAY, shape or form... Tobacco or 420 for that matter.<br>\n<br>\nIt comes with WI FI as well... Oh Yeah, across the street from the MAX.<br>\n<br>\nThis is your own room, NOT Couchsurfing...<br>\n<br>\nP.S.<br>\n<br>\nSeeing to whereas this is only a &quot;Short Term&quot; rental I do NOT provide a key to my place.<br>\n<br>\nMUST be able to Furnish copy of I.D. for my security.....<br>\n<br>\nIf you have an issue w/that please DO NOT respond.<br>\n\n    ",
        "image": "http://images.craigslist.org/00z0z_KyaoOgmx6v_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880971108.html"
    },
    {
        "title": "House share / Roommate Needed",
        "href": "/mlt/roo/4880962192.html",
        "time": "2015-02-06 20:48",
        "price": "$600",
        "neighborhood": " (Portland Hwy 30)",
        "postBody": "\n        My wife and I are looking for a roommate to move in and finish our lease till June with us. Our current roommate is moving in the next week and you can move in anytime after. We live on Hwy 30 a few miles from downtown Portland, a mile or so from the St. Johns bridge. 5 mins to downtown, 2 mins to St. John&apos;s, and close to Beaverton and southeast/northeast too. House backs to Forest Park and has a trail up a creek right from our backyard. Many miles of hiking and biking trails right out your back door. We already have a cat and two kittens so at this point I&apos;m not really into having any more animals. We are super chill people who like our home to be a sanctuary. Having said that we&apos;re people who don&apos;t have many people over and would hope you are the same for the most part (its not a &quot;party house&quot; or &quot;chill zone&quot; for all your friends). We are super easy going though and OMMP is Ok, in fact we smoke herb in the house regularly so if that bothers you this may not be a good fit for you. Our room has a small sitting area in it and is upstairs so you basically get the run of the entire first floor since we often hang &amp; watch movies upstairs. Also there is a one car garage for storage of stuff or a bike/motorcycle. <br>\n<br>\n<br>\nTo recap rent and move in is the following:<br>\n Single Person Room+Bills - $500+$100=$600 total<br>\n  1st, Last and $300 deposit $1500 total move in (deposit not refunded if you move before June or cause any damage)\n    ",
        "image": "http://images.craigslist.org/01111_aTg40JcxDIn_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880962192.html"
    },
    {
        "title": "Looking for a new roommate",
        "href": "/mlt/roo/4880957465.html",
        "time": "2015-02-06 20:41",
        "price": "$825",
        "neighborhood": " (Downtown Portland)",
        "postBody": "\n        Hey there! I am looking for a roommate to take over my roommates portion of the lease.. The lease is until September and is 825 a month and we will split utilities.. The apt is in a great location downtown and walking distance to the waterfront, pioneer square and much more! We also have a great pool and gym on site as well as laundry room.. I am a 28yo female, RN.. Looking for a 20-30somethings professional.. I don&apos;t want a party house but going to a HH or having the occasional gathering is cool:-) look forward to hearing from you.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880957465.html"
    },
    {
        "title": "Very private apt with view of Mt St.Helens available February 22nd",
        "href": "/mlt/roo/4880954639.html",
        "time": "2015-02-06 20:37",
        "price": "$800",
        "neighborhood": " (ne pdx)",
        "postBody": "\n        Very private apt with view of Mt St.Helens available February 22nd<br>\n<br>\nRent 800 includes all utilities and wifi/cable.   One low mthly payment does it all!!!<br>\n<br>\nThis apartment is in the lower daylight level of our NE home, but fully private and self-contained.<br>\n<br>\n<br>\nThis unit is smoke free. <br>\n<br>\nAmenities include: <br>\nPrivate entrance <br>\n650 sq. ft of living space <br>\nSeparate yard area <br>\nView of Mt. St. Helens <br>\nUpdated flooring, carpet and paint <br>\nPlenty of closet and storage space <br>\nPrivate updated bath <br>\nKitchenette<br>\nLaundry facility <br>\nLarge bedroom with huge closet<br>\n<br>\nRent 800 includes:<br>\nAll utilities (water, gas, garbage, electric) wifi and cable. <br>\n<br>\nLow move-in cost: First months  prorated rent and $500 security deposit/cleaning fee<br>\n<br>\ncall for more info and/or showing \n <a href=\"/fb/pdx/roo/4880954639\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\nor \n <a href=\"/fb/pdx/roo/4880954639\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n <br>\n<br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00J0J_iIFHcCE1qjS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880954639.html"
    },
    {
        "title": "Overlook room available March 1st",
        "href": "/mlt/roo/4880946370.html",
        "time": "2015-02-06 20:35",
        "price": "$600",
        "neighborhood": " (north portland)",
        "postBody": "\n        Hey there!<br>\n<br>\nWe are 2 females and 1 male (ages 26-35) in need of a fourth roommate, starting March 1st. One works at Whole Foods, another is a sales rep for supplements and body care products, and the other works for a law firm. <br>\n<br>\nWhat you get: a nice sized carpeted basement room with 2 windows (one large south-facing) for $600 a month + bills. Upstairs has hardwoods, fireplace, and an updated kitchen. Shared downstairs bathroom (w/one female). Easy access to the yellow MAX line. Sorry, we&apos;ve got two cats, and can&apos;t take any more. Also, there&apos;s a hot tub. <br>\n<br>\nThese pictures are old - from before any of us lived here - but you get a rough idea of the layout of the house. <br>\n<br>\nNo hard drugs. Smoking outside. <br>\n<br>\nSend an email and tell us a bit about yourself and we&apos;ll get back to you if it seems like a good fit. <br>\n<br>\nThanks!\n    ",
        "image": "http://images.craigslist.org/00b0b_cGMFLbz4gZ8_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880946370.html"
    },
    {
        "title": "1/2 House 650$",
        "href": "/mlt/roo/4880940091.html",
        "time": "2015-02-06 20:25",
        "price": "$650",
        "neighborhood": " (Inner SE)",
        "postBody": "\n        Looking for 1 possibly two to share house with one other. 650 + ~125 utilities / month or more if 2. Open Feb 8 or 15th at latest.<br>\n<br>\nHere are the basic and if you&apos;re interested we can share interests to see if we&apos;d be a good match:<br>\nPrivate Spaces:<br>\nTwo bedrooms in basement with windows - about &#x2154; underground<br>\nLarge open area between the two bedrooms that could be used for a TV room, Rec room, Den, or ...<br>\nFull bath with window<br>\n<br>\nCommon Spaces:<br>\nFoyer / Bike Room<br>\nLiving Room<br>\nDining Room<br>\nKitchen<br>\n&#xBD; Bath<br>\nNook<br>\nCovered Front Porch<br>\nBack Porch<br>\nDriveway<br>\nFront and Back Lawn<br>\nFirepit<br>\nGarden Beds<br>\nLaundry<br>\nCraft Area (TBD)\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880940091.html"
    },
    {
        "title": "Quiet room between Hawthorne and Division",
        "href": "/mlt/roo/4880941863.html",
        "time": "2015-02-06 20:19",
        "price": "$800",
        "neighborhood": " (s.e. portland)",
        "postBody": "\n        the house:    Sunny bedroom available in a rustic Victorian farmhouse. The room is about 156 sq feet, with a medium sized walk-in closet.  Perks include wi-fi,  gas stove and dishwasher in the kitchen, clawfoot tub, washer and dryer in the basement, piano in the front room.  The house is fully furnished other than your room, but there is a generous storage area in the basement if you have extra stuff.  The back yard is quiet and private, with a small raised bed if you&apos;d like to plant veg.  Great location in S.E. between Division and Hawthorne- walk to Fred Meyer, Baghdad Theater, and a ton of great new restaurants and bars on Division.  Major bus lines are within a few blocks, 10 minutes to downtown.  Mt. Tabor and Laurelhurst parks are close by for jogging and picnics with a view.   <br>\n <br>\nmyself:    There will be only the two of us, no other roommates.  I&apos;m pretty quiet at home, usually tinkering on house projects and making art or reading.  I tend to get my excitement and socializing out in the world, and come home to work on projects and relax, so I&apos;d love to find someone who likes a quiet space in the evenings, like I do.  I like travel, food, film, books, and building stuff.<br>\n <br>\nyourself:    Relaxed, respectful and considerate, responsible, and don&apos;t need to bring the party home.  Very tidy in common areas (but of course you&apos;re welcome to be a mess just as much as you like in your room). You&apos;re happy to keep communication open about any concerns or plans that affect the common space- folks coming over, etc.  You&apos;re smart and have class. You&apos;ve got goals and dreams, and you pay your bills. <br>\n <br>\nThe room is $800 per month (month to month, no lease), plus half of the gas and electric bills.  No pets allowed, sorry.  If you dig the space, you&apos;ll need references, first and last month&apos;s rent, and a $50 cleaning deposit.  There will be a background check, but you don&apos;t need to pay for it.  <br>\n<br>\n\n    ",
        "image": "http://images.craigslist.org/00B0B_eKSQt1BBXX9_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880941863.html"
    },
    {
        "title": "Full of light, two blocks from Mt. Tabor",
        "href": "/mlt/roo/4877453399.html",
        "time": "2015-02-06 20:03",
        "price": "$600",
        "neighborhood": " (Mt. Tabor)",
        "postBody": "\n        Hello!<br>\n<br>\nI&apos;m looking for a rommate for my house near Mt. Tabor, available by March 1st at the earliest, but could postpone for the right person. <br>\n<br>\nAbout me:  <br>\n<br>\nIn general I&apos;m a positive and heart-centered person, and it&apos;s important for me to have a roommate who feels the same way! In the simplest terms, I care.  I also don&apos;t take myself too seriously - life is way too short for that.  I love to run, write and play music, and get outside as much as I can.  I&apos;m social, so I&apos;m out of the house semi-often, and like to have people over occassionally.<br>\n<br>\nI&apos;ve been living in Portland for about 7 years, and am originally from Ashland. My background is environmental science, and I spent 5 years working in that field, for Friends of Trees and The Nature Conservancy.  For the last two years I&apos;ve been spending more time working on my house, working part time at REI, and giving guitar lessons, while I plan my next move career-wise.  <br>\n<br>\nI cherish great communication - challenges always come up, and the only way to solve them is to talk!<br>\n<br>\nMy schedule varies, but at the moment I work at REI Sunday - Tuesday, and work on my house and give guitar lessons on the other days.<br>\n<br>\nAbout the house:<br>\nThe house is two blocks from the north entrance to Mt. Tabor, in a great neighborhood, quite, peaceful and good neighbors - I love living here!<br>\n<br>\nI bought the original house on this property three years ago, hoping to remodel.  As it turned out, it was built pretty poorly, all the way down to the framing. So this is a completely new house, with all the advanatages that go with it: great insulation, new appliances, open floor plan, etc.  Basically, things work :) <br>\n<br>\nThere are two bedrooms and a bath downstairs, and a bedroom and bathroom upstairs.  I am renting one of the downstairs rooms, which faces west, is full of windows, and has a good sized closet.  <br>\n<br>\nThe house has a lot of light, with windows everywhere, and an open floor plan.  The only downside to how open it is, is that sound travels pretty well in the house - so it&apos;s important to have a roommate that is conscientious of noise, whether it&apos;s music or company.  There isn&apos;t a TV in the common area. <br>\n<br>\nI&apos;ve been focused on getting the last projects of the house done, and I haven&apos;t yet put much energy into making the house feel warm - with more color, textures, etc.  But that&apos;s very important to me and is next on the list.  <br>\n<br>\nWhat I&apos;m looking for:<br>\nI&apos;m looking for a roommate that is lives from the heart, is open and communicative, and conscientious.  Having a sense of humor is big too!  I&apos;m not looking for a new best friend, but it&apos;s important to be able to have some level of friendship with my new roommate.<br>\n<br>\nI want a roommate who can tell me when they want something done differently in the house, or if there&apos;s something I&apos;m doing that doesn&apos;t work for them.  I believe strongly in people speaking for themselves, from the heart, with honestly, and that it leads to mutual respect and trust.  <br>\n<br>\nI like to keep common areas of the house pretty clean, as far as not having things left out, dishes washed, counters wiped,  floors swept. I&apos;m far from perfect, and wouldn&apos;t expect my roommate to be either.  But it&apos;s important to me to have a clean feeling house.  <br>\n<br>\nI&apos;m only looking for one roommate right now, and there&apos;s a small chance of another rommate sometime later.  If that was the case, I&apos;d definitely want your input on it.<br>\n<br>\nRecycling, composting, using ecologically-conscious shared products (toilet paper, etc) is important to me.   <br>\n<br>\n<br>\nOther stuff:<br>\n- at move in, it&apos;s the first month&apos;s rent, a deposit of the same amount ($600), and the cost of a background check.   When you move out, if everything&apos;s as it was when you moved in, you get your whole deposit back. <br>\n-month to month works for me, or we could discuss a lease <br>\n- utilities aren&apos;t included, and I can get you an estimate of that cost / month.  <br>\n-sorry, no couples<br>\n-no dogs, but a cat is possibile<br>\n<br>\nOk thanks for reading!  If you&apos;re interested please write back and tell me some about yourself: what you do for a living, where you&apos;re from, why you&apos;re moving, what you do for fun, your typical weekly schedule, and anything else you&apos;d like to include that gives me a sense of who you are as a person!  <br>\n<br>\nThanks,<br>\nRudy\n    ",
        "image": "http://images.craigslist.org/00T0T_eALdniQ6oY4_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4877453399.html"
    },
    {
        "title": "Room for Rent in Overlook! (utilities/internet included)",
        "href": "/mlt/roo/4880930385.html",
        "time": "2015-02-06 20:03",
        "price": "$650",
        "neighborhood": null,
        "postBody": "\n        Roommate wanted:  <br>\n<br>\n-$650/month (including all utilities and internet).<br>\n-One month security deposit is due with first month&apos;s rent.  <br>\n-Month-to-month lease.  <br>\n-No (more) pets.<br>\n<br>\nOne unfurnished bedroom in a 2 bedroom/ 2 full bathroom townhome, in a cohousing community.  The room is approximately 11x9 with a good sized closet and a view of Mount St. Helens.  The townhome is on the third floor with elevator access.  There is lots of natural light and great insulation (weather and sound).<br>\n<br>\nI am a 34 year old male, looking to share my home with a likeminded, mature and community-oriented person. Preferably late 20&apos;s - early 30&apos;s.  I like to have music on most times.  I spend most evenings and weekends at home, cook fairly often, and the house is fully furnished (minus your room).  I like to keep things clean, but not obsessive about it.  We recycle and compost everything.<br>\n<br>\nI share custody of two very friendly, small dogs - one week on/one week off.  Unfortunately, I do not have room for another pet.<br>\n<br>\nThe townhome has a full kitchen, dining and living space, but residents of our cohousing community have access to our common house, which includes a large industrial kitchen, great room (seats 50 hungry guests), media room, yoga studio, exercise room, shared tool library, bike garage, and free laundry facility.<br>\n<br>\nResidents all chip in for a few hours each month to maintain the grounds and clean the common house, and get together other nights to cook meals and eat together.  Participation isn&apos;t necessary from renters, but encouraged -- why else would you want to live in cohousing?<br>\n<br>\nWe are steps away from the 72 Bus, 2 blocks from the 35, and about a 10 minute walk to the MAX Yellow Line.  If you have a car, there is only street parking as we have no lot of our own, but it&apos;s a quiet street with plenty of space.<br>\n\n    ",
        "image": "http://images.craigslist.org/00s0s_bS0sh5YyBju_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880930385.html"
    },
    {
        "title": "Room SE Portland Next to Max",
        "href": "/mlt/roo/4880930190.html",
        "time": "2015-02-06 20:03",
        "price": "$500",
        "neighborhood": " (SE Portland)",
        "postBody": "\n        Two rooms will be available at the end of February. Townhome is 1300 sq ft, 3 bdrm, 2.5 ba, living room, study area, two stories, small back yard area, washer and dryer in unit. About a 2 minute walk to the max line that goes to downtown or Gresham. Located between Burnside and stark. Close to Mall 205. Unit is perfect for people without a car that commute by bus.<br>\n<br>\nAbout me: 31 yr female, 2 cats, work full time and taking night coursed at PSU. Quiet and respectable.<br>\nRooms are $500. Last month and $300 deposit due at move in. Will consider pmt plan for total move in cost. Rent includes water, garbage yard maintenance. Split the cost of electricity<br>\n\n    ",
        "image": "http://images.craigslist.org/00606_5ONuS84T5gg_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880930190.html"
    },
    {
        "title": "-$450 2 Rooms Available in Woodstock Neighborhood",
        "href": "/mlt/roo/4880904443.html",
        "time": "2015-02-06 19:45",
        "price": "$300",
        "neighborhood": " (se 66th and duke)",
        "postBody": "\n        We are looking for some awesome new roommates to share our rental house. We have 2 rooms available on March 1st.<br>\n<br>\nAbout the house:<br>\n4 bedrooms in the Woodstock neighborhood. Awesome if you commute by bike. Downtown Portland is a leisurely 40 minute ride away. If you&apos;re not into biking we have 2 off-street+2 on-street parking spots. We&apos;re fully equipped with a washer and dryer, and a full kitchen including a gas stove/oven, dishwasher, and microwave. The other common areas of the house include a huge living room with plenty of room for your furniture (current roommate is taking his couch when he leaves so there&apos;s really lots of room!), a slightly smaller dining room immediately off the kitchen, covered wood porch out back and a nice big back yard with garden beds and a barbecue.  Must be okay with kitties, Sorry, we don&apos;t have room for any more pets.<br>\n<br>\nUtilities include internet, gas, sewer, electric,  and tri-monthly water and garbage usually about $50-$75 a month, and a little more in the months that the water/garbage bill comes. Utilities split evenly per person, so if a couple joins us we will all pay the same amount. We also split household costs like TP, laundry and dish detergent, fabric softener, etc. <br>\n<br>\nAbout the Rooms:<br>\nRoom #1: $300+utilities. On the small side at about 10&apos;x10&apos; with a corner cutout where the door is set, and a small closet. Lots of windows for natural light. Carpeted. To make up for the small size of the room we reserve one of the parking spots in the driveway for you, and make sure there&apos;s plenty of storage throughout the house. See picture #2. (Current roomie is in the process of moving, a little hard to get a great picture)<br>\n<br>\nRoom #2: $450+utilities. About 11.5&apos;x12.5&apos; with a huge closet that runs the whole length of the room. Windows on 2 walls, hardwood floor. Tons of storage space above the closet as well! This room is large enough for a couple, but shares a bathroom with 2 other people. See pictures #3 and 4. (Current roomies will be taking over the master bedroom so there will be plenty of room for your stuff)<br>\n<br>\nAbout us:<br>\nWe are 3 nerdy, semi-hippie types. We enjoy board games, watching Netflix, playing World of Warcraft (Lok&apos;tar Ogar!), and attempting to grow stuff in the garden. We are definitely not a party house, but we don&apos;t mind the occasional shindig. We often have to be up at the crack of dawn and we need our beauty sleep! We all enjoy the occasional beer or drink, but smoking tobacco or 420 is not allowed (landlord&apos;s rules).<br>\n<br>\nRoomie #1: Mid 20&apos;s female, employed full time as a transportation dispatcher. I split my time between home and my boyfriend&apos;s house so I might not see you too often. If you do see me it&apos;s likely you&apos;ll find me watching various cooking shows on YouTube, or posting Instagram pictures of my dog, Eggnog. Don&apos;t worry, Eggnog doesn&apos;t live here, so if you&apos;re not into dogs it&apos;s not a problem!<br>\n<br>\nRoomies #2 and #3: late 20s/Early 30&apos;s male/female couple, both employed full time. One is a social worker who also attends PSU for her master&apos;s degree. The other works full time loading stock for a local vending supply company, is in the Army national guard, and rides his bike everywhere.<br>\n<br>\nIf you think you would be an awesome addition to our household please respond to this post. There is a $40 application fee per person and a $350 deposit per room. Applicant must be approved through landlord&apos;s financial/background check.\n    ",
        "image": "http://images.craigslist.org/01717_avZqf3CcxGu_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880904443.html"
    },
    {
        "title": "Clean and Sober living for women and children",
        "href": "/mlt/roo/4880896793.html",
        "time": "2015-02-06 19:33",
        "price": "$380",
        "neighborhood": " (141st SE Portland)",
        "postBody": "\n        Available Now!!!<br>\nMOVE IN NOW FOR $280<br>\nOn 141st SE Portland (off Stark)<br>\nWe are a Safe, Clean and Sober living home<br>\nfor Single Women and Mother and their children. <br>\nWe have Fully Furnish Rooms available for rent $380/ month<br>\n*Utilities included<br>\n*Free Wi-Fi<br>\n*Washer &amp; Dryer Access<br>\n*Close to max and bus lines<br>\n*Close to Fred Meyers and other shopping stores<br>\nIf you&apos;re interested please leave your Name &amp; Contact Information<br>\nThank You <br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880896793.html"
    },
    {
        "title": "gorgeous master available 3/1",
        "href": "/mlt/roo/4880896164.html",
        "time": "2015-02-06 19:20",
        "price": "$700",
        "neighborhood": null,
        "postBody": "\n        looking for another roomie to make our home complete. gorgeous three story new townhouse in northeast off the 72 just a quick bus ride to the max and a walk to albertsons/rite aid/gas/etc. w/d hookups and new appliances. room is largest master on third floor, large bathroom and closet. nice window and plush carpet. feel welcome to bring furniture and media collections, the main floor is an open and gorgeous common living area. we are friendly people just trying to maintain a great home. ommp. no landlord bs or crazy checks. just laidback dependable kind people. <br>\n<br>\nmove in 3/1<br>\nrent is 700 + split utilities<br>\nthird of deposit (500) and nonrefundable cleaning fee (250) <br>\n<br>\nlet us know; cant wait to meet you!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880896164.html"
    },
    {
        "title": "Seeking young female professional roommate- April",
        "href": "/mlt/roo/4877898316.html",
        "time": "2015-02-06 18:58",
        "price": "$750",
        "neighborhood": " (SE)",
        "postBody": "\n        Hi!<br>\n<br>\nI have a room available in  an awesome two bedroom unit in a fourplex in the SE. My roommate is moving out to move in with her boyfriend. We are hoping to find someone for mid April but the timeline is flexible depending on what works best! It was recently remodeled and is beautiful! Everything in the kitchen is new and there are brand new wood floors!<br>\n<br>\nThe rent is $1495 total and is split evenly between us. It includes water and garbage. Utilities and internet and TV is extra and is split between us. It usually runs around $75 per person. You will have your own room but the bathroom is shared. There is also tons of easy street parking available right out front.<br>\n<br>\nAbout me: I&apos;m a 25 year old female who moved to the area about 6 months ago. I moved from the Midwest in the fall for a new job. I like to cook, hike, bike and occasionally binge watch Netflix :) I drink occasionally and like to go out with friends every now and then, but nothing crazy. I don&apos;t bring the party home but might occasionally have small groups over. I also keep things pretty clean in the common areas. <br>\n<br>\nAbout you: female professional of similar age with a full time job. Hopefully we share some similar interests and could hang out a bit. Looking for someone who is laid back and who won&apos;t bring the party home with them. You should also be clean and willing to share in cleaning responsibilities. I don&apos;t want to have to clean up after anyone.<br>\n<br>\nIf this sounds like you message me with some details about yourself and any questions you might have! Change the subject to your fav food so I know it&apos;s not spam!<br>\n<br>\nNo Cats please! I would consider a small well behaved dog. Please no drugs either.\n    ",
        "image": "http://images.craigslist.org/01212_kSIORVpp7sL_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4877898316.html"
    },
    {
        "title": "Available room in a Nice Home",
        "href": "/mlt/roo/4873900136.html",
        "time": "2015-02-06 18:50",
        "price": "$500",
        "neighborhood": " (se portland)",
        "postBody": "\n        A possible room for rent for 1 person in a 3 bedroom 2 bath house with a fenced yard. The house is nice and clean. It is located SE Portland with easy access to 205 (Mt Scott area). Looking for the right person to rent a room in my home. The person is a professional, mature and tidy. No smoking, drugs, pets. Light alcohol use ok. $500 per month +1/2 of utilities. Will need to pay partially refundable $200 cleaning deposit and $125 non-refundable security deposit at move in. <br>\nAbout me: I like to kayak, bike ride, x-country ski and am a professional.\n    ",
        "image": "http://images.craigslist.org/00f0f_8aU9Szq6q9c_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4873900136.html"
    },
    {
        "title": "One room in 2br/1ba apt. - $367/mo + elec./internet",
        "href": "/mlt/roo/4880837767.html",
        "time": "2015-02-06 18:49",
        "price": "$367",
        "neighborhood": " (39th/Holgate)",
        "postBody": "\n        We are a young couple who just moved into a new apartment near SE 39th and Holgate. It is 850 sq ft with 2 bedrooms, 1 bath, a living room, and a kitchen. Floors and kitchen have been redone and there is a new washer and dryer in unit.<br>\n<br>\nWe are looking for a third roommate to move into the second bedroom on March 1 and join our year long lease (ends 01/31/2016). The rent is $1,100 per month which means that we would pay $366.67 each. Water and Sewer is included and we will split Internet and Electricity. It is a good location near Trader Joes, Walgreens, Safeway, many great restaurants and bars on Gladstone, and good access to public transportation.<br>\n<br>\nA little bit about us...<br>\n<br>\nMidori is a 25 year old Asian American, queer, woman with a professional history in education and political organizing. She recently moved back to the PNW from Chicago and is currently looking for work. She dabbles in art and making and is generally into (&amp; skilled in) sewing, print-making, paper crafts, painting, and poetry. Other interests/skills include cooking, reading, writing, listening to music and podcasts, bike-riding, and animals.<br>\n<br>\nTristan is a 24 year old (Midori says, &quot;Silence means he&apos;s a straight white dude.&quot;) filmmaker with his own company (cinepdx.com). He works from home semi-regularly but it is all quiet work on his computer. His hobbies include hiking, home brewing, drawing and reading. He likes hip-hop, bass music and weird, foreign films.<br>\n<br>\nTristan is good friends with the people in the apartment next door, so he (&amp; probably Midori) will do a good deal of hanging out there as well.<br>\n<br>\nQueer, PoC, radical, feminist friendly. Tristan has a turtle and Midori has plans for adopting a cat.<br>\n<br>\nIf you are interested in moving in with us, let&apos;s meet up and see if we click! If it seems like a good situation, you will have to fill out an application with our landlord and pay $45 for a background check. You would also have to pay $166.67 for the damage deposit. There is also shared storage available and a garage available for rent ($150/mo) in the complex.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880837767.html"
    },
    {
        "title": "Lovely Concordia Home close to it all!",
        "href": "/mlt/roo/4880869221.html",
        "time": "2015-02-06 18:49",
        "price": "$800",
        "neighborhood": " (35th and Jessup)",
        "postBody": "\n        The room 800$ a month + utilities .Space is located in the Concordia neighborhood.  Just a short walk away from new seasons . The room is on the top floor with a private bath . The bathroom has a  claw foot tub but no shower . You would share the shower downstairs with 1 other house mate . <br>\nThis room is huge ! Big walk in closet , Windows, sky lights with lots of natural light . There is a giant closet, a landing area perfect for an office, all carpeted, and with tons of storage space.<br>\n<br>\nThe shared spaces in the house are the living room ,kitchen,  and shower. There&apos;s a beautiful yard with a garden and side porch area. The downstairs is all hard wood floor, washer and dryer , storage shed available and an amazing kitchen with gas range! <br>\n(The photos were taken a year ago before I moved in but everything downstairs is the same!)<br>\n<br>\nThe house also comes with Mahjong an old lady Husky Corgi mix who captures the hearts of many. She isn&apos;t up for co dog habitation due to old age but she loves cats, so thats an option.<br>\n<br>\nThe housemate: She works full time as a Social Worker, she is 34, Queer, has lived in the house for 2 years and has the small downstairs bedroom next to the living room and kitchen. She keeps busy but also likes to cook up a storm in the kitchen and relax in the living room. Its important to her to have a great house mate, someone that is compatible on important things like general cleanliness, quiet at night, awareness that your bedroom is over hers with minimal insulation!, timely rent/utility payments etc. <br>\n<br>\nThere is a fair amount of yard work to do and there are 3 raise beds to plant in! And we just had a new and lovely arbor built. <br>\n<br>\nDue to the upstairs/downstairs situation no couples or other dogs, just single folk! The housemate is real open with guests/visitors. <br>\n<br>\nLooking forward to hearing from you!\n    ",
        "image": "http://images.craigslist.org/00l0l_azHkSQ7Ej1F_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880869221.html"
    },
    {
        "title": "Room Available March 1st",
        "href": "/mlt/roo/4870985005.html",
        "time": "2015-02-06 18:37",
        "price": "$625",
        "neighborhood": " (SE 70th/Duke)",
        "postBody": "\n        Unfurnished room in my 3 bed/1 bath shared home will be available for move in on March 1st.  Single occupant only.<br>\n<br>\n$625 covers rent and utilities.  Must be prepared to pay 1st months rent and all move in fees/deposits.<br>\nSingle pet will be considered with pet fee.  Month-to-month rental agreement.<br>\n<br>\nFenced yard, garden space if you want it, street parking.  Some storage space in garage available, including bike parking.  2 blocks from the 19 bus.  Close to Woodstock, Reed Collage, SE PCC, Johnson Creek, 205.<br>\n<br>\nAs this is communal housing, tenant will be asked to participate in a chore/cleaning rotation agreement.<br>\n<br>\nI am scheduling interviews. Please text, call or email to make an appointment or with any questions.<br>\n<br>\nThank you!  Nancy<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4870985005.html"
    },
    {
        "title": "Room for Rent Reed/Woodstock Neighborhood",
        "href": "/mlt/roo/4872498396.html",
        "time": "2015-02-06 18:18",
        "price": "$645",
        "neighborhood": " (se portland)",
        "postBody": "\n        Room for rent in my small but comfortable home, $500 + 1/2 utilities, approximately $145 (subject to change with rate changes). WiFi included. I am a 50+ year old woman, business owner, looking for a mature, employed, responsible, balanced person to share my peaceful humble home. Alcohol, drug, and smoke free, no drama please. Must love animals and be good with them, I have 2 larger active rescued dogs, 2 cats, and a bird. I would consider your pet. Room is about 10&apos;x12&apos;, shared bathroom, kitchen and other common areas. Lovely private backyard. Room is freshly painted/cleaned, available in February.\n    ",
        "image": "http://images.craigslist.org/00u0u_14rWKFTlXHS_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4872498396.html"
    },
    {
        "title": "Private Entrance, private room",
        "href": "/mlt/roo/4880821476.html",
        "time": "2015-02-06 17:58",
        "price": "$450",
        "neighborhood": " (Troutdale/east Gresham)",
        "postBody": "\n        Private Entrance, private room next to semi private bath in home located in Troutdale. Two older female adults, share the rest of the home.  This is not a share all common areas rental.  No smoking, parties, drama, or pets.  We have a dog that thinks he is toooo special for more pets.    This room was a good fit for a nurse that commuted to Portland, also a person that traveled on business  to the area often.   <br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880821476.html"
    },
    {
        "title": "Share Sunny2 Bdrm Apt/2nd Floor of 2-Story Craftsman /Couple/1 Person",
        "href": "/mlt/roo/4862120858.html",
        "time": "2015-02-06 17:54",
        "price": "$525",
        "neighborhood": " (SE Hawthorne)",
        "postBody": "\n        Looking for couple or one person to share/rent a room in peaceful, sunny 2 bedroom top floor apartment of a 1920&apos;s house converted into upstairs and downstairs apartments.    Seeking someone or two people who are stable, calm, responsible, either similar to me or just a good fit.  Short or longer term is ok.  I may also be interested in someone who may want to sublet the whole apartment for a few months, too (please let me know if that is something you might be interested in when you email).  <br>\n<br>\nAvailable immediately.<br>\n<br>\n$525 per month<br>\nMonth to month<br>\n1/2 utilities (water, gas, internet &amp; electric)<br>\nFirst and last months rent<br>\n$200 refundable deposit if apartment is cleaned and no repairs needed upon leaving<br>\nReferences required<br>\nIf a couple moves in, the rent would be adjusted some to reflect the additional person.<br>\n<br>\nThe Apartment: <br>\n<br>\nLot&apos;s of light - big long, old style windows throughout the apartment<br>\nSimple, nice, old style moldings/wood work<br>\nFurnished common space <br>\nUnfurnished bedroom<br>\n2 bedrooms<br>\nShare kitchen, 1 bathroom, living and dining room<br>\nGas stove &amp; heat <br>\nHardwood floors  <br>\nLinoleum in kitchen and bathroom<br>\nLimited basement storage <br>\nSeparate/plenty of bathroom and kitchen storage space (drawers, shelves, cabinets, utility closet)<br>\nBackyard shared with downstairs neighbors.<br>\nYard service mows lawn and takes care property<br>\nNew windows, water heater &amp; electrical.<br>\n<br>\nThe Room:<br>\n13 x15&apos;<br>\nHardwood floor<br>\nWest facing window:  4&apos; x 5 &apos;<br>\nBig closet:  81/2&apos; x 3&apos; x 41/2&apos;<br>\n<br>\nThe Neighborhood:<br>\nQuiet, residential, safe, primarily family/owner occupied homes.<br>\n2 blocks north of Hawthorne<br>\n3 blocks from #14 bus stop<br>\n<br>\nDownstairs neighbors:<br>\nQuiet, friendly, respectful.<br>\n<br>\nAbout me:<br>\nResponsible, conscientious, personable, clean/tidy, quiet female.  <br>\nI have degrees in Geography and Human Development.  My primary work was with founder and therapist of therapeutic program for a local children&apos;s hospital (multi-faceted), research w/PSU Dept. of Special Ed.  I currently working privately with individuals and families. The work I have done has included projects in the arts, conservation, education, health with community partners including PNCA, Portland Art Museum, Audubon.  I practice yoga/meditation, exercise, spend time with people closest to me or quietly on my own (reading, work related study).  I am close with my family (out of town). I am generally quiet, focused, disciplined.  I warm/personable/respectful with housemates, their friends and family.  <br>\n<br>\nRegarding Sharing a Home:<br>\nI appreciate kind, clear communication.<br>\nI am patient getting to know housemates as thing unfold naturally, nothing required (eg. sharing meals).<br>\nI am both personable and respectful of privacy for myself and housemates.<br>\nI live simply and am healthy.  I don&apos;t drink, smoke or do drugs. <br>\nI like a clean, peaceful, comfortable place where housemates and I can feel natural, at ease and enjoy coming home to.<br>\n<br>\nCat&apos;s ok.  Sorry, no dogs.  <br>\n<br>\nNo drugs or smoking. Light social drinking, if at all.  I don&apos;t drink (a personal choice, no related problem with drinking, drugs, etc).<br>\n<br>\nReference from previous housemates and downstairs tenants available.<br>\n<br>\nWhen you email a response, please let me know what the best times are for you to come to look at the apartment and meet with me and I will do my best to accommodate you. Thank you.\n    ",
        "image": "http://images.craigslist.org/01212_lr2GLJ9iZpm_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4862120858.html"
    },
    {
        "title": "new basement, bed / liv. rm.",
        "href": "/mlt/roo/4870830427.html",
        "time": "2015-02-06 17:44",
        "price": "$850",
        "neighborhood": " (n.ptld)",
        "postBody": "\n        bedroom and living room or can be 2 rooms,couple,or to that want to split rent,cable,wireless,all util.incl. many extras to keep a drama free home, main level is shared,w/d,park setting in front,close to bus,shopping, more,no pets,smoking outside, off n.lombard,4 miles west of I-5,1st.mo.&amp; - last mo.a 60 day notice of termination of the rooms as I&apos;m not asking for a lease,850.00 mo,\n    ",
        "image": "http://images.craigslist.org/00U0U_kVYb7a8bHaD_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4870830427.html"
    },
    {
        "title": "Room available in quiet close-in SE Portland neighborhood",
        "href": "/mlt/roo/4872260182.html",
        "time": "2015-02-06 17:44",
        "price": "$450",
        "neighborhood": " (Eastmoreland)",
        "postBody": "\n        My housemate/tenant recently moved on to her own apartment, and so I&apos;m looking for a replacement.  The rent is <b>$450/month plus a flat $100/month for all utilities</b>, starting on a month-to-month basis so we can be sure it&apos;s a good fit for both of us.  I don&apos;t expect a roommate to be my best friend, but I&apos;d like to find someone whose personality and lifestyle meshes well with mine, and it&apos;s more important to me to find the <i>right</i> person than to get someone in there <i>right now</i>.<br>\n<br>\n<b>About the location:</b><br>\n- Quiet tree-filled residential neighborhood (Eastmoreland), near Woodstock commercial area and Reed College<br>\n- 1/3 mile from #19 and #75 bus lines, 1/2 mile from Springwater Trail, 1 mile from new Portland-Milwaukie MAX line<br>\n- 15-minute drive to downtown, 2.5 miles from Division, 3 miles from Hawthorne<br>\n- Easy on-street parking<br>\n<br>\n<b>About your space:</b><br>\n- Main floor bedroom, 13&apos;x8&apos;, unfurnished, with closet and large windows facing the backyard<br>\n- Your own separate dressing room, 9&apos;x6&apos;, with lots of natural light and more closet space<br>\n<br>\n<b>About the house:</b><br>\n- Two stories, 2.5BR/1BA, built in 1920; I&apos;ve lived here for 10 years<br>\n- Big bathroom with vanity that includes plenty of drawers<br>\n- Shared kitchen, living room, and dining room are furnished<br>\n- Washer/dryer &amp; dishwasher in kitchen<br>\n- Basement and outdoor shed are available for storage<br>\n- Private fenced backyard with raspberries, fruit trees, and patio<br>\n- A friendly orange cat lives here part-time<br>\n<br>\n<b>About you:</b><br>\n- Professional with a reliable income source<br>\n- Non-smoker, no drugs<br>\n- No pets (the cat would not approve!)<br>\n- Having a car would be ideal, because of the location<br>\n<br>\n<b>About me:</b><br>\n- Omnivorous, politically liberal, outdoorsy<br>\n- Work from an upstairs home office<br>\n- I keep the house pretty clutter-free, but I&apos;m not a clean-freak<br>\n<br>\nIf you&apos;re potentially interested, send a note and tell me something about yourself and your situation, including contact info (e-mail and phone). I may ask for references later in the process, and my last housemate -- who was here for three years -- says she&apos;s willing to be a reference for <i>me</i> if you like.<br>\n\n    ",
        "image": "http://images.craigslist.org/00y0y_9jkUviSFw33_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4872260182.html"
    },
    {
        "title": "Room in Social, Lively House for 1 Person",
        "href": "/mlt/roo/4880782147.html",
        "time": "2015-02-06 17:31",
        "price": "$300",
        "neighborhood": " (north portland)",
        "postBody": "\n        We are looking to fill a basement room in our house of four fun people in our twenties. It is only big enough for one person. We have 2 indoor-only cats, so ideally you like cats and are ok with following some safety precautions we have for them (such as never leaving doors to outside open, and a few other things). We cannot accept any more free roaming animals but might be open to small/caged pets like rodents, lizards, etc.<br>\n<br>\nThis is not a typical house-share situation. We are a pretty close group that spends most of our time (when we are home) hanging out in the living room or backyard, so the best fit would be someone looking to become friends with your roommates! We do have other friends over a couple times a week, and quite a few big parties, but we try to plan around each other&apos;s work schedules. This is not going to be the pinnacle of peace and quiet, but that&apos;s how we like it.<br>\n<br>\nThis is a really nice home that has a lot of potential, so if you would like to join in on projects around the house or yard, that&apos;s a plus. Examples of these projects include our garden out front and fire pit out back! None of us have any hangups about others&apos; lifestyles as long as everyone pays their rent and utilities on time and is nice to everyone else. You must be tolerant of everyone&apos;s choices. Probably not a good space for sobriety, however none of us have addiction issues. We aren&apos;t skeezy but we do like to have fun! Almost anything goes as long as it&apos;s done responsibly.<br>\n<br>\nWe are on the border between the Mock Crest and Kenton neighborhoods. There is an organic convenience/grocery store a couple blocks away that one of us works at, Green Zebra, as well a neat little bar, The Foggy Notion. King Burrito, usually open late, is also a highlight of the neighborhood. <br>\n<br>\nWe have three floors- two rooms upstairs, one filled by a couple. Your room is the largest room in the house. It is in an unfinished basement. It does have windows though. There is a main floor bathroom (with a shower you&apos;d share with your downstairs floor roommate only).<br>\n<br>\nEach of us split rent evenly, as well as natural gas, internet, water, and electric bills.<br>\nAgain, we are pretty much looking for a responsible, chill, cat-friendly person that is down with some noise and parties, and hopefully becomes a long-term member of the household. We need someone for March 1st, with rent due at move-in. We are not asking for first &amp; last or deposit. <br>\n<br>\nReply by email with a little bit about yourself and what you think of what you&apos;ve read here, if you&apos;re interested. Links to social media (your facebook or whatever) are helpful. As long as this posting is up, the room is still available. We will be hosting interviews throughout the month of February.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880782147.html"
    },
    {
        "title": "BEAUTIFUL &amp; FRIENDLY HOUSE ROOMMATE WANTED",
        "href": "/mlt/roo/4877652373.html",
        "time": "2015-02-06 17:30",
        "price": "$500",
        "neighborhood": " (130TH DIVISION)",
        "postBody": "\n        Hello, I have an empty room in a quiet neighborhood in the SE area up for rent $500/ month utilities and internet included. <br>\n<br>\nOur us:<br>\n<br>\nWe are in early and mid 30&apos;s.  My uncle and I are laid back cool as a cucumber laid back people both have full time job. I work from 10-7PM and he works the night shift. We are responsible adult not into any kind of drugs (no thank you) and are looking for a like mind room mate, who clean after themselves. I&apos;m a spiritually fit and morally clean man who attends church every weekend.  And my uncle takes his son to Takewondo practice daily.  <br>\n<br>\nPlease text me to check things out.\n    ",
        "image": "http://images.craigslist.org/00G0G_fGNpA8if5fY_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4877652373.html"
    },
    {
        "title": "Renters Beware of 82nd, 122nd, I205.",
        "href": "/mlt/roo/4880792384.html",
        "time": "2015-02-06 17:29",
        "price": null,
        "neighborhood": null,
        "postBody": "\n        All these areas are full of tweakers, drunks, hookers etc. <br>\n<br>\nPeople offering rooms for $500 plus utilities are ripping you off.<br>\n<br>\nThese neighborhoods are trash!!!<br>\n<br>\nBeware newcomers. Powell Blvd past 65th is trash. <br>\n<br>\nSad to say, truth be known. Dont live in a dump!!!\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880792384.html"
    },
    {
        "title": "+ 1/2 electricity($35-50 winter)",
        "href": "/mlt/roo/4880788640.html",
        "time": "2015-02-06 17:26",
        "price": "$325",
        "neighborhood": " (Se 52nd &amp; Holgate)",
        "postBody": "\n        One room available in one bedroom apartment.<br>\nLiving room has partitioned wall for privacy.<br>\nShared bathroom/kitchen. Basically no common area for lounging.<br>\nI am a culinary professional in his mid 20&apos;s who works in N portland.<br>\nI&apos;m pretty quiet but personable. I don&apos;t drink often, though don&apos;t mind if you do. <br>\nI am very 420 friendly and I do smoke cigarettes(outside only). I work late and commute by bike, so I do come in late on days that I close. <br>\n<br>\nEmail me if interested.  It&apos;s relatively close quarters but you can&apos;t bea<br>\nt the price.<br>\n<br>\nMonth to month.<br>\nNo lease agreement necessary, but possible.<br>\n<br>\n1st month up front, ideally last as well, but I&apos;m willing to set some sort of agreement if need be.<br>\n<br>\nAvailable March 1st.<br>\n<br>\nThanks!<br>\n-Nate<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880788640.html"
    },
    {
        "title": "Lovely Furnished Room for Rent/Home to Share",
        "href": "/mlt/roo/4855080275.html",
        "time": "2015-02-06 17:25",
        "price": "$675",
        "neighborhood": " (Kenton)",
        "postBody": "\n        No Pets. Home is smoking, alcohol and drug-free.<br>\n<br>\nWonderful room with wood floors and furnishings for rent in a shared, charming ranch home.<br>\nLooking for Females only, please. <br>\nIdeal for professionals, students, international and local travelers, looking for a three-month (min) to 9-month rental.<br>\n<br>\nRent is $675, and utilities are included- wifi, electricity, gas heat and water usage. <br>\nTo move in, you need first month&apos;s rent and $600 security deposit, to be refunded upon move-out inspection. <br>\nTotal move in cost is $1,275.<br>\n<br>\nAvailable now.<br>\n<br>\nShare of home includes use of washer and dryer, and all common areas- kitchen, living and dining rooms, two bathrooms, and front and back gardens. The room is 12x12, has big closet, is fully furnished with a queen-sized bed, dresser and a bookcase. The home is a warm, charming ranch house with original red oak floors. <br>\nQuiet, bike-friendly residential street, directly on 40-mile bike loop, in great neighborhood with Community Center, Gym, Health Food store, Parks; walking distance to Caf&#xE9;s, Restaurants, Library, Drug store, Banks. Centrally located to University of Portland and PCC- Cascade campus. Only 20 minutes from busy Downtown area. Bus Lines: 4 and 35. Walking distance to MAX.<br>\nPlease email if interested, we look forward to sharing our wonderful space!\n    ",
        "image": "http://images.craigslist.org/00808_dkFh0w2Rzkj_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4855080275.html"
    },
    {
        "title": "room &amp; semi-private bath",
        "href": "/mlt/roo/4872285711.html",
        "time": "2015-02-06 17:24",
        "price": "$425",
        "neighborhood": " (Hazelwood/Montavilla)",
        "postBody": "\n        I have a room to rent with a separate bath in my home near Ventura park. If you have a car there is lots room for street parking &amp; it is near Gateway Max train.  My requirements are the following - male or female makes no never mind however,....no pets....non-smoker.....and this is not a party place.  I am a respectful &amp; easy going person who has spent some time to make a nice clean home on a quiet neighborhood street &amp; hope to find a like-minded mature roommate.  All utilities will be split evenly between us.  <br>\n<br>\nI will request references &amp; proof of some longer terms of employment &amp; will do a credit check.  I also will need a $100 cleaning deposit. I look forward to meeting with you.\n    ",
        "image": "http://images.craigslist.org/00404_lbrJYr8rWNt_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4872285711.html"
    },
    {
        "title": "Female Student Seeks Mature Female Roomma",
        "href": "/mlt/roo/4858895940.html",
        "time": "2015-02-06 17:13",
        "price": "$425",
        "neighborhood": " (Gresham)",
        "postBody": "\n        Hi,<br>\n<br>\nI&apos;m a full time student @ MHCC and work graveyard.  I enjoy a peace and quiet atmosphere. <br>\nI am most comfortable in a neat and clean environment. <br>\nConvenient location in downtown Gresham, close to max and bus lines, 10 minutes from MHCC.<br>\nNO Alcohol and drugs.<br>\nBackground check required.<br>\n<br>\nPlease contact me if you are interested in setting up an appointment to meet.<br>\nThank you &amp; have a nice day.\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4858895940.html"
    },
    {
        "title": "Large top floor room for rent $700/month",
        "href": "/mlt/roo/4880762881.html",
        "time": "2015-02-06 17:02",
        "price": "$700",
        "neighborhood": " (Near NE MLK &amp; Killingsworth)",
        "postBody": "\n        Available April 1, 2015 through August 31, 2015 while I&apos;m away for work. Large, well lit room with private full bathroom and walk in closet.  This room/bathroom/closet is the entire upstairs of the house. IF this room had a kitchen and private entrance, it would be a good sized one bedroom apt. The other two occupants are active young professionals-1 male, 1 female (not a couple) who occupy the other two rooms.  Awesome porch, kitchen and fireplace in the common area.  5 minute walk to the western end of Alberta District restaurants/bars.   Not furnished.  No pets :(         <br>\nLGB/420 friendly.<br>\n<br>\nDimensions(in feet)-Bedroom: ~16x15   Bathroom: ~7x7 +bathtub, Closet: ~7x9\n    ",
        "image": "http://images.craigslist.org/00U0U_5nmNkrPlw13_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880762881.html"
    },
    {
        "title": "2 bed / 2 bath apartment - linc301 close to PSU / Downtown",
        "href": "/mlt/roo/4872993103.html",
        "time": "2015-02-06 16:54",
        "price": "$1600",
        "neighborhood": " (Downtown)",
        "postBody": "\n        I am looking for someone to take over my lease, starting at the beginning of March (possibly sooner), and runs until the end of June. In the linc301 building, near PSU, Max lines and downtown. <br>\n<br>\nRent is $1675 / month + utilities (water/sewage + electricity).<br>\n<br>\nIt is a 2 bed / 2 bath. The master bedroom has an attached bathroom and 2 closets. The second bedroom measures 11&apos; x 10&apos; with a closet that is 7&apos; wide. All the rooms have an independent thermostat and radiator.<br>\n<br>\nLocated on the top (14th) floor, there is a beautiful view looking out east towards the river, and you can see Mt Hood on a clear day. <br>\n<br>\nLaundry machines on the bottom floor of the building.<br>\n<br>\nParking is available on the property, in a secured garage. Ranges from $60-$120 / month, depending on vehicle type<br>\n<br>\nUtilities are not included, you would need to set up accounts with AUM and PGE. <br>\n<br>\nPets are allowed with an additional deposit.\n    ",
        "image": "http://images.craigslist.org/00W0W_6IH5Dzdr95Q_600x450.jpg",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4872993103.html"
    },
    {
        "title": "Caregiver wanted",
        "href": "/mlt/roo/4849178871.html",
        "time": "2015-02-06 16:32",
        "price": null,
        "neighborhood": " (Newport)",
        "postBody": "\n        66 year old needing live in caregiver pay is roam and board\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4849178871.html"
    },
    {
        "title": "rooms available to rent month to month",
        "href": "/mlt/roo/4880716017.html",
        "time": "2015-02-06 16:22",
        "price": "$450",
        "neighborhood": " (ne 122nd and glisan)",
        "postBody": "\n        I have two rooms in my house available for rent.<br>\n<br>\nI own my house and I rent out the bedrooms and I have seperate living quarters in the garage. I work full time as a self employed general contractor.<br>\n<br>\nThe house is located off 126th and glisan, its a very short walk to the 122nd and burnside max stop. As well as the 122nd bus stop.<br>\n<br>\nSafeway, walgreens, McDonalds, kfc, little ceasers and much much more are all a short walk away. Very convenient.  <br>\n<br>\nThe house has a full kitchen with nice appliances. There is a new washer and dryer to use as you please. There is a shared full bathroom in the hall that has been recently remodeled. The house has a big front yard and big back yard.<br>\nThe living room and kitchen are furnished with nice couches and table and chairs.<br>\n<br>\nI am ok with pets, with a small deposit.<br>\n<br>\nRooms for rent...<br>\n<br>\nOne bedroom has an attatched half bathroom, that has been recently remodeled. This room also has a full size closet. Rent for room is $550 and a $500 deposit.<br>\n<br>\nThe second bedroom available is across the hall and it is a bedroom with a full size closet. Rent for this room is $450 with a $500 deposit.<br>\n<br>\nRENT INCLUDES ALL UTILITIES <br>\nWater sewer gas electric<br>\n<br>\n<br>\nPlease feel free to call or text if interested in either room.<br>\n<br>\n\n <a href=\"/fb/pdx/roo/4880716017\" class=\"showcontact\" title=\"click to show contact info\" rel=\"nofollow\">show contact info</a>\n<br>\n<br>\nThe rooms are basically ready to move into right now and I would like to get them rented out as soon as possible <br>\n<br>\nThank you for looking.<br>\n<br>\n<br>\n<br>\n\n    ",
        "fullUrl": "http://portland.craigslist.org/mlt/roo/4880716017.html"
    }
]